rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x418    0x4000_0418
    15:0    R/W FW_GENERAL_REG12X                       16'h0
    31:16   R/W FW_GENERAL_REG13X                       16'h0
 */
typedef volatile union _AON_REG12X_FW_GENERAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_REG12X: 16;
        uint32_t FW_GENERAL_REG13X: 16;
    };
} AON_REG12X_FW_GENERAL_TYPE;

/* 0x41C    0x4000_041c
    0       w1o reg_dsp_flash_prot                  1'b0
    1       w1o reg_aon_hwspi_en_rp                 1'b0
    2       w1o reg_aon_debug_port_wp               1'b0
    3       w1o reg_aon_dbg_boot_dis                1'b0
    11:04   w1o XTAL32K_Reserved16[13:6]            8'h0
    31:12   w1o RSVD                                20'h0

 */
typedef volatile union _AON_REG14X_FW_GENERAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t reg_dsp_flash_prot: 1;
        uint32_t reg_aon_hwspi_en_rp: 1;
        uint32_t reg_aon_debug_port_wp: 1;
        uint32_t reg_aon_dbg_boot_dis: 1;
        uint32_t XTAL32K_Reserved16_13_6: 8;
        uint32_t RSVD: 20;
    };
} AON_REG14X_FW_GENERAL_TYPE;

/* 0x420    0x4000_0420
    0       w1o is_efuse_invalid                    1'b0
    1       w1o is_enable_efuse_bank0_read_protect  1'b0
    2       w1o is_enable_efuse_bank0_write_protect 1'b0
    3       w1o is_enable_efuse_bank0_read_protect  1'b0
    4       w1o is_enable_efuse_bank0_write_protect 1'b0
    5       w1o is_hw_aes_dma_mode                  1'b0
    6       w1o is_debug_password_invalid           1'b0
    7       w1o is_disable_set_reg_by_otp           1'b0
    8       w1o is_enable_image_auth_when_resume    1'b0
    9       w1o is_enable_pmc_platform              1'b0
    10      w1o is_enable_bt_platform               1'b0
    15:11   w1o reg_aon_w1o_gpr_2                   5'h0
    31:16   w1o reg_aon_w1o_gpr_3                   16'h0
 */
typedef volatile union _AON_REG16X_FW_GENERAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t is_efuse_invalid: 1;
        uint32_t is_enable_efuse_bank0_read_protect: 1;
        uint32_t is_enable_efuse_bank0_write_protect: 1;
        uint32_t is_enable_efuse_bank1_read_protect: 1;
        uint32_t is_enable_efuse_bank1_write_protect: 1;
        uint32_t is_hw_aes_dma_mode: 1;
        uint32_t is_debug_password_invalid: 1;
        uint32_t is_disable_set_reg_by_otp: 1;
        uint32_t is_enable_image_auth_when_resume: 1;
        uint32_t is_enable_pmc_platform: 1;
        uint32_t is_enable_bt_platform: 1;
        uint32_t reg_aon_w1o_gpr_2: 5;
        uint32_t reg_aon_w1o_gpr_3: 16;
    };
} AON_REG16X_FW_GENERAL_TYPE;

/* 0x424    0x4000_0424
    0       w1o is_disable_hci_read_chip_info       1'b0
    1       w1o is_disable_hci_mac_rf_access        1'b0
    2       w1o is_disable_hci_wifi_coexist_func    1'b0
    3       w1o is_disable_hci_set_uart_baudrate    1'b0
    4       w1o is_disable_hci_rf_dbg_func          1'b0
    5       w1o is_disable_hci_bt_extension         1'b0
    6       w1o is_disable_hci_bt_dbg_func          1'b0
    7       w1o is_disable_hci_bt_test              1'b0
    8       w1o is_disable_hci_rf_test              1'b0
    9       w1o is_disable_mpl_ram_patch            1'b0
    10      w1o is_disable_mpl_flash_access         1'b0
    11      w1o is_disable_mpl_system_access        1'b0
    12      w1o is_disable_mpl_otp_access           1'b0
    15:13   w1o reg_aon_w1o_gpr_4                   3'h0
    31:16   w1o reg_aon_w1o_gpr_5                   16'h0
 */
typedef volatile union _AON_REG18X_FW_GENERAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t is_disable_hci_read_chip_info: 1;
        uint32_t is_disable_hci_mac_rf_access: 1;
        uint32_t is_disable_hci_wifi_coexist_func: 1;
        uint32_t is_disable_hci_set_uart_baudrate: 1;
        uint32_t is_disable_hci_rf_dbg_func: 1;
        uint32_t is_disable_hci_bt_extension: 1;
        uint32_t is_disable_hci_bt_dbg_func: 1;
        uint32_t is_disable_hci_bt_test: 1;
        uint32_t is_disable_hci_rf_test: 1;
        uint32_t is_disable_mpl_ram_patch: 1;
        uint32_t is_disable_mpl_flash_access: 1;
        uint32_t is_disable_mpl_system_access: 1;
        uint32_t is_disable_mpl_otp_access: 1;
        uint32_t reg_aon_w1o_gpr_4: 3;
        uint32_t reg_aon_w1o_gpr_5: 16;
    };
} AON_REG18X_FW_GENERAL_TYPE;

/* 0x428    0x4000_0428
    15:0    R/W FW_GENERAL_REG20X                       16'h0
    31:16   R/W FW_GENERAL_REG21X                       16'h0
 */
typedef volatile union _AON_REG20X_FW_GENERAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_REG20X: 16;
        uint32_t FW_GENERAL_REG21X: 16;
    };
} AON_REG20X_FW_GENERAL_TYPE;

/* 0x42C    0x4000_042c
    15:0    R/W FW_GENERAL_REG22X                       16'h0
    31:16   R/W FW_GENERAL_REG23X                       16'h0
 */
typedef volatile union _AON_REG22X_FW_GENERAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_REG22X: 16;
        uint32_t FW_GENERAL_REG23X: 16;
    };
} AON_REG22X_FW_GENERAL_TYPE;

/* 0x460    0x4000_0460
    0       W1O reg_aon_w1o_dumm0                       1'b0
    1       W1O reg_aon_w1o_dumm1                       1'b0
    2       W1O reg_rom_trace_prot                      1'h0
    3       W1O reg_aon_w1o_pn_cfo_comp_dis             1'h0
    4       W1O reg_aon_w1o_detail_rxrpt_dis            1'h0
    5       W1O reg_aon_w1o_detail_rxrpt_cfoe_dis       1'h0
    6       W1O reg_aon_w1o_pa_func_dis                 1'h0
    7       W1O reg_aon_w1o_cis_func_dis                1'h0
    8       W1O reg_aon_w1o_bis_func_dis                1'h0
    31:9    R   RSVD                                    23'b0
 */
typedef volatile union _AON_REG0X_FUNC_DIS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t reg_aon_w1o_dumm0: 1;
        uint32_t reg_aon_w1o_dumm1: 1;
        uint32_t reg_rom_trace_prot: 1;
        uint32_t reg_aon_w1o_pn_cfo_comp_dis: 1;
        uint32_t reg_aon_w1o_detail_rxrpt_dis: 1;
        uint32_t reg_aon_w1o_detail_rxrpt_cfoe_dis: 1;
        uint32_t reg_aon_w1o_pa_func_dis: 1;
        uint32_t reg_aon_w1o_cis_func_dis: 1;
        uint32_t reg_aon_w1o_bis_func_dis: 1;
        uint32_t RSVD: 23;
    };
} AON_REG0X_FUNC_DIS_TYPE;

/* 0x464    0x4000_0464
    0       R/W saf_aon_nonsec_slave                    1'b1                    !saf_nonsec_slave_lock
    1       R/W saf_peri_on_nonsec_slave                1'b1                    !saf_nonsec_slave_lock
    2       R/W saf_soc_vendor_reg_nonsec_slave         1'b1                    !saf_nonsec_slave_lock
    3       R/W saf_ir_rc_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    4       R/W saf_qdec_nonsec_slave                   1'b1                    !saf_nonsec_slave_lock
    5       R/W saf_gmac_ctrl_nonsec_slave              1'b1                    !saf_nonsec_slave_lock
    6       R/W saf_spic0_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    7       R/W saf_spic1_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    8       R/W saf_spic2_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    9       R/W saf_spi0_nonsec_slave                   1'b1                    !saf_nonsec_slave_lock
    10      R/W saf_spi1_nonsec_slave                   1'b1                    !saf_nonsec_slave_lock
    11      R/W saf_spi_slave_nonsec_slave              1'b1                    !saf_nonsec_slave_lock
    12      R/W saf_rtzip_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    13      R/W saf_enhanced_timer_nonsec_slave         1'b1                    !saf_nonsec_slave_lock
    14      R/W saf_modemrfcpi_nonsec_slave             1'b1                    !saf_nonsec_slave_lock
    15      R/W saf_usb_otg_cfg_nonsec_slave            1'b1                    !saf_nonsec_slave_lock
    16      R/W saf_i2s0_nonsec_slave                   1'b1                    !saf_nonsec_slave_lock
    17      R/W saf_i2s1_nonsec_slave                   1'b1                    !saf_nonsec_slave_lock
    18      R/W saf_spi_codec_nonsec_slave              1'b1                    !saf_nonsec_slave_lock
    19      R/W saf_display_ctrl_nonsec_slave           1'b1                    !saf_nonsec_slave_lock
    20      R/W saf_iso7816_nonsec_slave                1'b1                    !saf_nonsec_slave_lock
    21      R/W saf_segcom_ctl_nonsec_slave             1'b1                    !saf_nonsec_slave_lock
    22      R/W saf_bluewiz_nonsec_slave                1'b1                    !saf_nonsec_slave_lock
    23      R/W saf_bt_vendor_reg_nonsec_slave          1'b1                    !saf_nonsec_slave_lock
    24      R/W saf_zigbee_nonsec_slave                 1'b1                    !saf_nonsec_slave_lock
    25      R/W saf_sdio_host0_cfg_nonsec_slave         1'b1                    !saf_nonsec_slave_lock
    26      R/W saf_gpioa_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    27      R/W saf_gpiob_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    28      R/W saf_timer_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    29      R/W saf_sar_adc_nonsec_slave                1'b1                    !saf_nonsec_slave_lock
    30      R/W saf_adc_24bit_nonsec_slave              1'b1                    !saf_nonsec_slave_lock
    31      R/W saf_spi_3wire_nonsec_slave              1'b1                    !saf_nonsec_slave_lock
 */
typedef volatile union _AON_REG0X_SAF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t saf_aon_nonsec_slave: 1;
        uint32_t saf_peri_on_nonsec_slave: 1;
        uint32_t saf_soc_vendor_reg_nonsec_slave: 1;
        uint32_t saf_ir_rc_nonsec_slave: 1;
        uint32_t saf_qdec_nonsec_slave: 1;
        uint32_t saf_gmac_ctrl_nonsec_slave: 1;
        uint32_t saf_spic0_nonsec_slave: 1;
        uint32_t saf_spic1_nonsec_slave: 1;
        uint32_t saf_spic2_nonsec_slave: 1;
        uint32_t saf_spi0_nonsec_slave: 1;
        uint32_t saf_spi1_nonsec_slave: 1;
        uint32_t saf_spi_slave_nonsec_slave: 1;
        uint32_t saf_rtzip_nonsec_slave: 1;
        uint32_t saf_enhanced_timer_nonsec_slave: 1;
        uint32_t saf_modemrfcpi_nonsec_slave: 1;
        uint32_t saf_usb_otg_cfg_nonsec_slave: 1;
        uint32_t saf_i2s0_nonsec_slave: 1;
        uint32_t saf_i2s1_nonsec_slave: 1;
        uint32_t saf_spi_codec_nonsec_slave: 1;
        uint32_t saf_display_ctrl_nonsec_slave: 1;
        uint32_t saf_iso7816_nonsec_slave: 1;
        uint32_t saf_segcom_ctl_nonsec_slave: 1;
        uint32_t saf_bluewiz_nonsec_slave: 1;
        uint32_t saf_bt_vendor_reg_nonsec_slave: 1;
        uint32_t saf_zigbee_nonsec_slave: 1;
        uint32_t saf_sdio_host0_cfg_nonsec_slave: 1;
        uint32_t saf_gpioa_nonsec_slave: 1;
        uint32_t saf_gpiob_nonsec_slave: 1;
        uint32_t saf_timer_nonsec_slave: 1;
        uint32_t saf_sar_adc_nonsec_slave: 1;
        uint32_t saf_adc_24bit_nonsec_slave: 1;
        uint32_t saf_spi_3wire_nonsec_slave: 1;
    };
} AON_REG0X_SAF_TYPE;

