rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x468    0x4000_0468
    0       R/W saf_uart0_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    1       R/W saf_uart1_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    2       R/W saf_uart2_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    3       R/W saf_uart3_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    4       R/W saf_i2c0_nonsec_slave                   1'b1                    !saf_nonsec_slave_lock
    5       R/W saf_i2c1_nonsec_slave                   1'b1                    !saf_nonsec_slave_lock
    6       R/W saf_key_scan_nonsec_slave               1'b1                    !saf_nonsec_slave_lock
    7       R/W saf_public_key_engine_nonsec_slave      1'b1                    !saf_nonsec_slave_lock
    8       R/W saf_flash_sec_nonsec_slave              1'b1                    !saf_nonsec_slave_lock
    9       R/W saf_aes_nonsec_slave                    1'b1                    !saf_nonsec_slave_lock
    10      R/W saf_sha256_nonsec_slave                 1'b1                    !saf_nonsec_slave_lock
    11      R/W saf_trng_nonsec_slave                   1'b1                    !saf_nonsec_slave_lock
    12      R/W saf_efuse_controller_nonsec_slave       1'b1                    !saf_nonsec_slave_lock
    13      R/W saf_spi0_hs_nonsec_slave                1'b1                    !saf_nonsec_slave_lock
    14      R/W saf_rxi350_dmac_cfg_nonsec_slave        1'b1                    !saf_nonsec_slave_lock
    15      R/W saf_ppe_cfg_nonsec_slave                1'b1                    !saf_nonsec_slave_lock
    16      R/W saf_can_nonsec_slave                    1'b1                    !saf_nonsec_slave_lock
    17      R/W saf_spic_phy_nonsec_slave               1'b1                    !saf_nonsec_slave_lock
    18      R/W saf_i2c2_nonsec_slave                   1'b1                    !saf_nonsec_slave_lock
    19      R/W saf_i2c3_nonsec_slave                   1'b1                    !saf_nonsec_slave_lock
    20      R/W saf_uart4_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    21      R/W saf_uart5_nonsec_slave                  1'b1                    !saf_nonsec_slave_lock
    22      R   RSVD                                    1'b0
    23      R   RSVD                                    1'b0
    24      R   RSVD                                    1'b0
    25      R   RSVD                                    1'b0
    26      R   RSVD                                    1'b0
    27      R/W saf_dummy0_nonsec_slave                 1'b1                    !saf_nonsec_slave_lock
    28      R/W saf_dummy1_nonsec_slave                 1'b1                    !saf_nonsec_slave_lock
    29      R/W saf_dummy2_nonsec_slave                 1'b1                    !saf_nonsec_slave_lock
    30      R/W saf_dummy3_nonsec_slave                 1'b1                    !saf_nonsec_slave_lock
    31      W1O saf_nonsec_slave_lock                   1'b0
 */
typedef volatile union _AON_REG1X_SAF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t saf_uart0_nonsec_slave: 1;
        uint32_t saf_uart1_nonsec_slave: 1;
        uint32_t saf_uart2_nonsec_slave: 1;
        uint32_t saf_uart3_nonsec_slave: 1;
        uint32_t saf_i2c0_nonsec_slave: 1;
        uint32_t saf_i2c1_nonsec_slave: 1;
        uint32_t saf_key_scan_nonsec_slave: 1;
        uint32_t saf_public_key_engine_nonsec_slave: 1;
        uint32_t saf_flash_sec_nonsec_slave: 1;
        uint32_t saf_aes_nonsec_slave: 1;
        uint32_t saf_sha256_nonsec_slave: 1;
        uint32_t saf_trng_nonsec_slave: 1;
        uint32_t saf_efuse_controller_nonsec_slave: 1;
        uint32_t saf_spi0_hs_nonsec_slave: 1;
        uint32_t saf_rxi350_dmac_cfg_nonsec_slave: 1;
        uint32_t saf_ppe_cfg_nonsec_slave: 1;
        uint32_t saf_can_nonsec_slave: 1;
        uint32_t saf_spic_phy_nonsec_slave: 1;
        uint32_t saf_i2c2_nonsec_slave: 1;
        uint32_t saf_i2c3_nonsec_slave: 1;
        uint32_t saf_uart4_nonsec_slave: 1;
        uint32_t saf_uart5_nonsec_slave: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 1;
        uint32_t saf_dummy0_nonsec_slave: 1;
        uint32_t saf_dummy1_nonsec_slave: 1;
        uint32_t saf_dummy2_nonsec_slave: 1;
        uint32_t saf_dummy3_nonsec_slave: 1;
        uint32_t saf_nonsec_slave_lock: 1;
    };
} AON_REG1X_SAF_TYPE;

/* 0x46C    0x4000_046c
    0       R/W usbotg_hnonsec                          1'b1                    !sc_hnonsec_lock
    1       R/W sdio_host0_hnonsec                      1'b1                    !sc_hnonsec_lock
    2       R/W display_arprot_1                        1'b1                    !sc_hnonsec_lock
    3       R   RSVD                                    1'b0
    4       R/W gmac_m_arprot_1                         1'b1                    !sc_hnonsec_lock
    5       R/W gmac_m_awprot_1                         1'b1                    !sc_hnonsec_lock
    6       R   RSVD                                    1'b0
    7       R   RSVD                                    1'b0
    8       R   RSVD                                    1'b0
    9       R   RSVD                                    1'b0
    10      R   RSVD                                    1'b0
    11      R   RSVD                                    1'b0
    12      R   RSVD                                    1'b0
    13      R   RSVD                                    1'b0
    14      R   RSVD                                    1'b0
    15      R   RSVD                                    1'b0
    16      R   RSVD                                    1'b0
    17      R   RSVD                                    1'b0
    18      R   RSVD                                    1'b0
    19      R   RSVD                                    1'b0
    20      R   RSVD                                    1'b0
    21      R   RSVD                                    1'b0
    22      R   RSVD                                    1'b0
    23      R   RSVD                                    1'b0
    24      R   RSVD                                    1'b0
    25      R   RSVD                                    1'b0
    26      R   RSVD                                    1'b0
    27      R   RSVD                                    1'b0
    28      R   RSVD                                    1'b0
    29      R   RSVD                                    1'b0
    30      R   RSVD                                    1'b0
    31      W1O sc_hnonsec_lock                         1'b0
 */
typedef volatile union _AON_REG0X_SC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t usbotg_hnonsec: 1;
        uint32_t sdio_host0_hnonsec: 1;
        uint32_t display_arprot_1: 1;
        uint32_t RSVD_25: 1;
        uint32_t gmac_m_arprot_1: 1;
        uint32_t gmac_m_awprot_1: 1;
        uint32_t RSVD_24: 1;
        uint32_t RSVD_23: 1;
        uint32_t RSVD_22: 1;
        uint32_t RSVD_21: 1;
        uint32_t RSVD_20: 1;
        uint32_t RSVD_19: 1;
        uint32_t RSVD_18: 1;
        uint32_t RSVD_17: 1;
        uint32_t RSVD_16: 1;
        uint32_t RSVD_15: 1;
        uint32_t RSVD_14: 1;
        uint32_t RSVD_13: 1;
        uint32_t RSVD_12: 1;
        uint32_t RSVD_11: 1;
        uint32_t RSVD_10: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t RSVD_5: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 1;
        uint32_t sc_hnonsec_lock: 1;
    };
} AON_REG0X_SC_TYPE;

/* 0x470    0x4000_0470
    0       R/W km4_dbgen                               1'b1                    !km4_dbgen_lock
    1       R/W km4_niden                               1'b1                    !km4_niden_lock
    2       R/W km4_spiden                              1'b0                    !km4_spiden_lock
    3       R/W km4_spniden                             1'b1                    !km4_spniden_lock
    4       W1O km4_dbgen_lock                          1'b0
    5       W1O km4_niden_lock                          1'b0
    6       W1O km4_spiden_lock                         1'b0
    7       W1O km4_spniden_lock                        1'b0
    8       R   RSVD                                    1'b0
    9       R   RSVD                                    1'b0
    10      R   RSVD                                    1'b0
    11      R   RSVD                                    1'b0
    12      R   RSVD                                    1'b0
    13      R   RSVD                                    1'b0
    14      R   RSVD                                    1'b0
    15      R   RSVD                                    1'b0
    16      R   RSVD                                    1'b0
    17      R   RSVD                                    1'b0
    18      R   RSVD                                    1'b0
    19      R   RSVD                                    1'b0
    20      R   RSVD                                    1'b0
    21      R   RSVD                                    1'b0
    22      R   RSVD                                    1'b0
    23      R   RSVD                                    1'b0
    24      R   RSVD                                    1'b0
    25      R   RSVD                                    1'b0
    26      R   RSVD                                    1'b0
    27      R   RSVD                                    1'b0
    28      R   RSVD                                    1'b0
    29      R   RSVD                                    1'b0
    30      R   RSVD                                    1'b0
    31      R   RSVD                                    1'b0
 */
typedef volatile union _AON_REG0X_KM4_DBG_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_dbgen: 1;
        uint32_t km4_niden: 1;
        uint32_t km4_spiden: 1;
        uint32_t km4_spniden: 1;
        uint32_t km4_dbgen_lock: 1;
        uint32_t km4_niden_lock: 1;
        uint32_t km4_spiden_lock: 1;
        uint32_t km4_spniden_lock: 1;
        uint32_t RSVD_23: 1;
        uint32_t RSVD_22: 1;
        uint32_t RSVD_21: 1;
        uint32_t RSVD_20: 1;
        uint32_t RSVD_19: 1;
        uint32_t RSVD_18: 1;
        uint32_t RSVD_17: 1;
        uint32_t RSVD_16: 1;
        uint32_t RSVD_15: 1;
        uint32_t RSVD_14: 1;
        uint32_t RSVD_13: 1;
        uint32_t RSVD_12: 1;
        uint32_t RSVD_11: 1;
        uint32_t RSVD_10: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t RSVD_5: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 1;
    };
} AON_REG0X_KM4_DBG_CTRL_TYPE;

/* 0x4B0    0x4000_04b0
    0       R/W RTC_PF_CNT_START                        1'b0
    1       R/W RTC_PF_CNT_RST                          1'b0
    7:2     R/W RTC_PF_COMP_CONTROLLER_DUMMY0           6'b0
    8       R/W RTC_PF_COMP0_WK_EN                      1'b0
    9       R/W RTC_PF_COMP1_WK_EN                      1'b0
    10      R/W RTC_PF_COMP2_WK_EN                      1'b0
    11      R/W RTC_PF_COMP3_WK_EN                      1'b0
    12      R/W RTC_PF_COMP0_INT_EN                     1'b0
    13      R/W RTC_PF_COMP1_INT_EN                     1'b0
    14      R/W RTC_PF_COMP2_INT_EN                     1'b0
    15      R/W RTC_PF_COMP3_INT_EN                     1'b0
    19:16   R/W RTC_PF_COMP_CONTROLLER_DUMMY1           4'b0
    20      R/W RTC_PF_COMP0_ISR_TYPE                   1'b0
    21      R/W RTC_PF_COMP1_ISR_TYPE                   1'b0
    22      R/W RTC_PF_COMP2_ISR_TYPE                   1'b0
    23      R/W RTC_PF_COMP3_ISR_TYPE                   1'b0
    28:24   R/W RTC_PF_COMP_CONTROLLER_DUMMY1           5'b0
    29      R/W RTC_PF_WK_EN                            1'b0
    30      R/W RTC_PF_INT_EN                           1'b0
    31      R/W RTC_PF_RST                              1'b0
 */
typedef volatile union _AON_RTC_PF_COMP_CONTROLLER_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PF_CNT_START: 1;
        uint32_t RTC_PF_CNT_RST: 1;
        uint32_t RTC_PF_COMP_CONTROLLER_DUMMY0: 6;
        uint32_t RTC_PF_COMP0_WK_EN: 1;
        uint32_t RTC_PF_COMP1_WK_EN: 1;
        uint32_t RTC_PF_COMP2_WK_EN: 1;
        uint32_t RTC_PF_COMP3_WK_EN: 1;
        uint32_t RTC_PF_COMP0_INT_EN: 1;
        uint32_t RTC_PF_COMP1_INT_EN: 1;
        uint32_t RTC_PF_COMP2_INT_EN: 1;
        uint32_t RTC_PF_COMP3_INT_EN: 1;
        uint32_t RTC_PF_COMP_CONTROLLER_DUMMY1_1: 4;
        uint32_t RTC_PF_COMP0_ISR_TYPE: 1;
        uint32_t RTC_PF_COMP1_ISR_TYPE: 1;
        uint32_t RTC_PF_COMP2_ISR_TYPE: 1;
        uint32_t RTC_PF_COMP3_ISR_TYPE: 1;
        uint32_t RTC_PF_COMP_CONTROLLER_DUMMY1: 5;
        uint32_t RTC_PF_WK_EN: 1;
        uint32_t RTC_PF_INT_EN: 1;
        uint32_t RTC_PF_RST: 1;
    };
    struct
    {
        uint32_t RTC_PF_COMP_CONTROLLER_ASSEMBLE0: 8;
        uint32_t RTC_PF_COMP_WK_EN: 4;
        uint32_t RTC_PF_COMP_INT_EN: 4;
        uint32_t RTC_PF_COMP_CONTROLLER_ASSEMBLE1: 4;
        uint32_t RTC_PF_COMP_ISR_TYPE: 4;
        uint32_t RTC_PF_COMP_CONTROLLER_ASSEMBLE2: 8;
    };
} AON_RTC_PF_COMP_CONTROLLER_REG_TYPE;

/* 0x4B4    0x4000_04b4
    31:0    R/W RTC_PF_COMP0                            32'd0
 */
typedef volatile union _AON_RTC_PF_COMP0_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PF_COMP0;
    };
} AON_RTC_PF_COMP0_REG_TYPE;

