rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x4B8    0x4000_04b8
    31:0    R/W RTC_PF_COMP1                            32'd0
 */
typedef volatile union _AON_RTC_PF_COMP1_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PF_COMP1;
    };
} AON_RTC_PF_COMP1_REG_TYPE;

/* 0x4BC    0x4000_04bc
    31:0    R/W RTC_PF_COMP2                            32'd0
 */
typedef volatile union _AON_RTC_PF_COMP2_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PF_COMP2;
    };
} AON_RTC_PF_COMP2_REG_TYPE;

/* 0x4C0    0x4000_04c0
    31:0    R/W RTC_PF_COMP3                            32'd0
 */
typedef volatile union _AON_RTC_PF_COMP3_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PF_COMP3;
    };
} AON_RTC_PF_COMP3_REG_TYPE;

/* 0x4C4    0x4000_04c4
    0       R/W RTC_PF_COMP0_MANUAL_INT                 1'b0
    1       R/W RTC_PF_COMP1_MANUAL_INT                 1'b0
    2       R/W RTC_PF_COMP2_MANUAL_INT                 1'b0
    3       R/W RTC_PF_COMP3_MANUAL_INT                 1'b0
    31:4    R/W RTC_PF_COMP_MANUAL_INT_DUMMY            28'b0
 */
typedef volatile union _AON_RTC_PF_COMP_MANUAL_INT_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PF_COMP0_MANUAL_INT: 1;
        uint32_t RTC_PF_COMP1_MANUAL_INT: 1;
        uint32_t RTC_PF_COMP2_MANUAL_INT: 1;
        uint32_t RTC_PF_COMP3_MANUAL_INT: 1;
        uint32_t RTC_PF_COMP_MANUAL_INT_DUMMY: 28;
    };
    struct
    {
        uint32_t RTC_PF_COMP_MANUAL_INT: 4;
        uint32_t RTC_PF_COMP_MANUAL_INT_ASSEMBLE: 28;
    };
} AON_RTC_PF_COMP_MANUAL_INT_REG_TYPE;

/* 0x4C8    0x4000_04c8
    31:0    R   RTC_PF_CNT                              32'd0
 */
typedef volatile union _AON_RTC_PF_CNT_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PF_CNT;
    };
} AON_RTC_PF_CNT_REG_TYPE;

/* 0x4CC    0x4000_04cc
    0       R/WACRTC_PF_COMP0_WK_CLR                     1'b0
    1       R/WACRTC_PF_COMP1_WK_CLR                     1'b0
    2       R/WACRTC_PF_COMP2_WK_CLR                     1'b0
    3       R/WACRTC_PF_COMP3_WK_CLR                     1'b0
    4       R/WACRTC_PF_COMP0_INT_CLR                    1'b0
    5       R/WACRTC_PF_COMP1_INT_CLR                    1'b0
    6       R/WACRTC_PF_COMP2_INT_CLR                    1'b0
    7       R/WACRTC_PF_COMP3_INT_CLR                    1'b0
    31:8    R/W RTC_PF_COMP_INT_WK_CLR_DUMMY            24'b0
 */
typedef volatile union _AON_RTC_PF_COMP_INT_WK_CLR_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PF_COMP0_WK_CLR: 1;
        uint32_t RTC_PF_COMP1_WK_CLR: 1;
        uint32_t RTC_PF_COMP2_WK_CLR: 1;
        uint32_t RTC_PF_COMP3_WK_CLR: 1;
        uint32_t RTC_PF_COMP0_INT_CLR: 1;
        uint32_t RTC_PF_COMP1_INT_CLR: 1;
        uint32_t RTC_PF_COMP2_INT_CLR: 1;
        uint32_t RTC_PF_COMP3_INT_CLR: 1;
        uint32_t RTC_PF_COMP_INT_WK_CLR_DUMMY: 24;
    };
    struct
    {
        uint32_t RTC_PF_COMP_WK_CLR: 4;
        uint32_t RTC_PF_COMP_INT_CLR: 4;
        uint32_t RTC_PF_COMP_INT_WK_CLR_ASSEMBLE: 24;
    };
} AON_RTC_PF_COMP_INT_WK_CLR_REG_TYPE;

/* 0x4D0    0x4000_04d0
    0       R/W1CRTC_PF_COMP0_WK_SR                      1'b0
    1       R/W1CRTC_PF_COMP1_WK_SR                      1'b0
    2       R/W1CRTC_PF_COMP2_WK_SR                      1'b0
    3       R/W1CRTC_PF_COMP3_WK_SR                      1'b0
    4       R/W1CRTC_PF_COMP0_INT_SR                     1'b0
    5       R/W1CRTC_PF_COMP1_INT_SR                     1'b0
    6       R/W1CRTC_PF_COMP2_INT_SR                     1'b0
    7       R/W1CRTC_PF_COMP3_INT_SR                     1'b0
    31:8    R/W RTC_PF_COMP_INT_WK_SR_DUMMY             24'b0
 */
typedef volatile union _AON_RTC_PF_COMP_INT_WK_SR_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PF_COMP0_WK_SR: 1;
        uint32_t RTC_PF_COMP1_WK_SR: 1;
        uint32_t RTC_PF_COMP2_WK_SR: 1;
        uint32_t RTC_PF_COMP3_WK_SR: 1;
        uint32_t RTC_PF_COMP0_INT_SR: 1;
        uint32_t RTC_PF_COMP1_INT_SR: 1;
        uint32_t RTC_PF_COMP2_INT_SR: 1;
        uint32_t RTC_PF_COMP3_INT_SR: 1;
        uint32_t RTC_PF_COMP_INT_WK_SR_DUMMY: 24;
    };
    struct
    {
        uint32_t RTC_PF_COMP_WK_SR: 4;
        uint32_t RTC_PF_COMP_INT_SR: 4;
        uint32_t RTC_PF_COMP_INT_WK_SR_ASSEMBLE: 24;
    };
} AON_RTC_PF_COMP_INT_WK_SR_REG_TYPE;

/* 0x4D4    0x4000_04d4
    31:0    R   RTC_PF_RTL_VERSION                      32'h2208230A
 */
typedef volatile union _AON_RTC_PF_RTL_VERSION_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PF_RTL_VERSION;
    };
} AON_RTC_PF_RTL_VERSION_REG_TYPE;

/* 0x580    0x4000_0580
    0       R/W bt_mac_vsel                             1'h1
    31:1    R   RSVD                                    31'h0
 */
typedef volatile union _AON_BT_MAC_VSEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_vsel: 1;
        uint32_t RSVD: 31;
    };
} AON_BT_MAC_VSEL_TYPE;

/* 0x584    0x4000_0584
    13:0    R/W bt_mac_snps_lv                          14'h292
    27:14   R/W bt_mac_snps_hv                          14'h213
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_BT_MAC_SNPS_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_snps_lv: 14;
        uint32_t bt_mac_snps_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_BT_MAC_SNPS_HV_LV_TYPE;

/* 0x588    0x4000_0588
    0       R/W bt_mac_1024x16_sd_iso0                  1'h0
    1       R/W bt_mac_1024x16_sd_iso1                  1'h0
    2       R/W bt_mac_1024x16_ds_iso0                  1'h0
    3       R/W bt_mac_1024x16_ds_iso1                  1'h0
    4       R/W bt_mac_1024x16_ls_iso0                  1'h0
    5       R/W bt_mac_1024x16_ls_iso1                  1'h0
    31:6    R   RSVD                                    26'h0
 */
typedef volatile union _AON_BT_MAC_1024x16_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_1024x16_sd_iso0: 1;
        uint32_t bt_mac_1024x16_sd_iso1: 1;
        uint32_t bt_mac_1024x16_ds_iso0: 1;
        uint32_t bt_mac_1024x16_ds_iso1: 1;
        uint32_t bt_mac_1024x16_ls_iso0: 1;
        uint32_t bt_mac_1024x16_ls_iso1: 1;
        uint32_t RSVD: 26;
    };
} AON_BT_MAC_1024x16_PWR_TYPE;

/* 0x58C    0x4000_058c
    0       R/W bt_mac_512x16_sd_iso0                   1'h0
    1       R/W bt_mac_512x16_sd_iso1                   1'h0
    2       R/W bt_mac_512x16_ds_iso0                   1'h0
    3       R/W bt_mac_512x16_ds_iso1                   1'h0
    4       R/W bt_mac_512x16_ls_iso0                   1'h0
    5       R/W bt_mac_512x16_ls_iso1                   1'h0
    31:6    R   RSVD                                    26'h0
 */
typedef volatile union _AON_BT_MAC_512x16_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_512x16_sd_iso0: 1;
        uint32_t bt_mac_512x16_sd_iso1: 1;
        uint32_t bt_mac_512x16_ds_iso0: 1;
        uint32_t bt_mac_512x16_ds_iso1: 1;
        uint32_t bt_mac_512x16_ls_iso0: 1;
        uint32_t bt_mac_512x16_ls_iso1: 1;
        uint32_t RSVD: 26;
    };
} AON_BT_MAC_512x16_PWR_TYPE;

/* 0x590    0x4000_0590
    0       R/W bt_mac_128x32_0_sd_iso0                 1'h0
    1       R/W bt_mac_128x32_0_sd_iso1                 1'h0
    2       R/W bt_mac_128x32_0_ds_iso0                 1'h0
    3       R/W bt_mac_128x32_0_ds_iso1                 1'h0
    4       R/W bt_mac_128x32_0_ls_iso0                 1'h0
    5       R/W bt_mac_128x32_0_ls_iso1                 1'h0
    31:6    R   RSVD                                    26'h0
 */
typedef volatile union _AON_BT_MAC_128x32_0_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_128x32_0_sd_iso0: 1;
        uint32_t bt_mac_128x32_0_sd_iso1: 1;
        uint32_t bt_mac_128x32_0_ds_iso0: 1;
        uint32_t bt_mac_128x32_0_ds_iso1: 1;
        uint32_t bt_mac_128x32_0_ls_iso0: 1;
        uint32_t bt_mac_128x32_0_ls_iso1: 1;
        uint32_t RSVD: 26;
    };
} AON_BT_MAC_128x32_0_PWR_TYPE;

/* 0x594    0x4000_0594
    0       R/W bt_mac_128x32_1_sd_iso0                 1'h0
    1       R/W bt_mac_128x32_1_sd_iso1                 1'h0
    2       R/W bt_mac_128x32_1_ds_iso0                 1'h0
    3       R/W bt_mac_128x32_1_ds_iso1                 1'h0
    4       R/W bt_mac_128x32_1_ls_iso0                 1'h0
    5       R/W bt_mac_128x32_1_ls_iso1                 1'h0
    31:6    R   RSVD                                    26'h0
 */
typedef volatile union _AON_BT_MAC_128x32_1_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_128x32_1_sd_iso0: 1;
        uint32_t bt_mac_128x32_1_sd_iso1: 1;
        uint32_t bt_mac_128x32_1_ds_iso0: 1;
        uint32_t bt_mac_128x32_1_ds_iso1: 1;
        uint32_t bt_mac_128x32_1_ls_iso0: 1;
        uint32_t bt_mac_128x32_1_ls_iso1: 1;
        uint32_t RSVD: 26;
    };
} AON_BT_MAC_128x32_1_PWR_TYPE;

