rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x598    0x4000_0598
    13:0    R/W bt_mac_640x32_lv                        14'b11000100100010
    27:14   R/W bt_mac_640x32_hv                        14'b11000010100010
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_BT_MAC_640x32_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_640x32_lv: 14;
        uint32_t bt_mac_640x32_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_BT_MAC_640x32_HV_LV_TYPE;

/* 0x59C    0x4000_059c
    0       R/W bt_mac_640x32_sd_iso0                   1'h0
    1       R/W bt_mac_640x32_sd_iso1                   1'h0
    2       R/W bt_mac_640x32_ds_iso0                   1'h0
    3       R/W bt_mac_640x32_ds_iso1                   1'h0
    31:4    R   RSVD                                    28'h0
 */
typedef volatile union _AON_BT_MAC_640x32_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_640x32_sd_iso0: 1;
        uint32_t bt_mac_640x32_sd_iso1: 1;
        uint32_t bt_mac_640x32_ds_iso0: 1;
        uint32_t bt_mac_640x32_ds_iso1: 1;
        uint32_t RSVD: 28;
    };
} AON_BT_MAC_640x32_PWR_TYPE;

/* 0x5A0    0x4000_05a0
    13:0    R/W bt_mac_96x32_lv                         14'b11000001100010
    27:14   R/W bt_mac_96x32_hv                         14'b11000010100010
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_BT_MAC_96x32_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_96x32_lv: 14;
        uint32_t bt_mac_96x32_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_BT_MAC_96x32_HV_LV_TYPE;

/* 0x5A4    0x4000_05a4
    0       R/W bt_mac_96x32_sd_iso0                    1'h0
    1       R/W bt_mac_96x32_sd_iso1                    1'h0
    2       R/W bt_mac_96x32_ds_iso0                    1'h0
    3       R/W bt_mac_96x32_ds_iso1                    1'h0
    31:4    R   RSVD                                    28'h0
 */
typedef volatile union _AON_BT_MAC_96x32_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_96x32_sd_iso0: 1;
        uint32_t bt_mac_96x32_sd_iso1: 1;
        uint32_t bt_mac_96x32_ds_iso0: 1;
        uint32_t bt_mac_96x32_ds_iso1: 1;
        uint32_t RSVD: 28;
    };
} AON_BT_MAC_96x32_PWR_TYPE;

/* 0x5A8    0x4000_05a8
    13:0    R/W bt_mac_64x32_lv                         14'b11000001100010
    27:14   R/W bt_mac_64x32_hv                         14'b11000010100010
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_BT_MAC_64x32_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_64x32_lv: 14;
        uint32_t bt_mac_64x32_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_BT_MAC_64x32_HV_LV_TYPE;

/* 0x5AC    0x4000_05ac
    0       R/W bt_mac_64x32_sd_iso0                    1'h0
    1       R/W bt_mac_64x32_sd_iso1                    1'h0
    2       R/W bt_mac_64x32_ds_iso0                    1'h0
    3       R/W bt_mac_64x32_ds_iso1                    1'h0
    31:4    R   RSVD                                    28'h0
 */
typedef volatile union _AON_BT_MAC_64x32_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_mac_64x32_sd_iso0: 1;
        uint32_t bt_mac_64x32_sd_iso1: 1;
        uint32_t bt_mac_64x32_ds_iso0: 1;
        uint32_t bt_mac_64x32_ds_iso1: 1;
        uint32_t RSVD: 28;
    };
} AON_BT_MAC_64x32_PWR_TYPE;

/* 0x5B0    0x4000_05b0
    0       R/W zb_mac_vsel                             1'h1
    31:1    R   RSVD                                    31'h0
 */
typedef volatile union _AON_ZB_MAC_VSEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t zb_mac_vsel: 1;
        uint32_t RSVD: 31;
    };
} AON_ZB_MAC_VSEL_TYPE;

/* 0x5B4    0x4000_05b4
    13:0    R/W zb_mac_lv                               14'h292
    27:14   R/W zb_mac_hv                               14'h213
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_ZB_MAC_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t zb_mac_lv: 14;
        uint32_t zb_mac_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_ZB_MAC_HV_LV_TYPE;

/* 0x5B8    0x4000_05b8
    0       R/W zb_mac_16x32_ds_iso0                    1'h0
    1       R/W zb_mac_16x32_ds_iso1                    1'h0
    2       R/W zb_mac_16x32_ls_iso0                    1'h0
    3       R/W zb_mac_16x32_ls_iso1                    1'h0
    4       R/W zb_mac_16x32_sd_iso0                    1'h0
    5       R/W zb_mac_16x32_sd_iso1                    1'h0
    31:6    R   RSVD                                    26'h0
 */
typedef volatile union _AON_ZB_MAC_16x32_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t zb_mac_16x32_ds_iso0: 1;
        uint32_t zb_mac_16x32_ds_iso1: 1;
        uint32_t zb_mac_16x32_ls_iso0: 1;
        uint32_t zb_mac_16x32_ls_iso1: 1;
        uint32_t zb_mac_16x32_sd_iso0: 1;
        uint32_t zb_mac_16x32_sd_iso1: 1;
        uint32_t RSVD: 26;
    };
} AON_ZB_MAC_16x32_PWR_TYPE;

/* 0x5BC    0x4000_05bc
    1:0     R/W zb_mac_40x32_sd_iso0                    2'h0
    3:2     R/W zb_mac_40x32_sd_iso1                    2'h0
    5:4     R/W zb_mac_40x32_ds_iso0                    2'h0
    7:6     R/W zb_mac_40x32_ds_iso1                    2'h0
    9:8     R/W zb_mac_40x32_ls_iso0                    2'h0
    11:10   R/W zb_mac_40x32_ls_iso1                    2'h0
    31:12   R   RSVD                                    20'h0
 */
typedef volatile union _AON_ZB_MAC_40x32_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t zb_mac_40x32_sd_iso0: 2;
        uint32_t zb_mac_40x32_sd_iso1: 2;
        uint32_t zb_mac_40x32_ds_iso0: 2;
        uint32_t zb_mac_40x32_ds_iso1: 2;
        uint32_t zb_mac_40x32_ls_iso0: 2;
        uint32_t zb_mac_40x32_ls_iso1: 2;
        uint32_t RSVD: 20;
    };
} AON_ZB_MAC_40x32_PWR_TYPE;

/* 0x5C0    0x4000_05c0
    3:0     R/W zb_mac_32x32_sd_iso0                    4'h0
    7:4     R/W zb_mac_32x32_sd_iso1                    4'h0
    11:8    R/W zb_mac_32x32_ds_iso0                    4'h0
    15:12   R/W zb_mac_32x32_ds_iso1                    4'h0
    19:16   R/W zb_mac_32x32_ls_iso0                    4'h0
    23:20   R/W zb_mac_32x32_ls_iso1                    4'h0
    31:24   R   RSVD                                    8'h0
 */
typedef volatile union _AON_ZB_MAC_32x32_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t zb_mac_32x32_sd_iso0: 4;
        uint32_t zb_mac_32x32_sd_iso1: 4;
        uint32_t zb_mac_32x32_ds_iso0: 4;
        uint32_t zb_mac_32x32_ds_iso1: 4;
        uint32_t zb_mac_32x32_ls_iso0: 4;
        uint32_t zb_mac_32x32_ls_iso1: 4;
        uint32_t RSVD: 8;
    };
} AON_ZB_MAC_32x32_PWR_TYPE;

/* 0x5C4    0x4000_05c4
    0       R/W bt_phy_vsel                             1'h1
    31:1    R   RSVD                                    31'h0
 */
typedef volatile union _AON_BT_PHY_VSEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_phy_vsel: 1;
        uint32_t RSVD: 31;
    };
} AON_BT_PHY_VSEL_TYPE;

