rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x5C8    0x4000_05c8
    13:0    R/W bt_phy_lv                               14'h292
    27:14   R/W bt_phy_hv                               14'h213
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_BT_PHY_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bt_phy_lv: 14;
        uint32_t bt_phy_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_BT_PHY_HV_LV_TYPE;

/* 0x5CC    0x4000_05cc
    3:0     R/W btphy_128x12x4_sd_iso0                  4'h0
    7:4     R/W btphy_128x12x4_sd_iso1                  4'h0
    11:8    R/W btphy_128x12x4_ds_iso0                  4'h0
    15:12   R/W btphy_128x12x4_ds_iso1                  4'h0
    19:16   R/W btphy_128x12x4_ls_iso0                  4'h0
    23:20   R/W btphy_128x12x4_ls_iso1                  4'h0
    31:24   R   RSVD                                    8'h0
 */
typedef volatile union _AON_BT_PHY_128x12x4_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t btphy_128x12x4_sd_iso0: 4;
        uint32_t btphy_128x12x4_sd_iso1: 4;
        uint32_t btphy_128x12x4_ds_iso0: 4;
        uint32_t btphy_128x12x4_ds_iso1: 4;
        uint32_t btphy_128x12x4_ls_iso0: 4;
        uint32_t btphy_128x12x4_ls_iso1: 4;
        uint32_t RSVD: 8;
    };
} AON_BT_PHY_128x12x4_PWR_TYPE;

/* 0x5D0    0x4000_05d0
    4:0     R/W btphy_lr_ram_sd_iso0                    5'h0
    9:5     R/W btphy_lr_ram_sd_iso1                    5'h0
    14:10   R/W btphy_lr_ram_ds_iso0                    5'h0
    19:15   R/W btphy_lr_ram_ds_iso1                    5'h0
    24:20   R/W btphy_lr_ram_ls_iso0                    5'h0
    29:25   R/W btphy_lr_ram_ls_iso1                    5'h0
    31:30   R   RSVD                                    2'h0
 */
typedef volatile union _AON_BT_PHY_LR_RAM_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t btphy_lr_ram_sd_iso0: 5;
        uint32_t btphy_lr_ram_sd_iso1: 5;
        uint32_t btphy_lr_ram_ds_iso0: 5;
        uint32_t btphy_lr_ram_ds_iso1: 5;
        uint32_t btphy_lr_ram_ls_iso0: 5;
        uint32_t btphy_lr_ram_ls_iso1: 5;
        uint32_t RSVD: 2;
    };
} AON_BT_PHY_LR_RAM_PWR_TYPE;

/* 0x5D4    0x4000_05d4
    0       R/W km4_vsel                                1'h1
    31:1    R   RSVD                                    31'h0
 */
typedef volatile union _AON_KM4_VSEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_vsel: 1;
        uint32_t RSVD: 31;
    };
} AON_KM4_VSEL_TYPE;

/* 0x5D8    0x4000_05d8
    5:0     R/W km4_itcm0_lv                            6'h12
    11:6    R/W km4_itcm0_hv                            6'h13
    31:12   R   RSVD                                    20'h0
 */
typedef volatile union _AON_KM4_ITCM0_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_itcm0_lv: 6;
        uint32_t km4_itcm0_hv: 6;
        uint32_t RSVD: 20;
    };
} AON_KM4_ITCM0_HV_LV_TYPE;

/* 0x5DC    0x4000_05dc
    3:0     R/W km4_itcm0_ls_iso0                       4'h0
    7:4     R/W km4_itcm0_ls_iso1                       4'h0
    31:8    R   RSVD                                    24'h0
 */
typedef volatile union _AON_KM4_ITCM0_LS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_itcm0_ls_iso0: 4;
        uint32_t km4_itcm0_ls_iso1: 4;
        uint32_t RSVD: 24;
    };
} AON_KM4_ITCM0_LS_TYPE;

/* 0x5E0    0x4000_05e0
    13:0    R/W km4_tcm_lv                              14'b11000101100010
    27:14   R/W km4_tcm_hv                              14'b11000010101100
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_KM4_TCM_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_tcm_lv: 14;
        uint32_t km4_tcm_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_KM4_TCM_HV_LV_TYPE;

/* 0x5E4    0x4000_05e4
    11:0    R/W km4_itcm1_ds_iso0                       12'h0
    23:12   R/W km4_itcm1_ds_iso1                       12'h0
    31:24   R   RSVD                                    8'h0
 */
typedef volatile union _AON_KM4_ITCM1_PWR_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_itcm1_ds_iso0: 12;
        uint32_t km4_itcm1_ds_iso1: 12;
        uint32_t RSVD: 8;
    };
} AON_KM4_ITCM1_PWR_0_TYPE;

/* 0x5E8    0x4000_05e8
    11:0    R/W km4_itcm1_sd_iso0                       12'h0
    23:12   R/W km4_itcm1_sd_iso1                       12'h0
    31:24   R   RSVD                                    8'h
 */
typedef volatile union _AON_KM4_ITCM1_PWR_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_itcm1_sd_iso0: 12;
        uint32_t km4_itcm1_sd_iso1: 12;
        uint32_t RSVD: 8;
    };
} AON_KM4_ITCM1_PWR_1_TYPE;

/* 0x5EC    0x4000_05ec
    3:0     R/W km4_dtcm0_sd_iso0                       4'h0
    7:4     R/W km4_dtcm0_sd_iso1                       4'h0
    11:8    R/W km4_dtcm0_ds_iso0                       4'h0
    15:12   R/W km4_dtcm0_ds_iso1                       4'h0
    31:16   R   RSVD                                    16'h0
 */
typedef volatile union _AON_KM4_DTCM0_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_dtcm0_sd_iso0: 4;
        uint32_t km4_dtcm0_sd_iso1: 4;
        uint32_t km4_dtcm0_ds_iso0: 4;
        uint32_t km4_dtcm0_ds_iso1: 4;
        uint32_t RSVD: 16;
    };
} AON_KM4_DTCM0_PWR_TYPE;

/* 0x5F0    0x4000_05f0
    3:0     R/W km4_dtcm1_sd_iso0                       4'h0
    7:4     R/W km4_dtcm1_sd_iso1                       4'h0
    11:8    R/W km4_dtcm1_ds_iso0                       4'h0
    15:12   R/W km4_dtcm1_ds_iso1                       4'h0
    31:16   R   RSVD                                    16'h0
 */
typedef volatile union _AON_KM4_DTCM1_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_dtcm1_sd_iso0: 4;
        uint32_t km4_dtcm1_sd_iso1: 4;
        uint32_t km4_dtcm1_ds_iso0: 4;
        uint32_t km4_dtcm1_ds_iso1: 4;
        uint32_t RSVD: 16;
    };
} AON_KM4_DTCM1_PWR_TYPE;

/* 0x5F4    0x4000_05f4
    13:0    R/W km4_ic_data_lv                          14'b11000101100010
    27:14   R/W km4_ic_data_hv                          14'b11000010101100
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_KM4_IC_DATA_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_ic_data_lv: 14;
        uint32_t km4_ic_data_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_KM4_IC_DATA_HV_LV_TYPE;

/* 0x5F8    0x4000_05f8
    1:0     R/W km4_ic_data_sd_iso0                     2'h0
    3:2     R/W km4_ic_data_sd_iso1                     2'h0
    5:4     R/W km4_ic_data_ds_iso0                     2'h0
    7:6     R/W km4_ic_data_ds_iso1                     2'h0
    31:8    R   RSVD                                    24'h0
 */
typedef volatile union _AON_KM4_IC_DATA_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_ic_data_sd_iso0: 2;
        uint32_t km4_ic_data_sd_iso1: 2;
        uint32_t km4_ic_data_ds_iso0: 2;
        uint32_t km4_ic_data_ds_iso1: 2;
        uint32_t RSVD: 24;
    };
} AON_KM4_IC_DATA_PWR_TYPE;

/* 0x5FC    0x4000_05fc
    13:0    R/W km4_ic_tag_lv                           14'b11000100100010
    27:14   R/W km4_ic_tag_hv                           14'b11000010101100
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_KM4_IC_TAG_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_ic_tag_lv: 14;
        uint32_t km4_ic_tag_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_KM4_IC_TAG_HV_LV_TYPE;

/* 0x600    0x4000_0600
    1:0     R/W km4_ic_tag_sd_iso0                      2'h0
    3:2     R/W km4_ic_tag_sd_iso1                      2'h0
    5:4     R/W km4_ic_tag_ds_iso0                      2'h0
    7:6     R/W km4_ic_tag_ds_iso1                      2'h0
    31:8    R   RSVD                                    24'h0
 */
typedef volatile union _AON_KM4_IC_TAG_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_ic_tag_sd_iso0: 2;
        uint32_t km4_ic_tag_sd_iso1: 2;
        uint32_t km4_ic_tag_ds_iso0: 2;
        uint32_t km4_ic_tag_ds_iso1: 2;
        uint32_t RSVD: 24;
    };
} AON_KM4_IC_TAG_PWR_TYPE;

