rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x604    0x4000_0604
    13:0    R/W km4_dc_data_lv                          14'b11000101100010
    27:14   R/W km4_dc_data_hv                          14'b11000010101100
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_KM4_DC_DATA_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_dc_data_lv: 14;
        uint32_t km4_dc_data_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_KM4_DC_DATA_HV_LV_TYPE;

/* 0x608    0x4000_0608
    3:0     R/W km4_dc_data_sd_iso0                     4'h0
    7:4     R/W km4_dc_data_sd_iso1                     4'h0
    11:8    R/W km4_dc_data_ds_iso0                     4'h0
    15:12   R/W km4_dc_data_ds_iso1                     4'h0
    31:16   R   RSVD                                    16'h0
 */
typedef volatile union _AON_KM4_DC_DATA_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_dc_data_sd_iso0: 4;
        uint32_t km4_dc_data_sd_iso1: 4;
        uint32_t km4_dc_data_ds_iso0: 4;
        uint32_t km4_dc_data_ds_iso1: 4;
        uint32_t RSVD: 16;
    };
} AON_KM4_DC_DATA_PWR_TYPE;

/* 0x60C    0x4000_060c
    13:0    R/W km4_dc_tag_lv                           14'b11000100100010
    27:14   R/W km4_dc_tag_hv                           14'b11000010101100
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_KM4_DC_TAG_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_dc_tag_lv: 14;
        uint32_t km4_dc_tag_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_KM4_DC_TAG_HV_LV_TYPE;

/* 0x610    0x4000_0610
    1:0     R/W km4_dc_tag_sd_iso0                      2'h0
    3:2     R/W km4_dc_tag_sd_iso1                      2'h0
    5:4     R/W km4_dc_tag_ds_iso0                      2'h0
    7:6     R/W km4_dc_tag_ds_iso1                      2'h0
    31:8    R   RSVD                                    24'h0
 */
typedef volatile union _AON_KM4_DC_TAG_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_dc_tag_sd_iso0: 2;
        uint32_t km4_dc_tag_sd_iso1: 2;
        uint32_t km4_dc_tag_ds_iso0: 2;
        uint32_t km4_dc_tag_ds_iso1: 2;
        uint32_t RSVD: 24;
    };
} AON_KM4_DC_TAG_PWR_TYPE;

/* 0x614    0x4000_0614
    0       R/W buffer_ram_vsel                         1'h1
    31:1    R   RSVD                                    31'h0
 */
typedef volatile union _AON_BUFFER_RAM_VSEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t buffer_ram_vsel: 1;
        uint32_t RSVD: 31;
    };
} AON_BUFFER_RAM_VSEL_TYPE;

/* 0x618    0x4000_0618
    13:0    R/W buffer_ram_lv                           14'b11000101100010
    27:14   R/W buffer_ram_hv                           14'b11000010101100
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_BUFFER_RAM_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t buffer_ram_lv: 14;
        uint32_t buffer_ram_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_BUFFER_RAM_HV_LV_TYPE;

/* 0x61C    0x4000_061c
    2:0     R/W buffer_ram_sd_iso0                      3'h0
    5:3     R/W buffer_ram_sd_iso1                      3'h0
    8:6     R/W buffer_ram_ds_iso0                      3'h0
    11:9    R/W buffer_ram_ds_iso1                      3'h0
    31:12   R   RSVD                                    20'h0
 */
typedef volatile union _AON_BUFFER_RAM_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t buffer_ram_sd_iso0: 3;
        uint32_t buffer_ram_sd_iso1: 3;
        uint32_t buffer_ram_ds_iso0: 3;
        uint32_t buffer_ram_ds_iso1: 3;
        uint32_t RSVD: 20;
    };
} AON_BUFFER_RAM_PWR_TYPE;

/* 0x620    0x4000_0620
    0       R/W data_ram_vsel                           1'h1
    31:1    R   RSVD                                    31'h0
 */
typedef volatile union _AON_DATA_RAM_VSEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t data_ram_vsel: 1;
        uint32_t RSVD: 31;
    };
} AON_DATA_RAM_VSEL_TYPE;

/* 0x624    0x4000_0624
    13:0    R/W data_ram_lv                             14'b11000101100010
    27:14   R/W data_ram_hv                             14'b11000010101100
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_DATA_RAM_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t data_ram_lv: 14;
        uint32_t data_ram_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_DATA_RAM_HV_LV_TYPE;

/* 0x628    0x4000_0628
    0       R/W data_ram_sd_iso0                        1'h0
    1       R/W data_ram_sd_iso1                        1'h0
    2       R/W data_ram_ds_iso0                        1'h0
    3       R/W data_ram_ds_iso1                        1'h0
    31:4    R   RSVD                                    28'h0
 */
typedef volatile union _AON_DATA_RAM_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t data_ram_sd_iso0: 1;
        uint32_t data_ram_sd_iso1: 1;
        uint32_t data_ram_ds_iso0: 1;
        uint32_t data_ram_ds_iso1: 1;
        uint32_t RSVD: 28;
    };
} AON_DATA_RAM_PWR_TYPE;

/* 0x62C    0x4000_062c
    0       R/W usb_vsel                                1'h1
    31:1    R   RSVD                                    31'h0
 */
typedef volatile union _AON_USB_VSEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t usb_vsel: 1;
        uint32_t RSVD: 31;
    };
} AON_USB_VSEL_TYPE;

/* 0x630    0x4000_0630
    13:0    R/W usb_lv                                  14'h292
    27:14   R/W usb_hv                                  14'h213
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_USB_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t usb_lv: 14;
        uint32_t usb_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_USB_HV_LV_TYPE;

/* 0x634    0x4000_0634
    0       R/W usb_2176x35_sd_iso0                     1'h0
    1       R/W usb_2176x35_sd_iso1                     1'h0
    2       R/W usb_2176x35_ds_iso0                     1'h0
    3       R/W usb_2176x35_ds_iso1                     1'h0
    4       R/W usb_2176x35_ls_iso0                     1'h0
    5       R/W usb_2176x35_ls_iso1                     1'h0
    31:6    R   RSVD                                    26'h0
 */
typedef volatile union _AON_USB_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t usb_2176x35_sd_iso0: 1;
        uint32_t usb_2176x35_sd_iso1: 1;
        uint32_t usb_2176x35_ds_iso0: 1;
        uint32_t usb_2176x35_ds_iso1: 1;
        uint32_t usb_2176x35_ls_iso0: 1;
        uint32_t usb_2176x35_ls_iso1: 1;
        uint32_t RSVD: 26;
    };
} AON_USB_PWR_TYPE;

