rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x638    0x4000_0638
    0       R/W sdio_ram_pd_iso0                        1'h0
    1       R/W sdio_ram_pd_iso1                        1'h0
    31:2    R   RSVD                                    30'h0
 */
typedef volatile union _AON_SDIO_RAM_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t sdio_ram_pd_iso0: 1;
        uint32_t sdio_ram_pd_iso1: 1;
        uint32_t RSVD: 30;
    };
} AON_SDIO_RAM_PWR_TYPE;

/* 0x63C    0x4000_063c
    0       R/W display_128x32_pd_iso0                  1'h0
    1       R/W display_128x32_pd_iso1                  1'h0
    31:2    R   RSVD                                    30'h0
 */
typedef volatile union _AON_DISPLAY_128x32_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t display_128x32_pd_iso0: 1;
        uint32_t display_128x32_pd_iso1: 1;
        uint32_t RSVD: 30;
    };
} AON_DISPLAY_128x32_PWR_TYPE;

/* 0x640    0x4000_0640
    0       R/W display_672x24_pd_iso0                  1'h0
    1       R/W display_672x24_pd_iso1                  1'h0
    31:2    R   RSVD                                    30'h0
 */
typedef volatile union _AON_DISPLAY_672x24_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t display_672x24_pd_iso0: 1;
        uint32_t display_672x24_pd_iso1: 1;
        uint32_t RSVD: 30;
    };
} AON_DISPLAY_672x24_PWR_TYPE;

/* 0x644    0x4000_0644
    1:0     R/W gmac_512x32_pd_iso0                     2'h0
    3:2     R/W gmac_512x32_pd_iso1                     2'h0
    31:4    R   RSVD                                    28'h0
 */
typedef volatile union _AON_GMAC_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t gmac_512x32_pd_iso0: 2;
        uint32_t gmac_512x32_pd_iso1: 2;
        uint32_t RSVD: 28;
    };
} AON_GMAC_PWR_TYPE;

/* 0x648    0x4000_0648
    5:0     R/W pke_rom_hv                              6'h13
    31:6    R/W RSVD                                    26'h0
 */
typedef volatile union _AON_PKE_ROM_HV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t pke_rom_hv: 6;
        uint32_t RSVD: 26;
    };
} AON_PKE_ROM_HV_TYPE;

/* 0x64C    0x4000_064c
    0       R/W pke_rom_sd_iso1                         1'h0
    1       R/W pke_rom_sd_iso0                         1'h0
    2       R/W pke_rom_ls_iso1                         1'h0
    3       R/W pke_rom_ls_iso0                         1'h0
    31:4    R/W RSVD                                    28'h0
 */
typedef volatile union _AON_PKE_ROM_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t pke_rom_sd_iso1: 1;
        uint32_t pke_rom_sd_iso0: 1;
        uint32_t pke_rom_ls_iso1: 1;
        uint32_t pke_rom_ls_iso0: 1;
        uint32_t RSVD: 28;
    };
} AON_PKE_ROM_PWR_TYPE;

/* 0x650    0x4000_0650
    1:0     R/W pke_mmem_pd_iso0                        2'h0
    3:2     R/W pke_mmem_pd_iso1                        2'h0
    31:4    R   RSVD                                    28'h0
 */
typedef volatile union _AON_PKE_MMEM_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t pke_mmem_pd_iso0: 2;
        uint32_t pke_mmem_pd_iso1: 2;
        uint32_t RSVD: 28;
    };
} AON_PKE_MMEM_PWR_TYPE;

/* 0x654    0x4000_0654
    1:0     R/W pke_tmem_pd_iso0                        2'h0
    3:2     R/W pke_tmem_pd_iso1                        2'h0
    31:4    R   RSVD                                    28'h0
 */
typedef volatile union _AON_PKE_TMEM_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t pke_tmem_pd_iso0: 2;
        uint32_t pke_tmem_pd_iso1: 2;
        uint32_t RSVD: 28;
    };
} AON_PKE_TMEM_PWR_TYPE;

/* 0x658    0x4000_0658
    0       R/W audio_vsel                              1'h1
    31:1    R   RSVD                                    31'h0
 */
typedef volatile union _AON_AUDIO_VSEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t audio_vsel: 1;
        uint32_t RSVD: 31;
    };
} AON_AUDIO_VSEL_TYPE;

/* 0x65C    0x4000_065c
    13:0    R/W audio_lv                                14'h292
    27:14   R/W audio_hv                                14'h213
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_AUDIO_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t audio_lv: 14;
        uint32_t audio_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_AUDIO_HV_LV_TYPE;

/* 0x660    0x4000_0660
    1:0     R/W audio_ad_ram_sd_iso0                    2'h0
    3:2     R/W audio_ad_ram_sd_iso1                    2'h0
    5:4     R/W audio_ad_ram_ds_iso0                    2'h0
    7:6     R/W audio_ad_ram_ds_iso1                    2'h0
    9:8     R/W audio_ad_ram_ls_iso0                    2'h0
    11:10   R/W audio_ad_ram_ls_iso1                    2'h0
    31:12   R   RSVD                                    20'h0
 */
typedef volatile union _AON_AUDIO_AD_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t audio_ad_ram_sd_iso0: 2;
        uint32_t audio_ad_ram_sd_iso1: 2;
        uint32_t audio_ad_ram_ds_iso0: 2;
        uint32_t audio_ad_ram_ds_iso1: 2;
        uint32_t audio_ad_ram_ls_iso0: 2;
        uint32_t audio_ad_ram_ls_iso1: 2;
        uint32_t RSVD: 20;
    };
} AON_AUDIO_AD_PWR_TYPE;

/* 0x664    0x4000_0664
    0       R/W audio_da_ram_sd_iso0                    1'h0
    1       R/W audio_da_ram_sd_iso1                    1'h0
    2       R/W audio_da_ram_ds_iso0                    1'h0
    3       R/W audio_da_ram_ds_iso1                    1'h0
    4       R/W audio_da_ram_ls_iso0                    1'h0
    5       R/W audio_da_ram_ls_iso1                    1'h0
    31:6    R   RSVD                                    26'h0
 */
typedef volatile union _AON_AUDIO_DA_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t audio_da_ram_sd_iso0: 1;
        uint32_t audio_da_ram_sd_iso1: 1;
        uint32_t audio_da_ram_ds_iso0: 1;
        uint32_t audio_da_ram_ds_iso1: 1;
        uint32_t audio_da_ram_ls_iso0: 1;
        uint32_t audio_da_ram_ls_iso1: 1;
        uint32_t RSVD: 26;
    };
} AON_AUDIO_DA_PWR_TYPE;

/* 0x668    0x4000_0668
    0       R/W can_vsel                                1'h1
    31:1    R   RSVD                                    31'h0
 */
typedef volatile union _AON_CAN_VSEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t can_vsel: 1;
        uint32_t RSVD: 31;
    };
} AON_CAN_VSEL_TYPE;

/* 0x66C    0x4000_066c
    13:0    R/W can_lv                                  14'h292
    27:14   R/W can_hv                                  14'h213
    31:28   R   RSVD                                    4'h0
 */
typedef volatile union _AON_CAN_HV_LV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t can_lv: 14;
        uint32_t can_hv: 14;
        uint32_t RSVD: 4;
    };
} AON_CAN_HV_LV_TYPE;

/* 0x670    0x4000_0670
    0       R/W can_ram_sd_iso0                         1'h0
    1       R/W can_ram_sd_iso1                         1'h0
    2       R/W can_ram_ds_iso0                         1'h0
    3       R/W can_ram_ds_iso1                         1'h0
    4       R/W can_ram_ls_iso0                         1'h0
    5       R/W can_ram_ls_iso1                         1'h0
    31:6    R   RSVD                                    26'h0
 */
typedef volatile union _AON_CAN_PWR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t can_ram_sd_iso0: 1;
        uint32_t can_ram_sd_iso1: 1;
        uint32_t can_ram_ds_iso0: 1;
        uint32_t can_ram_ds_iso1: 1;
        uint32_t can_ram_ls_iso0: 1;
        uint32_t can_ram_ls_iso1: 1;
        uint32_t RSVD: 26;
    };
} AON_CAN_PWR_TYPE;

/* 0x800    0x4000_0800
    0       R/W BT_CORE_RSTB                            1'b0
    1       R/W BT_PON_RSTB                             1'b0
    2       R/W BT_RET_RSTB                             1'b0
    3       R/W ISO_XTAL                                1'b1
    4       R/W ISO_BT_CORE                             1'b1
    5       R/W ISO_BT_PON                              1'b1
    6       R/W ISO_VDDON_XTAL                          1'b1
    7       R/W ISO_OSC                                 1'b1
    8       R/W ISO_AFE_PLL                             1'b1
    9       R/W BT_PON2_RSTB                            1'b0
    10      R/W ISO_BT_PON2                             1'b1
    11      R/W BT_CORE3_RSTB                           1'b0
    12      R/W ISO_BT_CORE3                            1'b1
    13      R/W BT_AON_ACTIVE_CLK_RSTB                  1'b0
    14      R/W ISO_EF2AON                              1'b1
    15      R/W ISO_USB_VON                             1'b1
    16      R/W ISO_DIG_40M                             1'b1
    17      R/W ISO_AFE_PLL2                            1'b1
    31:18   R   RSVD                                    14'b0
 */
typedef volatile union _AON_REG0X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BT_CORE_RSTB: 1;
        uint32_t BT_PON_RSTB: 1;
        uint32_t BT_RET_RSTB: 1;
        uint32_t ISO_XTAL: 1;
        uint32_t ISO_BT_CORE: 1;
        uint32_t ISO_BT_PON: 1;
        uint32_t ISO_VDDON_XTAL: 1;
        uint32_t ISO_OSC: 1;
        uint32_t ISO_AFE_PLL: 1;
        uint32_t BT_PON2_RSTB: 1;
        uint32_t ISO_BT_PON2: 1;
        uint32_t BT_CORE3_RSTB: 1;
        uint32_t ISO_BT_CORE3: 1;
        uint32_t BT_AON_ACTIVE_CLK_RSTB: 1;
        uint32_t ISO_EF2AON: 1;
        uint32_t ISO_USB_VON: 1;
        uint32_t ISO_DIG_40M: 1;
        uint32_t ISO_AFE_PLL2: 1;
        uint32_t RSVD: 14;
    };
} AON_REG0X_SYS_TYPE;

/* 0x804    0x4000_0804
    0       R/W RFC_STORE                               1'b0
    1       R/W RFC_RESTORE                             1'b0
    2       R/W MODEM_STORE                             1'b0
    3       R/W MODEM_RESTORE                           1'b0
    4       R/W BZ_STORE                                1'b0
    5       R/W BZ_RESTORE                              1'b0
    6       R/W BLE_STORE                               1'b0
    7       R/W BLE_RESTORE                             1'b0
    8       R/W PF_STORE                                1'b0
    9       R/W PF_RESTORE                              1'b0
    10      R/W DP_MODEM_STORE                          1'b0
    11      R/W DP_MODEM_RESTORE                        1'b0
    12      R/W ZB_STORE                                1'b0
    13      R/W ZB_RESTORE                              1'b0
    31:14   R   RSVD                                    18'b0
 */
typedef volatile union _AON_REG1X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RFC_STORE: 1;
        uint32_t RFC_RESTORE: 1;
        uint32_t MODEM_STORE: 1;
        uint32_t MODEM_RESTORE: 1;
        uint32_t BZ_STORE: 1;
        uint32_t BZ_RESTORE: 1;
        uint32_t BLE_STORE: 1;
        uint32_t BLE_RESTORE: 1;
        uint32_t PF_STORE: 1;
        uint32_t PF_RESTORE: 1;
        uint32_t DP_MODEM_STORE: 1;
        uint32_t DP_MODEM_RESTORE: 1;
        uint32_t ZB_STORE: 1;
        uint32_t ZB_RESTORE: 1;
        uint32_t RSVD: 18;
    };
} AON_REG1X_SYS_TYPE;

