rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x808    0x4000_0808
    0       R/W FW_enter_lps                            1'b0
    1       R/W FW_PON_SEQ_RST_N                        1'b0
    2       R/W AON_GATED_EN                            1'b1
    3       R/W PMU_SETTING_ENABLE                      1'b1
    4       R/W WAIT_XTAL_CLK_OK                        1'b1
    5       R/W PMU_OFF_SEQUENCE                        1'b0
    6       R/W AON_BUCK_LOW_IQ_ZCD_32K_CLK_EN          1'b0
    12:7    R/W REG2X_SYS_DUMMY                         6'h2a
    15:13   R/W AON_DBG_SEL                             3'h0
    31:16   R/W REG2X_SYS_DUMMY2                        16'b0
 */
typedef volatile union _AON_REG2X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_enter_lps: 1;
        uint32_t FW_PON_SEQ_RST_N: 1;
        uint32_t AON_GATED_EN: 1;
        uint32_t PMU_SETTING_ENABLE: 1;
        uint32_t WAIT_XTAL_CLK_OK: 1;
        uint32_t PMU_OFF_SEQUENCE: 1;
        uint32_t AON_BUCK_LOW_IQ_ZCD_32K_CLK_EN: 1;
        uint32_t REG2X_SYS_DUMMY: 6;
        uint32_t AON_DBG_SEL: 3;
        uint32_t REG2X_SYS_DUMMY2: 16;
    };
} AON_REG2X_SYS_TYPE;

/* 0x80C    0x4000_080c
    0       R/W AON_ACTIVE_CLK_EN                       1'b0
    1       R/W SRC_AON_ACTIVE_CLK_SEL                  1'b1
    2       R/W aon_loader_en                           1'b0
    3       R/W SWR_BY_CORE                             1'b0
    5:4     R/W PIN_CLK_OUT_SEL                         2'b1
    7:6     R/W REG3X_SYS_dummy2                        2'b1
    9:8     R/W rtc_in_sel                              2'b0
    10      R/W en_gpio_32k                             1'b0
    12:11   R/W REG3X_SYS_dummy3                        2'b0
    13      R   reg_aon_wdt_reset                       1'b0
    14      R/W TX_BIG_POUT                             1'b0
    16:15   R/W aonqcode_ph_pin_sel                     2'b0
    17      W1O REG_EN_CLK_REQ_FROM_IO                  1'b0
    31:18   R/W RSVD                                    14'b0
 */
typedef volatile union _AON_REG3X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON_ACTIVE_CLK_EN: 1;
        uint32_t SRC_AON_ACTIVE_CLK_SEL: 1;
        uint32_t aon_loader_en: 1;
        uint32_t SWR_BY_CORE: 1;
        uint32_t PIN_CLK_OUT_SEL: 2;
        uint32_t REG3X_SYS_dummy2: 2;
        uint32_t rtc_in_sel: 2;
        uint32_t en_gpio_32k: 1;
        uint32_t REG3X_SYS_dummy3: 2;
        uint32_t reg_aon_wdt_reset: 1;
        uint32_t TX_BIG_POUT: 1;
        uint32_t aonqcode_ph_pin_sel: 2;
        uint32_t REG_EN_CLK_REQ_FROM_IO: 1;
        uint32_t RSVD: 14;
    };
} AON_REG3X_SYS_TYPE;

/* 0x810    0x4000_0810
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_REG4X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_REG4X_SYS_TYPE;

/* 0x814    0x4000_0814
    0       R/W SEL_32K_XTAL                            1'b0
    1       R/W SEL_32K_SDM                             1'b0
    3:2     R/W SEL_32K_dummy                           2'b0
    4       R/W SEL_32K_XTAL_sys                        1'b0
    5       R/W SEL_32K_SDM_sys                         1'b0
    7:6     R/W SEL_32K_sys_dummy                       2'b0
    8       R/W SEL_32K_XTAL_rtc                        1'b0
    9       R/W SEL_32K_SDM_rtc                         1'b0
    10      R/W SEL_32K_GPIO_rtc                        1'b0
    11      R/W SEL_32K_rtc_dummy                       1'b0
    12      R/W SEL_32K_XTAL_bt                         1'b0
    13      R/W SEL_32K_SDM_bt                          1'b0
    15:14   R/W SEL_32K_bt_dummy                        2'b0
    16      R/W SEL_32K_XTAL_wdg                        1'b0
    17      R/W SEL_32K_SDM_wdg                         1'b0
    19:18   R/W SEL_32K_wdt_dummy                       2'b0
    20      R/W SEL_32K_XTAL_qd                         1'b0
    21      R/W SEL_32K_SDM_qd                          1'b0
    23:22   R/W SEL_32K_qd_dummy                        2'b0
    24      R/W SEL_32K_XTAL_segcom                     1'b0
    25      R/W SEL_32K_SDM_segcom                      1'b0
    27:26   R/W SEL_32K_segcom_dummy                    2'b0
    28      R/W SEL_32K_XTAL_pf_rtc                     1'b0
    29      R/W SEL_32K_SDM_pf_rtc                      1'b0
    31:30   R   RSVD                                    2'b0
 */
typedef volatile union _AON_REG5X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SEL_32K_XTAL: 1;
        uint32_t SEL_32K_SDM: 1;
        uint32_t SEL_32K_dummy: 2;
        uint32_t SEL_32K_XTAL_sys: 1;
        uint32_t SEL_32K_SDM_sys: 1;
        uint32_t SEL_32K_sys_dummy: 2;
        uint32_t SEL_32K_XTAL_rtc: 1;
        uint32_t SEL_32K_SDM_rtc: 1;
        uint32_t SEL_32K_GPIO_rtc: 1;
        uint32_t SEL_32K_rtc_dummy: 1;
        uint32_t SEL_32K_XTAL_bt: 1;
        uint32_t SEL_32K_SDM_bt: 1;
        uint32_t SEL_32K_bt_dummy: 2;
        uint32_t SEL_32K_XTAL_wdg: 1;
        uint32_t SEL_32K_SDM_wdg: 1;
        uint32_t SEL_32K_wdt_dummy: 2;
        uint32_t SEL_32K_XTAL_qd: 1;
        uint32_t SEL_32K_SDM_qd: 1;
        uint32_t SEL_32K_qd_dummy: 2;
        uint32_t SEL_32K_XTAL_segcom: 1;
        uint32_t SEL_32K_SDM_segcom: 1;
        uint32_t SEL_32K_segcom_dummy: 2;
        uint32_t SEL_32K_XTAL_pf_rtc: 1;
        uint32_t SEL_32K_SDM_pf_rtc: 1;
        uint32_t RSVD: 2;
    };
} AON_REG5X_SYS_TYPE;

/* 0x818    0x4000_0818
    0       R/W r_cpu_clk_dummy0                        1'b0
    1       R/W r_cpu_clk_dummy1                        1'b0
    2       R/W r_aon_cpu_pll_src_sel                   1'b0
    31:3    R   RSVD                                    29'b0
 */
typedef volatile union _AON_REG6X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_cpu_clk_dummy0: 1;
        uint32_t r_cpu_clk_dummy1: 1;
        uint32_t r_aon_cpu_pll_src_sel: 1;
        uint32_t RSVD: 29;
    };
} AON_REG6X_SYS_TYPE;

/* 0x81C    0x4000_081c
    0       R/W short_pulse_wkup_en                     1'b0
    1       W1C short_pulse_wkup_event_latch            1'b1
    3:2     R   RSVD                                    2'b0
    4       R/W USB_WKEN                                1'b0
    5       R/W USB_WKPOL                               1'b0
    6       R/W usb_wakeup_sel                          1'b1
    31:7    R   RSVD                                    25'b0
 */
typedef volatile union _AON_REG7X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t short_pulse_wkup_en: 1;
        uint32_t short_pulse_wkup_event_latch: 1;
        uint32_t RSVD_1: 2;
        uint32_t USB_WKEN: 1;
        uint32_t USB_WKPOL: 1;
        uint32_t usb_wakeup_sel: 1;
        uint32_t RSVD: 25;
    };
} AON_REG7X_SYS_TYPE;

