rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x820    0x4000_0820
    0       W1C gpio_wkup_sts                           1'b1
    1       W1C rtc_wkup_sts                            1'b1
    2       W1C rtc_pf_wkup_sts                         1'b1
    3       W1C rif_wkup_sts                            1'b1
    4       W1C usb_wkup_sts                            1'b1
    5       W1C aonqd_wkup_sts                          1'b1
    6       W1C lpcomp0_wkup_sts                        1'b1
    31:7    R   RSVD                                    25'b0
 */
typedef volatile union _AON_REG8X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t gpio_wkup_sts: 1;
        uint32_t rtc_wkup_sts: 1;
        uint32_t rtc_pf_wkup_sts: 1;
        uint32_t rif_wkup_sts: 1;
        uint32_t usb_wkup_sts: 1;
        uint32_t aonqd_wkup_sts: 1;
        uint32_t lpcomp0_wkup_sts: 1;
        uint32_t RSVD: 25;
    };
} AON_REG8X_SYS_TYPE;

/* 0x824    0x4000_0824
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_REG9X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_REG9X_SYS_TYPE;

/* 0x828    0x4000_0828
    0       R/W reg_SCAN_MODE                           1'b0
    1       R/W PAD_BONDING_SHDN                        1'b1
    3:2     R   RSVD                                    2'b0
    4       R/W PAD_VDDIO_FLASH_E                       1'b0
    5       R/W PAD_VDDIO_FLASH_POW_VG1                 1'b0
    6       R/W PAD_VDDIO_FLASH_POW_VG2                 1'b0
    7       R/W PAD_VDDIO_PSRAM_E                       1'b0
    8       R/W PAD_VDDIO_PSRAM_POW_VG1                 1'b0
    9       R/W PAD_VDDIO_PSRAM_POW_VG2                 1'b0
    31:10   R   RSVD                                    22'b0
 */
typedef volatile union _AON_REG10X_SYS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t reg_SCAN_MODE: 1;
        uint32_t PAD_BONDING_SHDN: 1;
        uint32_t RSVD_1: 2;
        uint32_t PAD_VDDIO_FLASH_E: 1;
        uint32_t PAD_VDDIO_FLASH_POW_VG1: 1;
        uint32_t PAD_VDDIO_FLASH_POW_VG2: 1;
        uint32_t PAD_VDDIO_PSRAM_E: 1;
        uint32_t PAD_VDDIO_PSRAM_POW_VG1: 1;
        uint32_t PAD_VDDIO_PSRAM_POW_VG2: 1;
        uint32_t RSVD: 22;
    };
} AON_REG10X_SYS_TYPE;

/* 0x82C    0x4000_082c
    0       R/W DIGI_Efuse_CK_L                         1'b0
    31:1    R   RSVD                                    31'b0
 */
typedef volatile union _AON_REG0X_EFUSE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DIGI_Efuse_CK_L: 1;
        uint32_t RSVD: 31;
    };
} AON_REG0X_EFUSE_TYPE;

/* 0x830    0x4000_0830
    4:0     R   XTAL_PDCK_LP                            5'd0
    5       R   XTAL_PDCK_OK                            1'b0
    6       R   XTAL_PDCK_BUSY                          1'b0
    7       R/W xtal_pdck_rslt_latch                    1'b0
    12:8    R   XPDCK_VREF_OUT                          5'b11111
    13      R   XPDCK_READY                             1'b0
    14      R   XPDCK_BUSY                              1'b0
    15      R   XTAL_PDCK_LP[5]                         1'b0
    16      R   XPDCK_VREF_OUT[5]                       1'b0
    31:17   R   RSVD                                    15'b0
 */
typedef volatile union _AON_REG0X_XPDCK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_PDCK_LP: 5;
        uint32_t XTAL_PDCK_OK: 1;
        uint32_t XTAL_PDCK_BUSY: 1;
        uint32_t xtal_pdck_rslt_latch: 1;
        uint32_t XPDCK_VREF_OUT: 5;
        uint32_t XPDCK_READY: 1;
        uint32_t XPDCK_BUSY: 1;
        uint32_t XTAL_PDCK_LP_5: 1;
        uint32_t XPDCK_VREF_OUT_5: 1;
        uint32_t RSVD: 15;
    };
} AON_REG0X_XPDCK_TYPE;

/* 0x834    0x4000_0834
    0       R/W PWM_EN_POS                              1'b0
    1       R/W PWM_POS_RSTB                            1'b1
    9:2     R   RSVD                                    8'b0
    12:10   R/W PWM_PON_STEP_WAIT                       3'b0
    15:13   R/W PWM_PON_WAIT                            3'b0
    20:16   R/W PWM_PON_STEP                            5'b1
    25:21   R/W PWM_PON_START                           5'b0
    30:26   R/W PWM_PON_OVER                            5'b11111
    31      R   RSVD                                    1'h0
 */
typedef volatile union _AON_REG0X_PWM_POS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PWM_EN_POS: 1;
        uint32_t PWM_POS_RSTB: 1;
        uint32_t RSVD_1: 8;
        uint32_t PWM_PON_STEP_WAIT: 3;
        uint32_t PWM_PON_WAIT: 3;
        uint32_t PWM_PON_STEP: 5;
        uint32_t PWM_PON_START: 5;
        uint32_t PWM_PON_OVER: 5;
        uint32_t RSVD: 1;
    };
} AON_REG0X_PWM_POS_TYPE;

/* 0x838    0x4000_0838
    0       R/W PFM_EN_POS                              1'b0
    1       R/W PFM_POS_RSTB                            1'b1
    12:2    R   RSVD                                    11'b0
    15:13   R/W PFM_PON_STEP_WAIT                       3'b0
    19:16   R/W PFM_PON_STEP                            4'b1
    23:20   R/W PFM_PON_START                           4'b0
    27:24   R/W PFM_PON_OVER                            4'b1011
    30:28   R/W PFM_PON_WAIT                            3'b1
    31      R   RSVD                                    1'h0
 */
typedef volatile union _AON_REG0X_PFM_POS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PFM_EN_POS: 1;
        uint32_t PFM_POS_RSTB: 1;
        uint32_t RSVD_1: 11;
        uint32_t PFM_PON_STEP_WAIT: 3;
        uint32_t PFM_PON_STEP: 4;
        uint32_t PFM_PON_START: 4;
        uint32_t PFM_PON_OVER: 4;
        uint32_t PFM_PON_WAIT: 3;
        uint32_t RSVD: 1;
    };
} AON_REG0X_PFM_POS_TYPE;

/* 0x83C    0x4000_083c
    1:0     R   RSVD                                    2'b0
    11:2    R/W D300k_PFM_LOWER_BND                     10'b0000001010
    12      R/W D300k_EN_VDROP_DET                      1'b0
    13      R/W D300k_EN_32K_AUDIO                      1'b0
    14      R/W D300k_RSTB                              1'b0
    15      R/W D300k_SEL_NI_ON                         1'b0
    16      R/W D300k_REG_MANU_MODE_CCOT                1'b1
    22:17   R/W D300k_REG_MANU_CCOT                     6'b001000
    31:23   R   RSVD                                    9'b0
 */
typedef volatile union _AON_REG0X_300K_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD_1: 2;
        uint32_t D300k_PFM_LOWER_BND: 10;
        uint32_t D300k_EN_VDROP_DET: 1;
        uint32_t D300k_EN_32K_AUDIO: 1;
        uint32_t D300k_RSTB: 1;
        uint32_t D300k_SEL_NI_ON: 1;
        uint32_t D300k_REG_MANU_MODE_CCOT: 1;
        uint32_t D300k_REG_MANU_CCOT: 6;
        uint32_t RSVD: 9;
    };
} AON_REG0X_300K_TYPE;

/* 0x840    0x4000_0840
    1:0     R/W D300k_PFM_COMP_SAMPLE_CYC               2'b0
    3:2     R/W D300k_SAMPLE_CYC                        2'b0
    9:4     R/W D300k_CCOT_FORCE                        6'b010000
    15:10   R/W D300k_CCOT_INIT                         6'b001000
    21:16   R   RSVD                                    6'b0
    31:22   R/W D300k_PFM_UPPER_BND                     10'b0000010100
 */
typedef volatile union _AON_REG1X_300K_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t D300k_PFM_COMP_SAMPLE_CYC: 2;
        uint32_t D300k_SAMPLE_CYC: 2;
        uint32_t D300k_CCOT_FORCE: 6;
        uint32_t D300k_CCOT_INIT: 6;
        uint32_t RSVD: 6;
        uint32_t D300k_PFM_UPPER_BND: 10;
    };
} AON_REG1X_300K_TYPE;

