rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x844    0x4000_0844
    15:0    R   RO_AON_CNT_EXTRA_DELAY_PON_XTAL         16'h0
    22:16   R   RO_WK_REASON                            7'h0
    31:23   R   RSVD                                    9'h0
 */
typedef volatile union _AON_AON_READ_RG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RO_AON_CNT_EXTRA_DELAY_PON_XTAL: 16;
        uint32_t RO_WK_REASON: 7;
        uint32_t RSVD: 9;
    };
} AON_AON_READ_RG0X_TYPE;

/* 0x848    0x4000_0848
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG1X_TYPE;

/* 0x84C    0x4000_084c
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG2X_TYPE;

/* 0x850    0x4000_0850
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG3X_TYPE;

/* 0x854    0x4000_0854
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG4X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG4X_TYPE;

/* 0x858    0x4000_0858
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG5X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG5X_TYPE;

/* 0x85C    0x4000_085c
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG6X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG6X_TYPE;

/* 0x860    0x4000_0860
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG7X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG7X_TYPE;

/* 0x864    0x4000_0864
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG8X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG8X_TYPE;

/* 0x868    0x4000_0868
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG9X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG9X_TYPE;

/* 0x86C    0x4000_086c
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG10X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG10X_TYPE;

/* 0x870    0x4000_0870
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG11X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG11X_TYPE;

/* 0x874    0x4000_0874
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG12X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG12X_TYPE;

/* 0x878    0x4000_0878
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG13X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG13X_TYPE;

/* 0x87C    0x4000_087c
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG14X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG14X_TYPE;

/* 0x880    0x4000_0880
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG15X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG15X_TYPE;

/* 0x884    0x4000_0884
    31:0    R   RSVD                                    32'b0
 */
typedef volatile union _AON_AON_READ_RG16X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_AON_READ_RG16X_TYPE;

/* 0xAB0    0x4000_0ab0
    0       R/W LOP_PON_ENPC_DIGI                       1'b0
    1       R/W LOP_PON_PFM                             1'b0
    2       R/W LOP_PON_SWR                             1'b0
    3       R/W LOP_PON_POW_32KOSC                      1'b1
    4       R/W LOP_PON_ACTIVE_CLK_SEL                  1'b1
    5       R/W LOP_PON_XTAL                            1'b1
    6       R/W LOP_PON_POW_32KXTAL                     1'b0
    7       R/W LOP_PON_VDDIO_PSRAM_PC_EN               1'b1
    8       R/W LOP_PON_VDDIO_FLASH_PC_EN               1'b1
    9       R/W LOP_PON_ENPC_AON                        1'b1
    10      R/W LOP_PON_VDDIO_PC_CTRL                   1'b1
    11      R/W LOP_PON_PLL1                            1'b0
    12      R/W LOP_PON_PLL2                            1'b0
    18:13   R/W LOP_RG0_dummy1                          6'b011101
    21:19   R/W LOP_PON_XTAL_MODE                       3'b100
    22      R/W LOP_PON_PWM_EN_POS                      1'b1
    23      R/W LOP_PON_PFM_EN_POS                      1'b1
    24      R/W LOP_PON_OSC                             1'b1
    31:25   R   RSVD                                    7'h0
 */
typedef volatile union _AON_LOP_RG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_PON_ENPC_DIGI: 1;
        uint32_t LOP_PON_PFM: 1;
        uint32_t LOP_PON_SWR: 1;
        uint32_t LOP_PON_POW_32KOSC: 1;
        uint32_t LOP_PON_ACTIVE_CLK_SEL: 1;
        uint32_t LOP_PON_XTAL: 1;
        uint32_t LOP_PON_POW_32KXTAL: 1;
        uint32_t LOP_PON_VDDIO_PSRAM_PC_EN: 1;
        uint32_t LOP_PON_VDDIO_FLASH_PC_EN: 1;
        uint32_t LOP_PON_ENPC_AON: 1;
        uint32_t LOP_PON_VDDIO_PC_CTRL: 1;
        uint32_t LOP_PON_PLL1: 1;
        uint32_t LOP_PON_PLL2: 1;
        uint32_t LOP_RG0_dummy1: 6;
        uint32_t LOP_PON_XTAL_MODE: 3;
        uint32_t LOP_PON_PWM_EN_POS: 1;
        uint32_t LOP_PON_PFM_EN_POS: 1;
        uint32_t LOP_PON_OSC: 1;
        uint32_t RSVD: 7;
    };
} AON_LOP_RG0X_TYPE;

/* 0xAB4    0x4000_0ab4
    0       R/W LOP_PON_BUCK_PFM_IHALF                  1'b0
    1       R/W LOP_PON_BUCK_EN_OCP_IBON                1'b1
    5:2     R/W LOP_PON_BUCK_PFM_ICOMP                  4'b0010
    9:6     R/W LOP_PON_BUCK_PFM_ISCH                   4'b0010
    10      R/W LOP_PON_BUCK_ENOCPPS_H                  1'b0
    11      R/W LOP_PON_LDO_ENLDO311_IB20nA             1'b1
    14:12   R/W LOP_PON_MBIAS_VR_SEL_LDO311             3'b010
    15      R/W LOP_PON_BUCK_ENOCPPFM_H                 1'b1
    18:16   R/W LOP_PON_LDO_EN_DL_LDO311                3'b111
    20:19   R/W LOP_PON_BUCK_OCPRES_H                   2'b10
    21      R/W LOP_PON_BUCK_OCPSEL_H                   1'b1
    24:22   R/W LOP_PON_BUCK_VREFOCP_H                  3'b001
    25      R/W LOP_PON_BUCK_ENOFFSAWPFM_H              1'b1
    26      R/W LOP_PON_BUCK_PFM_COT_EN                 1'b0
    27      R/W LOP_PON_BUCK_PFM_AOT_EN                 1'b1
    29:28   R/W LOP_PON_IBSEL_TONCOMP                   2'b01
    30      R/W LOP_PON_LDO_POW_LDODIGI                 1'b1
    31      R/W LOP_PON_AON_BUCK_LOW_IQ_ZCD_32K_CLK_EN  1'b0
 */
typedef volatile union _AON_LOP_RG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_PON_BUCK_PFM_IHALF: 1;
        uint32_t LOP_PON_BUCK_EN_OCP_IBON: 1;
        uint32_t LOP_PON_BUCK_PFM_ICOMP: 4;
        uint32_t LOP_PON_BUCK_PFM_ISCH: 4;
        uint32_t LOP_PON_BUCK_ENOCPPS_H: 1;
        uint32_t LOP_PON_LDO_ENLDO311_IB20nA: 1;
        uint32_t LOP_PON_MBIAS_VR_SEL_LDO311: 3;
        uint32_t LOP_PON_BUCK_ENOCPPFM_H: 1;
        uint32_t LOP_PON_LDO_EN_DL_LDO311: 3;
        uint32_t LOP_PON_BUCK_OCPRES_H: 2;
        uint32_t LOP_PON_BUCK_OCPSEL_H: 1;
        uint32_t LOP_PON_BUCK_VREFOCP_H: 3;
        uint32_t LOP_PON_BUCK_ENOFFSAWPFM_H: 1;
        uint32_t LOP_PON_BUCK_PFM_COT_EN: 1;
        uint32_t LOP_PON_BUCK_PFM_AOT_EN: 1;
        uint32_t LOP_PON_IBSEL_TONCOMP: 2;
        uint32_t LOP_PON_LDO_POW_LDODIGI: 1;
        uint32_t LOP_PON_AON_BUCK_LOW_IQ_ZCD_32K_CLK_EN: 1;
    };
} AON_LOP_RG1X_TYPE;

