rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0xC04    0x4000_0c04
    2:0     R/W MBIAS_REG2X_DUMMY1                      3'b101
    6:3     R/W MBIAS_VR_SEL_LDORET                     4'b1100
    9:7     R/W MBIAS_BG_VREF_SEL_L                     3'b100
    12:10   R/W MBIAS_BG_VREF_SEL_H                     3'b100
    13      R/W MBIAS_BG_Efuse_Data_H                   1'b0
    14      R/W MBIAS_BG_DIGI_RST_H                     1'b0
    15      R/W MBIAS_REG2X_DUMMY2                      1'b1
    31:16   R   RSVD                                    16'b1111111100000000
 */
typedef volatile union _AON_REG2X_MBIAS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t MBIAS_REG2X_DUMMY1: 3;
        uint32_t MBIAS_VR_SEL_LDORET: 4;
        uint32_t MBIAS_BG_VREF_SEL_L: 3;
        uint32_t MBIAS_BG_VREF_SEL_H: 3;
        uint32_t MBIAS_BG_Efuse_Data_H: 1;
        uint32_t MBIAS_BG_DIGI_RST_H: 1;
        uint32_t MBIAS_REG2X_DUMMY2: 1;
        uint32_t RSVD: 16;
    };
} AON_REG2X_MBIAS_TYPE;

/* 0xC08    0x4000_0c08
    0       R   MBIAS_Q1_Efuse                          1'b0
    1       R   MBIAS_Q2_Efuse                          1'b0
    2       R   MBIAS_CKOUT0X_DUMMY2                    1'b0
    3       R   MBIAS_CKOUT0X_DUMMY3                    1'b0
    4       R   MBIAS_CKOUT0X_DUMMY4                    1'b0
    5       R   MBIAS_CKOUT0X_DUMMY5                    1'b0
    6       R   MBIAS_CKOUT0X_DUMMY6                    1'b0
    7       R   MBIAS_CKOUT0X_DUMMY7                    1'b0
    8       R   MBIAS_CKOUT0X_DUMMY8                    1'b0
    9       R   MBIAS_CKOUT0X_DUMMY9                    1'b0
    10      R   MBIAS_CKOUT0X_DUMMY10                   1'b0
    11      R   MBIAS_CKOUT0X_DUMMY11                   1'b0
    12      R   MBIAS_CKOUT0X_DUMMY12                   1'b0
    13      R   MBIAS_CKOUT0X_DUMMY13                   1'b0
    14      R   MBIAS_BGOK_L                            1'b0
    15      R   MBIAS_PORB_LDO311_L                     1'b0
    31:16   R   MBIAS_CKOUT0X_DUMMY14                   16'b0
 */
typedef volatile union _AON_C_KOUT0X_MBIAS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t MBIAS_Q1_Efuse: 1;
        uint32_t MBIAS_Q2_Efuse: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY2: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY3: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY4: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY5: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY6: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY7: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY8: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY9: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY10: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY11: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY12: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY13: 1;
        uint32_t MBIAS_BGOK_L: 1;
        uint32_t MBIAS_PORB_LDO311_L: 1;
        uint32_t MBIAS_CKOUT0X_DUMMY14: 16;
    };
} AON_C_KOUT0X_MBIAS_TYPE;

/* 0xC10    0x4000_0c10
    0       R/W LDO_REG0X_DUMMY1                        1'b0
    1       R/W LDO_ENPC_LDODIGI                        1'b0
    2       R/W LDO_POW_LDODIGI                         1'b1
    5:3     R/W LDO_EN_DL_LDO311                        3'b000
    7:6     R/W LDO_REG0X_DUMMY0                        2'b01
    8       R/W LDO_ENLDO311_IB20nA                     1'b0
    13:9    R/W LDO_TUNE_LDODIGI                        5'b10100
    14      R/W LDO_EN_DMYL_50U_LDODIGI                 1'b0
    15      R/W LDO_EN_DMYL_200U_LDODIGI                1'b0
    17:16   R/W LDO_REG1X_DUMMY1                        2'b11
    18      R/W LDO_ENPC_CORE_SMALL                     1'b0
    19      R/W LDO_ENPC_CORE_BIG                       1'b0
    21:20   R/W LDO_REG1X_DUMMY1                        2'b01
    22      R/W LDO_POW_LDODIGI_FB                      1'b0
    24:23   R/W LDO_COMPTUNE_LDORET                     2'b11
    30:25   R/W LDO_REG1X_DUMMY2                        6'b011111
    31      R/W LDO_POW_LDORET                          1'b1
 */
typedef volatile union _AON_REG0X_LDO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_REG0X_DUMMY1: 1;
        uint32_t LDO_ENPC_LDODIGI: 1;
        uint32_t LDO_POW_LDODIGI: 1;
        uint32_t LDO_EN_DL_LDO311: 3;
        uint32_t LDO_REG0X_DUMMY0: 2;
        uint32_t LDO_ENLDO311_IB20nA: 1;
        uint32_t LDO_TUNE_LDODIGI: 5;
        uint32_t LDO_EN_DMYL_50U_LDODIGI: 1;
        uint32_t LDO_EN_DMYL_200U_LDODIGI: 1;
        uint32_t LDO_REG1X_DUMMY1_1: 2;
        uint32_t LDO_ENPC_CORE_SMALL: 1;
        uint32_t LDO_ENPC_CORE_BIG: 1;
        uint32_t LDO_REG1X_DUMMY1: 2;
        uint32_t LDO_POW_LDODIGI_FB: 1;
        uint32_t LDO_COMPTUNE_LDORET: 2;
        uint32_t LDO_REG1X_DUMMY2: 6;
        uint32_t LDO_POW_LDORET: 1;
    };
} AON_REG0X_LDO_TYPE;

/* 0xC14    0x4000_0c14
    0       R/W LDO_POW_EFUSE                           1'b0
    1       R/W LDO_POW_EFUSE_DL_PC1                    1'b0
    2       R/W LDO_POW_EFUSE_DL_PC2                    1'b0
    3       R/W LDO_POW_EFUSE_PC1                       1'b0
    4       R/W LDO_POW_EFUSE_PC2                       1'b0
    5       R/W LDO_PCUT_EHVT_VCORE                     1'b0
    6       R/W LDO_PCUT_EHVT_DVDD                      1'b1
    7       R/W LDO_PCUT_VPONSEGLCD                     1'b0
    8       R/W LDO_PCUT_VAONVDIGUSB                    1'b1
    14:9    R/W LDO_REG2X_DUMMY1                        6'b111010
    15      R/W LDO_ENPC_VPONVAON                       1'b1
    18:16   R/W LDO_EFUSE_CSET                          3'b100
    21:19   R/W LDO_EFUSE_ISET                          3'b100
    24:22   R/W LDO_EFUSE_RSET                          3'b100
    31:25   R/W LDO_EFUSE_TUNE                          7'b0111010
 */
typedef volatile union _AON_REG2X_LDO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_POW_EFUSE: 1;
        uint32_t LDO_POW_EFUSE_DL_PC1: 1;
        uint32_t LDO_POW_EFUSE_DL_PC2: 1;
        uint32_t LDO_POW_EFUSE_PC1: 1;
        uint32_t LDO_POW_EFUSE_PC2: 1;
        uint32_t LDO_PCUT_EHVT_VCORE: 1;
        uint32_t LDO_PCUT_EHVT_DVDD: 1;
        uint32_t LDO_PCUT_VPONSEGLCD: 1;
        uint32_t LDO_PCUT_VAONVDIGUSB: 1;
        uint32_t LDO_REG2X_DUMMY1: 6;
        uint32_t LDO_ENPC_VPONVAON: 1;
        uint32_t LDO_EFUSE_CSET: 3;
        uint32_t LDO_EFUSE_ISET: 3;
        uint32_t LDO_EFUSE_RSET: 3;
        uint32_t LDO_EFUSE_TUNE: 7;
    };
} AON_REG2X_LDO_TYPE;

/* 0xC18    0x4000_0c18
    0       R/W LCD_REG0X_DUMMY1                        1'b0
    1       R/W LCD_EN_LCD                              1'b0
    2       R/W LCD_BIAS_SEL                            1'b0
    3       R   LCD_EN_RES_L                            1'b1
    13:4    R/W LCD_REG0X_DUMMY2                        10'b0101010101
    14      R/W CKOUT_EN_DEBUG                          1'b1
    15      R/W LCD_REG0X_DUMMY3                        1'b0
    31:16   R   RSVD                                    16'b1010101010101010
 */
typedef volatile union _AON_REG0X_LCD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LCD_REG0X_DUMMY1: 1;
        uint32_t LCD_EN_LCD: 1;
        uint32_t LCD_BIAS_SEL: 1;
        uint32_t LCD_EN_RES_L: 1;
        uint32_t LCD_REG0X_DUMMY2: 10;
        uint32_t CKOUT_EN_DEBUG: 1;
        uint32_t LCD_REG0X_DUMMY3: 1;
        uint32_t RSVD: 16;
    };
} AON_REG0X_LCD_TYPE;

/* 0xC20    0x4000_0c20
    5:0     R/W BUCK_SWRTUNE_H                          6'b011101
    6       R/W BUCK_ADD_SAW_CURRENT                    1'b1
    7       R/W BUCK_OCFB_SEL_H                         1'b0
    9:8     R/W BUCK_R3_H                               2'b01
    11:10   R/W BUCK_R2_H                               2'b01
    13:12   R/W BUCK_R1_H                               2'b01
    15:14   R/W BUCK_C3_H                               2'b01
    17:16   R/W BUCK_C2_H                               2'b01
    19:18   R/W BUCK_C1_H                               2'b01
    20      R/W BUCK_BPSSR_H                            1'b1
    21      R/W BUCK_ENSR_H                             1'b1
    22      R/W BUCK_PFM_COT_EN                         1'b0
    23      R/W BUCK_PFM_AOT_EN                         1'b1
    29:24   R/W BUCK_LDOTUNE_H                          6'b011101
    31:30   R/W BUCK_NONOVERLAP_SDZ_H                   2'b01
 */
typedef volatile union _AON_REG0X_BUCK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_SWRTUNE_H: 6;
        uint32_t BUCK_ADD_SAW_CURRENT: 1;
        uint32_t BUCK_OCFB_SEL_H: 1;
        uint32_t BUCK_R3_H: 2;
        uint32_t BUCK_R2_H: 2;
        uint32_t BUCK_R1_H: 2;
        uint32_t BUCK_C3_H: 2;
        uint32_t BUCK_C2_H: 2;
        uint32_t BUCK_C1_H: 2;
        uint32_t BUCK_BPSSR_H: 1;
        uint32_t BUCK_ENSR_H: 1;
        uint32_t BUCK_PFM_COT_EN: 1;
        uint32_t BUCK_PFM_AOT_EN: 1;
        uint32_t BUCK_LDOTUNE_H: 6;
        uint32_t BUCK_NONOVERLAP_SDZ_H: 2;
    };
} AON_REG0X_BUCK_TYPE;

/* 0xC24    0x4000_0c24
    0       R   BUCK_SS_OVER_H                          1'b1
    1       R   BUCK_SS_START_H                         1'b1
    5:2     R   BUCK_VREFPFM_H                          4'b1011
    6       R/W BUCK_IB_500N_TONCOMP_EN                 1'b1
    7       R/W BUCK_IB_500N_COTCOMP_EN                 1'b1
    11:8    R/W BUCK_PFM_ICOMP                          4'b0010
    12      R/W BUCK_ENPFMDIV_H                         1'b0
    13      R/W BUCK_PFM_IHALF                          1'b0
    14      R/W BUCK_ICOT2X                             1'b1
    15      R/W BUCK_VR_COT_SET                         1'b0
    19:16   R/W BUCK_PFM_ISCH                           4'b0010
    21:20   R/W BUCK_ClampH_VCH_SEL                     2'b01
    22      R/W BUCK_EN_WaitSampleOver                  1'b1
    23      R/W BUCK_EN_ForceOFFtoZCD                   1'b1
    24      R/W BUCK_PFM_SEL                            1'b0
    25      R/W BUCK_EN_OCPrst_sel                      1'b0
    26      R/W BUCK_EN_MinON_RAMP                      1'b1
    27      R/W BUCK_PFM_COMP_SEL                       1'b1
    28      R/W BUCK_REG3X_DUMMY1                       1'b1
    29      R/W BUCK_ENOCPPS_H                          1'b0
    31:30   R/W BUCK_ClampL_RTUNE                       2'b10
 */
typedef volatile union _AON_REG2X_BUCK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_SS_OVER_H: 1;
        uint32_t BUCK_SS_START_H: 1;
        uint32_t BUCK_VREFPFM_H: 4;
        uint32_t BUCK_IB_500N_TONCOMP_EN: 1;
        uint32_t BUCK_IB_500N_COTCOMP_EN: 1;
        uint32_t BUCK_PFM_ICOMP: 4;
        uint32_t BUCK_ENPFMDIV_H: 1;
        uint32_t BUCK_PFM_IHALF: 1;
        uint32_t BUCK_ICOT2X: 1;
        uint32_t BUCK_VR_COT_SET: 1;
        uint32_t BUCK_PFM_ISCH: 4;
        uint32_t BUCK_ClampH_VCH_SEL: 2;
        uint32_t BUCK_EN_WaitSampleOver: 1;
        uint32_t BUCK_EN_ForceOFFtoZCD: 1;
        uint32_t BUCK_PFM_SEL: 1;
        uint32_t BUCK_EN_OCPrst_sel: 1;
        uint32_t BUCK_EN_MinON_RAMP: 1;
        uint32_t BUCK_PFM_COMP_SEL: 1;
        uint32_t BUCK_REG3X_DUMMY1: 1;
        uint32_t BUCK_ENOCPPS_H: 1;
        uint32_t BUCK_ClampL_RTUNE: 2;
    };
} AON_REG2X_BUCK_TYPE;

/* 0xC28    0x4000_0c28
    3:0     R/W BUCK_SAW_FREQ                           4'b1000
    4       R/W BUCK_SAW_VALID                          1'b0
    5       R/W BUCK_SAWCTL_H                           1'b1
    6       R/W BUCK_ENOFFSAWPFM_H                      1'b1
    7       R/W BUCK_ENOFFSAWLDO_H                      1'b1
    10:8    R/W BUCK_VREFOCP_H                          3'b001
    11      R/W BUCK_OCPSEL_H                           1'b1
    13:12   R/W BUCK_OCPRES_H                           2'b10
    14      R/W BUCK_ENOCPPFM_H                         1'b1
    15      R/W BUCK_ENOCPPWM_H                         1'b1
    16      R/W BUCK_BP_MiniON_RAMPdelay                1'b0
    19:17   R/W BUCK_OFFT_H                             3'b100
    24:20   R   BUCK_VREFPWMSS_H                        5'b00000
    25      R/W BUCK_FPWMANA_H                          1'b1
    26      R/W BUCK_ENFPWMDELAY_H                      1'b1
    27      R/W BUCK_TYPE3_H                            1'b1
    29:28   R/W BUCK_FPWMCTL_H                          2'b00
    30      R/W BUCK_ENOCPMUX_H                         1'b0
    31      R/W BUCK_ENVREFSS_H                         1'b1
 */
typedef volatile union _AON_REG4X_BUCK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_SAW_FREQ: 4;
        uint32_t BUCK_SAW_VALID: 1;
        uint32_t BUCK_SAWCTL_H: 1;
        uint32_t BUCK_ENOFFSAWPFM_H: 1;
        uint32_t BUCK_ENOFFSAWLDO_H: 1;
        uint32_t BUCK_VREFOCP_H: 3;
        uint32_t BUCK_OCPSEL_H: 1;
        uint32_t BUCK_OCPRES_H: 2;
        uint32_t BUCK_ENOCPPFM_H: 1;
        uint32_t BUCK_ENOCPPWM_H: 1;
        uint32_t BUCK_BP_MiniON_RAMPdelay: 1;
        uint32_t BUCK_OFFT_H: 3;
        uint32_t BUCK_VREFPWMSS_H: 5;
        uint32_t BUCK_FPWMANA_H: 1;
        uint32_t BUCK_ENFPWMDELAY_H: 1;
        uint32_t BUCK_TYPE3_H: 1;
        uint32_t BUCK_FPWMCTL_H: 2;
        uint32_t BUCK_ENOCPMUX_H: 1;
        uint32_t BUCK_ENVREFSS_H: 1;
    };
} AON_REG4X_BUCK_TYPE;

/* 0xC2C    0x4000_0c2c
    0       R/W BUCK_EN_MinON                           1'b1
    1       R/W BUCK_ENOCPS                             1'b1
    7:2     R   BUCK_CCOT_H                             6'b001000
    8       R/W BUCK_POW_CLAMP_H                        1'b0
    9       R/W BUCK_POW_EA_Initial                     1'b1
    10      R/W BUCK_ENLDO15_LXFB                       1'b0
    13:11   R/W BUCK_VREFPWM_H                          3'b011
    14      R/W BUCK_PMOS_DRIL_H                        1'b1
    15      R/W BUCK_PMOS_DRIH_H                        1'b1
    16      R/W BUCK_ZCD_NIZCD_SEL                      1'b0
    17      R/W BUCK_ZCD_NI_delay_SEL                   1'b0
    18      R/W BUCK_ZCD_NI_SEL                         1'b0
    19      R/W BUCK_OCPrst_ext                         1'b0
    20      R/W BUCK_LDO_OCP_ENB                        1'b0
    21      R/W BUCK_CK_PWM_SEL                         1'b0
    22      R/W BUCK_EN_R1OFF_H                         1'b0
    23      R/W BUCK_POW_EA_IqEhance_H                  1'b0
    24      R/W BUCK_POW_EA_Iqx3_H                      1'b0
    25      R/W BUCK_POW_EA_Iqx2_H                      1'b0
    26      R/W BUCK_EN_PDMC_H                          1'b0
    27      R/W BUCK_EN_IMIRROR_IPTAT_Gating            1'b0
    28      R/W BUCK_FPWM_H                             1'b0
    29      R/W BUCK_ENLDO_H                            1'b0
    30      R/W BUCK_ENSWR_H                            1'b0
    31      R/W BUCK_ENBIAS_H                           1'b0
 */
typedef volatile union _AON_REG6X_BUCK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_EN_MinON: 1;
        uint32_t BUCK_ENOCPS: 1;
        uint32_t BUCK_CCOT_H: 6;
        uint32_t BUCK_POW_CLAMP_H: 1;
        uint32_t BUCK_POW_EA_Initial: 1;
        uint32_t BUCK_ENLDO15_LXFB: 1;
        uint32_t BUCK_VREFPWM_H: 3;
        uint32_t BUCK_PMOS_DRIL_H: 1;
        uint32_t BUCK_PMOS_DRIH_H: 1;
        uint32_t BUCK_ZCD_NIZCD_SEL: 1;
        uint32_t BUCK_ZCD_NI_delay_SEL: 1;
        uint32_t BUCK_ZCD_NI_SEL: 1;
        uint32_t BUCK_OCPrst_ext: 1;
        uint32_t BUCK_LDO_OCP_ENB: 1;
        uint32_t BUCK_CK_PWM_SEL: 1;
        uint32_t BUCK_EN_R1OFF_H: 1;
        uint32_t BUCK_POW_EA_IqEhance_H: 1;
        uint32_t BUCK_POW_EA_Iqx3_H: 1;
        uint32_t BUCK_POW_EA_Iqx2_H: 1;
        uint32_t BUCK_EN_PDMC_H: 1;
        uint32_t BUCK_EN_IMIRROR_IPTAT_Gating: 1;
        uint32_t BUCK_FPWM_H: 1;
        uint32_t BUCK_ENLDO_H: 1;
        uint32_t BUCK_ENSWR_H: 1;
        uint32_t BUCK_ENBIAS_H: 1;
    };
} AON_REG6X_BUCK_TYPE;

/* 0xC30    0x4000_0c30
    6:0     R/W BUCK_ZCDOFFSET                          7'b0110000
    7       R/W BUCK_EN_OCP_IBON                        1'b1
    8       R/W BUCK_PFM_COMP_AFTER_OCP                 1'b0
    9       R/W BUCK_TON_PS_HV                          1'b0
    11:10   R/W BUCK_IBSEL_TONCOMP                      2'b01
    13:12   R/W BUCK_MinONtime_sel                      2'b01
    15:14   R/W BUCK_ZCD_LOWIQ_LOGIC_TUNE_STICKY        2'b10
    16      R   BUCK_32K_CLK_IN                         1'b0
    17      R/W BUCK_POW_LowIq_ZCD                      1'b0
    18      R/W BUCK_STICKY_CODE                        1'b0
    19      R/W BUCK_FORCE_CODE                         1'b0
    20      R/W BUCK_POW_ClampLX                        1'b1
    21      R/W BUCK_POW_ZCD                            1'b0
    23:22   R/W BUCK_ZCD_LOWIQ_LOGIC_TUNE_WAIT          2'b00
    25:24   R/W BUCK_ZCD_SDZ2d                          2'b10
    28:26   R/W BUCK_ZCD_SDZ2                           3'b100
    30:29   R/W BUCK_ZCD_SDZ1                           2'b10
    31      R/W BUCK_SEL_ZCD_LowIQ                      1'b0
 */
typedef volatile union _AON_REG8X_BUCK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_ZCDOFFSET: 7;
        uint32_t BUCK_EN_OCP_IBON: 1;
        uint32_t BUCK_PFM_COMP_AFTER_OCP: 1;
        uint32_t BUCK_TON_PS_HV: 1;
        uint32_t BUCK_IBSEL_TONCOMP: 2;
        uint32_t BUCK_MinONtime_sel: 2;
        uint32_t BUCK_ZCD_LOWIQ_LOGIC_TUNE_STICKY: 2;
        uint32_t BUCK_32K_CLK_IN: 1;
        uint32_t BUCK_POW_LowIq_ZCD: 1;
        uint32_t BUCK_STICKY_CODE: 1;
        uint32_t BUCK_FORCE_CODE: 1;
        uint32_t BUCK_POW_ClampLX: 1;
        uint32_t BUCK_POW_ZCD: 1;
        uint32_t BUCK_ZCD_LOWIQ_LOGIC_TUNE_WAIT: 2;
        uint32_t BUCK_ZCD_SDZ2d: 2;
        uint32_t BUCK_ZCD_SDZ2: 3;
        uint32_t BUCK_ZCD_SDZ1: 2;
        uint32_t BUCK_SEL_ZCD_LowIQ: 1;
    };
} AON_REG8X_BUCK_TYPE;

/* 0xC34    0x4000_0c34
    0       R   BUCK_VREFSS_OVER_H                      1'b0
    1       R   BUCK_LX_DET                             1'b0
    2       R   BUCK_SampleOver                         1'b0
    3       R   BUCK_LowIQ_ZCD                          1'b0
    4       R   BUCK_UPDATE_CK                          1'b0
    5       R   BUCK_UD_H                               1'b0
    6       R   BUCK_PFM_RESET                          1'b0
    7       R   BUCK_PI                                 1'b0
    8       R   BUCK_NI                                 1'b0
    9       R   BUCK_OCP_H                              1'b0
    10      R   BUCK_CK_CTRL                            1'b0
    11      R   BUCK_FPWM_H                             1'b0
    12      R   BUCK_NGATE_HV                           1'b0
    13      R   BUCK_PFM_COMP                           1'b0
    14      R   BUCK_ZCD                                1'b0
    15      R   BUCK_PFM_CTRL_FORDIG                    1'b0
    16      R   AGND33_HG_APAD                          1'b0
    17      R   AGND33_HG_APAD                          1'b0
    18      R   AGND33_HG_APAD                          1'b0
    19      R   AGND33_HG_APAD                          1'b0
    20      R   AGND33_HG_APAD                          1'b0
    21      R   AGND33_HG_APAD                          1'b0
    22      R   ZCDQ<0>                                 1'b0
    23      R   ZCDQ<1>                                 1'b0
    24      R   ZCDQ<2>                                 1'b0
    25      R   ZCDQ<3>                                 1'b0
    26      R   ZCDQ<4>                                 1'b0
    27      R   ZCDQ<5>                                 1'b0
    28      R   ZCDQ<6>                                 1'b0
    29      R   BUCK_CKSS                               1'b0
    30      R   BUCK_PORB33V_H                          1'b0
    31      R   BUCK_VREFSS_START_H                     1'b0
 */
typedef volatile union _AON_C_KOUT0X_BUCK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_VREFSS_OVER_H: 1;
        uint32_t BUCK_LX_DET: 1;
        uint32_t BUCK_SampleOver: 1;
        uint32_t BUCK_LowIQ_ZCD: 1;
        uint32_t BUCK_UPDATE_CK: 1;
        uint32_t BUCK_UD_H: 1;
        uint32_t BUCK_PFM_RESET: 1;
        uint32_t BUCK_PI: 1;
        uint32_t BUCK_NI: 1;
        uint32_t BUCK_OCP_H: 1;
        uint32_t BUCK_CK_CTRL: 1;
        uint32_t BUCK_FPWM_H: 1;
        uint32_t BUCK_NGATE_HV: 1;
        uint32_t BUCK_PFM_COMP: 1;
        uint32_t BUCK_ZCD: 1;
        uint32_t BUCK_PFM_CTRL_FORDIG: 1;
        uint32_t AGND33_HG_APAD_5: 1;
        uint32_t AGND33_HG_APAD_4: 1;
        uint32_t AGND33_HG_APAD_3: 1;
        uint32_t AGND33_HG_APAD_2: 1;
        uint32_t AGND33_HG_APAD_1: 1;
        uint32_t AGND33_HG_APAD: 1;
        uint32_t ZCDQ_0: 1;
        uint32_t ZCDQ_1: 1;
        uint32_t ZCDQ_2: 1;
        uint32_t ZCDQ_3: 1;
        uint32_t ZCDQ_4: 1;
        uint32_t ZCDQ_5: 1;
        uint32_t ZCDQ_6: 1;
        uint32_t BUCK_CKSS: 1;
        uint32_t BUCK_PORB33V_H: 1;
        uint32_t BUCK_VREFSS_START_H: 1;
    };
} AON_C_KOUT0X_BUCK_TYPE;

