rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0xC80    0x4000_0c80
    1:0     R/W XTAL32K_CUR_MAIN                        2'b01
    5:2     R/W XTAL32K_CUR_GM_INI                      4'b1001
    9:6     R/W XTAL32K_CUR_GM                          4'b0101
    11:10   R/W XTAL32K_CUR_REP                         2'b01
    15:12   R/W XTAL32K_GM                              4'b1111
    16      R/W EN_XTAL32K_CAP_INITIAL                  1'b1
    17      R/W EN_XTAL32K_CAP_AWAKE                    1'b1
    23:18   R/W XTAL32K_SC_XI                           6'b100000
    29:24   R/W XTAL32K_SC_XO                           6'b100000
    31:30   R/W XTAL32K_TOK                             2'b11
 */
typedef volatile union _AON_REG0X_32KXTAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL32K_CUR_MAIN: 2;
        uint32_t XTAL32K_CUR_GM_INI: 4;
        uint32_t XTAL32K_CUR_GM: 4;
        uint32_t XTAL32K_CUR_REP: 2;
        uint32_t XTAL32K_GM: 4;
        uint32_t EN_XTAL32K_CAP_INITIAL: 1;
        uint32_t EN_XTAL32K_CAP_AWAKE: 1;
        uint32_t XTAL32K_SC_XI: 6;
        uint32_t XTAL32K_SC_XO: 6;
        uint32_t XTAL32K_TOK: 2;
    };
} AON_REG0X_32KXTAL_TYPE;

/* 0xC84    0x4000_0c84
    0       R/W ENB_XTAL32K_FBRES                       1'b0
    3:1     R/W XTAL32K_GM_REP                          3'b111
    4       R/W XTAL32K_SC_XI_EXTRA                     1'b0
    5       R/W XTAL32K_SC_XO_EXTRA                     1'b0
    6       R/W XTAL32K_GPIO_SEL                        1'b1
    7       R/W REG2X_32KXTAL_DUMMY                     1'b0
    15:8    R/W RSVD                                    8'b0
    31:16   R/W RSVD                                    16'b0
 */
typedef volatile union _AON_REG2X_32KXTAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENB_XTAL32K_FBRES: 1;
        uint32_t XTAL32K_GM_REP: 3;
        uint32_t XTAL32K_SC_XI_EXTRA: 1;
        uint32_t XTAL32K_SC_XO_EXTRA: 1;
        uint32_t XTAL32K_GPIO_SEL: 1;
        uint32_t REG2X_32KXTAL_DUMMY: 1;
        uint32_t RSVD_1: 8;
        uint32_t RSVD: 16;
    };
} AON_REG2X_32KXTAL_TYPE;

/* 0xC88    0x4000_0c88
    5:0     R/W RCAL                                    6'b100000
    14:6    R/W REG0X_32KOSC_DUMMY                      9'b0
    15      R/W SEL_LDO_VREF                            1'b0
    31:16   R/W RSVD                                    16'b0
 */
typedef volatile union _AON_REG0X_32KOSC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RCAL: 6;
        uint32_t REG0X_32KOSC_DUMMY: 9;
        uint32_t SEL_LDO_VREF: 1;
        uint32_t RSVD: 16;
    };
} AON_REG0X_32KOSC_TYPE;

/* 0xC8C    0x4000_0c8c
    0       R/W POW_32KOSC                              1'b1
    1       R/W POW_32KXTAL                             1'b1
    2       R   OSC32K_OK                               1'b1
    3       R   XTAL32K_OK                              1'b0
    31:4    R/W RSVD                                    28'b0
 */
typedef volatile union _AON_REG_POW_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t POW_32KOSC: 1;
        uint32_t POW_32KXTAL: 1;
        uint32_t OSC32K_OK: 1;
        uint32_t XTAL32K_OK: 1;
        uint32_t RSVD: 28;
    };
} AON_REG_POW_TYPE;

/* 0xC90    0x4000_0c90
    0       R/W POW_40MOSC                              1'b0
    4:1     R/W FSET_40MOSC                             4'b1000
    15:5    R/W REG0X_40MOSC_DUMMY                      11'b0
    31:16   R   RSVD                                    16'b0
 */
typedef volatile union _AON_REG0X_40MOSC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t POW_40MOSC: 1;
        uint32_t FSET_40MOSC: 4;
        uint32_t REG0X_40MOSC_DUMMY: 11;
        uint32_t RSVD: 16;
    };
} AON_REG0X_40MOSC_TYPE;

/* 0xC94    0x4000_0c94
    0       R/W RCAL_32K_SEL                            1'b0
    31:1    R/W RSVD                                    31'b0
 */
typedef volatile union _AON_REG0X_RCAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RCAL_32K_SEL: 1;
        uint32_t RSVD: 31;
    };
} AON_REG0X_RCAL_TYPE;

/* 0xCA0    0x4000_0ca0
    2:0     R   AON2PON_XTAL_MODE                       3'b100
    3       R/W XTAL_DEBUG                              1'b0
    6:4     R/W XTAL_MODE_DEBUG                         3'b100
    7       R   AON2PON_ISO_XTAL_MODE_CTRL              1'b1
    8       R/W XTAL_MODE_NMPC                          1'b0
    9       R   AON2PON_POW_XTAL                        1'b0
    15:10   R/W XTAL_MODE_DUMMY0                        6'b0
    31:16   R/W XTAL_MODE_DUMMY1                        16'b0
 */
typedef volatile union _AON_BT_ANAPAR_XTAL_mode_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON2PON_XTAL_MODE: 3;
        uint32_t XTAL_DEBUG: 1;
        uint32_t XTAL_MODE_DEBUG: 3;
        uint32_t AON2PON_ISO_XTAL_MODE_CTRL: 1;
        uint32_t XTAL_MODE_NMPC: 1;
        uint32_t AON2PON_POW_XTAL: 1;
        uint32_t XTAL_MODE_DUMMY0: 6;
        uint32_t XTAL_MODE_DUMMY1: 16;
    };
} AON_BT_ANAPAR_XTAL_mode_TYPE;

/* 0xCA4    0x4000_0ca4
    0       R/W XTAL_EN_XTAL_AAC_GM                     1'b0
    1       R/W XTAL_EN_XTAL_AAC_PKDET                  1'b0
    2       R/W XTAL_EN_XTAL_LPS                        1'b0
    3       R/W XTAL_GATED_XTAL_OK0                     1'b0
    6:4     R/W XTAL_AAC_PK_SEL                         3'b101
    10:7    R/W XTAL_AAC_PK_LP_SEL                      4'b0101
    15:11   R/W XTAL_BUF_GMN                            5'b01000
    20:16   R/W XTAL_BUF_GMN_LP                         5'b01000
    25:21   R/W XTAL_BUF_GMP                            5'b01000
    30:26   R/W XTAL_BUF_GMP_LP                         5'b01000
    31      R/W XTAL_BK_BG                              1'b0
 */
typedef volatile union _AON_BT_ANAPAR_XTAL0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_EN_XTAL_AAC_GM: 1;
        uint32_t XTAL_EN_XTAL_AAC_PKDET: 1;
        uint32_t XTAL_EN_XTAL_LPS: 1;
        uint32_t XTAL_GATED_XTAL_OK0: 1;
        uint32_t XTAL_AAC_PK_SEL: 3;
        uint32_t XTAL_AAC_PK_LP_SEL: 4;
        uint32_t XTAL_BUF_GMN: 5;
        uint32_t XTAL_BUF_GMN_LP: 5;
        uint32_t XTAL_BUF_GMP: 5;
        uint32_t XTAL_BUF_GMP_LP: 5;
        uint32_t XTAL_BK_BG: 1;
    };
} AON_BT_ANAPAR_XTAL0_TYPE;

/* 0xCA8    0x4000_0ca8
    0       R/W XTAL_DELAY_AFE                          1'b0
    1       R/W XTAL_DELAY_USB                          1'b0
    2       R/W XTAL_DOUBLE_OP_I                        1'b0
    4:3     R/W XTAL_DRV_AFE                            2'b11
    6:5     R/W XTAL_DRV_USB                            2'b11
    8:7     R/W XTAL_DRV_RF                             2'b11
    9       R/W XTAL_DRV_RF_LATCH                       1'b0
    10      R/W XTAL_GATED_AFEP                         1'b0
    11      R/W XTAL_GATED_AFEN                         1'b0
    12      R/W XTAL_GATED_USBP                         1'b0
    13      R/W XTAL_GATED_USBN                         1'b0
    14      R/W XTAL_GATED_RFP                          1'b0
    15      R/W XTAL_GATED_RFN                          1'b0
    21:16   R/W XTAL_GM                                 6'b111111
    27:22   R/W XTAL_GM_LP                              6'b111111
    28      R/W XTAL_GM_SEP                             1'b0
    29      R/W XTAL_IDOUBLE                            1'b0
    30      R/W XTAL_IS_FINE_MANU                       1'b0
    31      R/W XTAL_SW_LDO2PWRCUT                      1'b0
 */
typedef volatile union _AON_BT_ANAPAR_XTAL2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_DELAY_AFE: 1;
        uint32_t XTAL_DELAY_USB: 1;
        uint32_t XTAL_DOUBLE_OP_I: 1;
        uint32_t XTAL_DRV_AFE: 2;
        uint32_t XTAL_DRV_USB: 2;
        uint32_t XTAL_DRV_RF: 2;
        uint32_t XTAL_DRV_RF_LATCH: 1;
        uint32_t XTAL_GATED_AFEP: 1;
        uint32_t XTAL_GATED_AFEN: 1;
        uint32_t XTAL_GATED_USBP: 1;
        uint32_t XTAL_GATED_USBN: 1;
        uint32_t XTAL_GATED_RFP: 1;
        uint32_t XTAL_GATED_RFN: 1;
        uint32_t XTAL_GM: 6;
        uint32_t XTAL_GM_LP: 6;
        uint32_t XTAL_GM_SEP: 1;
        uint32_t XTAL_IDOUBLE: 1;
        uint32_t XTAL_IS_FINE_MANU: 1;
        uint32_t XTAL_SW_LDO2PWRCUT: 1;
    };
} AON_BT_ANAPAR_XTAL2_TYPE;

/* 0xCAC    0x4000_0cac
    5:0     R/W XTAL_GM_OK0                             6'b111111
    11:6    R/W XTAL_IS                                 6'b111111
    13:12   R/W XTAL_DRV_DIGI_LP                        2'b11
    14      R/W XTAL_GDIGI_LP                           1'b0
    15      R/W XTAL_REG4X_DUMMY1                       1'b0
    23:16   R/W XTAL_IS_FINE                            8'b11111111
    29:24   R/W XTAL_IS_LP                              6'b000000
    31:30   R/W XTAL_PKDET_LP_TSEL                      2'b01
 */
typedef volatile union _AON_BT_ANAPAR_XTAL4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_GM_OK0: 6;
        uint32_t XTAL_IS: 6;
        uint32_t XTAL_DRV_DIGI_LP: 2;
        uint32_t XTAL_GDIGI_LP: 1;
        uint32_t XTAL_REG4X_DUMMY1: 1;
        uint32_t XTAL_IS_FINE: 8;
        uint32_t XTAL_IS_LP: 6;
        uint32_t XTAL_PKDET_LP_TSEL: 2;
    };
} AON_BT_ANAPAR_XTAL4_TYPE;

