rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0xD88    0x4000_0d88
    2:0     R/W reg_rs_set<2:0>                         3'b100
    5:3     R/W reg_r3_set<2:0>                         3'b010
    7:6     R/W reg_cs_set<1:0>                         2'b10
    9:8     R/W reg_cp_set<1:0>                         2'b10
    11:10   R/W reg_c3_set<1:0>                         2'b10
    14:12   R/W reg_cp_bia<2:0>                         3'b000
    15      R/W ref_lpf_en                              1'b1
    16      R/W pow_erc                                 1'b0
    23:17   R/W DIV_SDM<6:0>                            7'b0011100
    24      R/W CP_DISABLE                              1'b0
    26:25   R/W reg_xtal_dn_sel<1:0>                    2'b11
    27      R/W reg_ck_ext_sel                          1'b1
    28      R/W pow_div                                 1'b0
    29      R/W reg_dogenb                              1'b0
    30      R/W ref_fref_edge                           1'b0
    31      R/W pow_pll2                                1'b0
 */
typedef volatile union _AON_REG0X_PLL2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t reg_rs_set_2_0: 3;
        uint32_t reg_r3_set_2_0: 3;
        uint32_t reg_cs_set_1_0: 2;
        uint32_t reg_cp_set_1_0: 2;
        uint32_t reg_c3_set_1_0: 2;
        uint32_t reg_cp_bia_2_0: 3;
        uint32_t ref_lpf_en: 1;
        uint32_t pow_erc: 1;
        uint32_t DIV_SDM_6_0: 7;
        uint32_t CP_DISABLE: 1;
        uint32_t reg_xtal_dn_sel_1_0: 2;
        uint32_t reg_ck_ext_sel: 1;
        uint32_t pow_div: 1;
        uint32_t reg_dogenb: 1;
        uint32_t ref_fref_edge: 1;
        uint32_t pow_pll2: 1;
    };
} AON_REG0X_PLL2_TYPE;

/* 0xD8C    0x4000_0d8c
    15:0    R/W FOF_SDM_15_0_                           16'b0
    20:16   R/W FOF_SDM_20_16_                          5'b0
    23:21   R/W FON_SDM<2:0>                            3'b000
    24      R/W ORDER_SDM                               1'b0
    28:25   R/W BB_DBG_SEL_AFE_SDM<3:0>                 4'b0000
    29      R/W NF_COFE_SYNC_EN                         1'b0
    30      R/W NF_CODE_LOAD                            1'b0
    31      R/W REG2X_PLL2_dummy                        1'b0
 */
typedef volatile union _AON_REG2X_PLL2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FOF_SDM_15_0_: 16;
        uint32_t FOF_SDM_20_16_: 5;
        uint32_t FON_SDM_2_0: 3;
        uint32_t ORDER_SDM: 1;
        uint32_t BB_DBG_SEL_AFE_SDM_3_0: 4;
        uint32_t NF_COFE_SYNC_EN: 1;
        uint32_t NF_CODE_LOAD: 1;
        uint32_t REG2X_PLL2_dummy: 1;
    };
} AON_REG2X_PLL2_TYPE;

/* 0xD90    0x4000_0d90
    15:0    R   RSVD                                    16'b0
    28:16   R/W REG4X_PLL2_dummy                        13'b0
    29      R/W reg_CKO1_sel                            1'b0
    30      R/W reg_CKO1_d2                             1'b0
    31      R/W reg_CKO1_en                             1'b0
 */
typedef volatile union _AON_REG4X_PLL2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD: 16;
        uint32_t REG4X_PLL2_dummy: 13;
        uint32_t reg_CKO1_sel: 1;
        uint32_t reg_CKO1_d2: 1;
        uint32_t reg_CKO1_en: 1;
    };
} AON_REG4X_PLL2_TYPE;

/* 0xD94    0x4000_0d94
    0       R   BT_READY_PLL                            1'b0
    1       R   BT_READY_PLL2                           1'b0
    31:2    R/W RSVD                                    30'b0
 */
typedef volatile union _AON_RO_PLL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BT_READY_PLL: 1;
        uint32_t BT_READY_PLL2: 1;
        uint32_t RSVD: 30;
    };
} AON_RO_PLL_TYPE;

/* 0x1800   0x4000_1800
    0       R/W RTC_CNT_START                   1'b0
    1       R/W RTC_CNT_RST                     1'b0
    2       R/W RTC_PRE_CNT_RST                 1'b0
    7:3     R/W RTC_CR0_DUMMY0                  5'b0
    8       R/W RTC_TICK_IE                     1'b0
    9       R/W RTC_CNT_OV_IE                   1'b0
    10      R/W RTC_PRECMP_IE                   1'b0
    11      R/W RTC_PRECMP_CMP3_IE              1'b0
    12      R/W RTC_CMP0GT_IE                   1'b0
    13      R/W RTC_CMP1GT_IE                   1'b0
    14      R/W RTC_CMP2GT_IE                   1'b0
    15      R/W RTC_CMP3GT_IE                   1'b0
    16      R/W RTC_CMP0_NV_IE                  1'b0
    17      R/W RTC_CMP1_NV_IE                  1'b0
    18      R/W RTC_CMP2_NV_IE                  1'b0
    19      R/W RTC_CMP3_NV_IE                  1'b0
    20      R/W RTC_CMP0_WK_IE                  1'b0
    21      R/W RTC_CMP1_WK_IE                  1'b0
    22      R/W RTC_CMP2_WK_IE                  1'b0
    23      R/W RTC_CMP3_WK_IE                  1'b0
    28:24   R/W RTC_CR0_DUMMY1                  5'b0
    29      R/W RTC_WK_IE                       1'b0
    30      R/W RTC_NV_IE                       1'b0
    31      R/W RTC_RST                         1'b0
 */
typedef volatile union _AON_NS_RTC_CR0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CNT_START: 1;
        uint32_t RTC_CNT_RST: 1;
        uint32_t RTC_PRE_CNT_RST: 1;
        uint32_t RTC_CR0_DUMMY0: 5;
        uint32_t RTC_TICK_IE: 1;
        uint32_t RTC_CNT_OV_IE: 1;
        uint32_t RTC_PRECMP_IE: 1;
        uint32_t RTC_PRECMP_CMP3_IE: 1;
        uint32_t RTC_CMP0GT_IE: 1;
        uint32_t RTC_CMP1GT_IE: 1;
        uint32_t RTC_CMP2GT_IE: 1;
        uint32_t RTC_CMP3GT_IE: 1;
        uint32_t RTC_CMP0_NV_IE: 1;
        uint32_t RTC_CMP1_NV_IE: 1;
        uint32_t RTC_CMP2_NV_IE: 1;
        uint32_t RTC_CMP3_NV_IE: 1;
        uint32_t RTC_CMP0_WK_IE: 1;
        uint32_t RTC_CMP1_WK_IE: 1;
        uint32_t RTC_CMP2_WK_IE: 1;
        uint32_t RTC_CMP3_WK_IE: 1;
        uint32_t RTC_CR0_DUMMY1: 5;
        uint32_t RTC_WK_IE: 1;
        uint32_t RTC_NV_IE: 1;
        uint32_t RTC_RST: 1;
    };
} AON_NS_RTC_CR0_TYPE;

/* 0x1804   0x4000_1804
    0       R/WACRTC_TICK_CLR                    1'b0
    1       R/WACRTC_CNT_OV_CLR                  1'b0
    2       R/WACRTC_PRECMP_CLR                  1'b0
    3       R/WACRTC_PRECMP_CMP3_CLR             1'b0
    4       R/WACRTC_CMP0GT_CLR                  1'b0
    5       R/WACRTC_CMP1GT_CLR                  1'b0
    6       R/WACRTC_CMP2GT_CLR                  1'b0
    7       R/WACRTC_CMP3GT_CLR                  1'b0
    8       R/WACRTC_CMP0_NV_CLR                 1'b0
    9       R/WACRTC_CMP1_NV_CLR                 1'b0
    10      R/WACRTC_CMP2_NV_CLR                 1'b0
    11      R/WACRTC_CMP3_NV_CLR                 1'b0
    12      R/WACRTC_CMP0_WK_CLR                 1'b0
    13      R/WACRTC_CMP1_WK_CLR                 1'b0
    14      R/WACRTC_CMP2_WK_CLR                 1'b0
    15      R/WACRTC_CMP3_WK_CLR                 1'b0
    31:16   R/W RTC_INT_clear_DUMMY             16'b0
 */
typedef volatile union _AON_NS_RTC_INT_clear_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_TICK_CLR: 1;
        uint32_t RTC_CNT_OV_CLR: 1;
        uint32_t RTC_PRECMP_CLR: 1;
        uint32_t RTC_PRECMP_CMP3_CLR: 1;
        uint32_t RTC_CMP0GT_CLR: 1;
        uint32_t RTC_CMP1GT_CLR: 1;
        uint32_t RTC_CMP2GT_CLR: 1;
        uint32_t RTC_CMP3GT_CLR: 1;
        uint32_t RTC_CMP0_NV_CLR: 1;
        uint32_t RTC_CMP1_NV_CLR: 1;
        uint32_t RTC_CMP2_NV_CLR: 1;
        uint32_t RTC_CMP3_NV_CLR: 1;
        uint32_t RTC_CMP0_WK_CLR: 1;
        uint32_t RTC_CMP1_WK_CLR: 1;
        uint32_t RTC_CMP2_WK_CLR: 1;
        uint32_t RTC_CMP3_WK_CLR: 1;
        uint32_t RTC_INT_clear_DUMMY: 16;
    };
} AON_NS_RTC_INT_clear_TYPE;

/* 0x1808   0x4000_1808
    0       R/W1CRTC_TICK_SR                     1'b0
    1       R/W1CRTC_CNT_OV_SR                   1'b0
    2       R/W1CRTC_PRECMP_SR                   1'b0
    3       R/W1CRTC_PRECMP_CMP3_SR              1'b0
    4       R/W1CRTC_CMP0GT_SR                   1'b0
    5       R/W1CRTC_CMP1GT_SR                   1'b0
    6       R/W1CRTC_CMP2GT_SR                   1'b0
    7       R/W1CRTC_CMP3GT_SR                   1'b0
    8       R/W1CRTC_CMP0_NV_SR                  1'b0
    9       R/W1CRTC_CMP1_NV_SR                  1'b0
    10      R/W1CRTC_CMP2_NV_SR                  1'b0
    11      R/W1CRTC_CMP3_NV_SR                  1'b0
    12      R/W1CRTC_CMP0_WK_SR                  1'b0
    13      R/W1CRTC_CMP1_WK_SR                  1'b0
    14      R/W1CRTC_CMP2_WK_SR                  1'b0
    15      R/W1CRTC_CMP3_WK_SR                  1'b0
    31:16   R/W RTC_INT_SR_DUMMY                16'b0
 */
typedef volatile union _AON_NS_RTC_INT_SR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_TICK_SR: 1;
        uint32_t RTC_CNT_OV_SR: 1;
        uint32_t RTC_PRECMP_SR: 1;
        uint32_t RTC_PRECMP_CMP3_SR: 1;
        uint32_t RTC_CMP0GT_SR: 1;
        uint32_t RTC_CMP1GT_SR: 1;
        uint32_t RTC_CMP2GT_SR: 1;
        uint32_t RTC_CMP3GT_SR: 1;
        uint32_t RTC_CMP0_NV_SR: 1;
        uint32_t RTC_CMP1_NV_SR: 1;
        uint32_t RTC_CMP2_NV_SR: 1;
        uint32_t RTC_CMP3_NV_SR: 1;
        uint32_t RTC_CMP0_WK_SR: 1;
        uint32_t RTC_CMP1_WK_SR: 1;
        uint32_t RTC_CMP2_WK_SR: 1;
        uint32_t RTC_CMP3_WK_SR: 1;
        uint32_t RTC_INT_SR_DUMMY: 16;
    };
} AON_NS_RTC_INT_SR_TYPE;

/* 0x180C   0x4000_180c
    11:0    R/W RTC_PRESCALER                   12'b0
    31:12   R/W RTC_PRESCALER_DUMMY             20'b0
 */
typedef volatile union _AON_NS_RTC_PRESCALER0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PRESCALER: 12;
        uint32_t RTC_PRESCALER_DUMMY: 20;
    };
} AON_NS_RTC_PRESCALER0_TYPE;

