rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x1810   0x4000_1810
    31:0    R/W RTC_CMP0                        32'b0
 */
typedef volatile union _AON_NS_RTC_COMP_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP0;
    };
} AON_NS_RTC_COMP_0_TYPE;

/* 0x1814   0x4000_1814
    31:0    R/W RTC_CMP1                        32'b0
 */
typedef volatile union _AON_NS_RTC_COMP_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP1;
    };
} AON_NS_RTC_COMP_1_TYPE;

/* 0x1818   0x4000_1818
    31:0    R/W RTC_CMP2                        32'b0
 */
typedef volatile union _AON_NS_RTC_COMP_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP2;
    };
} AON_NS_RTC_COMP_2_TYPE;

/* 0x181C   0x4000_181c
    31:0    R/W RTC_CMP3                        32'b0
 */
typedef volatile union _AON_NS_RTC_COMP_3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP3;
    };
} AON_NS_RTC_COMP_3_TYPE;

/* 0x1820   0x4000_1820
    31:0    R/W RTC_CMP0GT                      32'b0
 */
typedef volatile union _AON_NS_RTC_COMP0_GT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP0GT;
    };
} AON_NS_RTC_COMP0_GT_TYPE;

/* 0x1824   0x4000_1824
    31:0    R/W RTC_CMP1GT                      32'b0
 */
typedef volatile union _AON_NS_RTC_COMP1_GT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP1GT;
    };
} AON_NS_RTC_COMP1_GT_TYPE;

/* 0x1828   0x4000_1828
    31:0    R/W RTC_CMP2GT                      32'b0
 */
typedef volatile union _AON_NS_RTC_COMP2_GT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP2GT;
    };
} AON_NS_RTC_COMP2_GT_TYPE;

/* 0x182C   0x4000_182c
    31:0    R/W RTC_CMP3GT                      32'b0
 */
typedef volatile union _AON_NS_RTC_COMP3_GT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP3GT;
    };
} AON_NS_RTC_COMP3_GT_TYPE;

/* 0x1830   0x4000_1830
    31:0    R   RTC_CNT                         32'b0
 */
typedef volatile union _AON_NS_RTC_CNT0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CNT;
    };
} AON_NS_RTC_CNT0_TYPE;

/* 0x1834   0x4000_1834
    11:0    R   RTC_PRESCALE_CNT                12'b0
    31:12   R/W RTC_PRESCALE_CNT_DUMMY          20'b0
 */
typedef volatile union _AON_NS_RTC_PRESCALE_CNT0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PRESCALE_CNT: 12;
        uint32_t RTC_PRESCALE_CNT_DUMMY: 20;
    };
} AON_NS_RTC_PRESCALE_CNT0_TYPE;

/* 0x1838   0x4000_1838
    11:0    R/W RTC_PRESCALE_CMP                12'b0
    31:12   R/W RTC_PRESCALE_CMP_DUMMY          20'b0
 */
typedef volatile union _AON_NS_RTC_PRESCALE_CMP0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PRESCALE_CMP: 12;
        uint32_t RTC_PRESCALE_CMP_DUMMY: 20;
    };
} AON_NS_RTC_PRESCALE_CMP0_TYPE;

/* 0x183C   0x4000_183c
    31:0    R/W RTC_BACKUP                      32'b0
 */
typedef volatile union _AON_NS_RTC_BACKUP_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_BACKUP;
    };
} AON_NS_RTC_BACKUP_REG_TYPE;

/* 0x1840   0x4000_1840
    31:0    R   RTC_RTL_VERSION                 32'h2112180A
 */
typedef volatile union _AON_NS_RTC_RTL_VERSION0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_RTL_VERSION;
    };
} AON_NS_RTC_RTL_VERSION0_TYPE;

/* 0x1850   0x4000_1850
    7:0     R/W reg_lpcomp0_deb_cnt             8'b0
    10:8    R/W reg_lpcomp0_deb_div             3'b0
    11      R/W reg_lpcomp0_deb_en              1'b0
    12      R/W RSVD                            1'b0
    13      R/W reg_lpcomp0_single_output_en    1'b0
    14      R/W RSVD                            1'b0
    15      R/W RSVD                            1'b0
    16      R/W reg_lpcomp0_ie                  1'b0
    17      R/W reg_lpcomp0_src_int_en          1'b0
    18      R/W reg_lpcomp0_src_aon_int_en      1'b0
    19      R/W reg_lpcomp0_deb_sel             1'b0
    30:20   R/W LPC0_CR0_Dummy                  11'b0
    31      R/W LPC0_CR1_Dummy                  1'b0
 */
typedef volatile union _AON_NS_LPC0_CR0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t reg_lpcomp0_deb_cnt: 8;
        uint32_t reg_lpcomp0_deb_div: 3;
        uint32_t reg_lpcomp0_deb_en: 1;
        uint32_t RSVD_2: 1;
        uint32_t reg_lpcomp0_single_output_en: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 1;
        uint32_t reg_lpcomp0_ie: 1;
        uint32_t reg_lpcomp0_src_int_en: 1;
        uint32_t reg_lpcomp0_src_aon_int_en: 1;
        uint32_t reg_lpcomp0_deb_sel: 1;
        uint32_t LPC0_CR0_Dummy: 11;
        uint32_t LPC0_CR1_Dummy: 1;
    };
} AON_NS_LPC0_CR0_TYPE;

/* 0x1854   0x4000_1854
    0       R   reg_lpcomp0_flag                1'b0
    1       R   reg_lpcomp0_out_aon_flag        1'b0
    31:2    R/W LPC0_SR_Dummy                   30'b0
 */
typedef volatile union _AON_NS_LPC0_SR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t reg_lpcomp0_flag: 1;
        uint32_t reg_lpcomp0_out_aon_flag: 1;
        uint32_t LPC0_SR_Dummy: 30;
    };
} AON_NS_LPC0_SR_TYPE;

/* 0x1858   0x4000_1858
    5:0     R/W MBIAS_REG0X_SD_TUNE             6'b0
    31:6    R   RSVD                            26'b0
 */
typedef volatile union _AON_NS_LPC0_MBIAS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t MBIAS_REG0X_SD_TUNE: 6;
        uint32_t RSVD: 26;
    };
} AON_NS_LPC0_MBIAS_TYPE;

/* 0x1900   0x4000_1900
    0       R/W PAD_P0_O[0]                     1'b0
    1       R/W PAD_P0_E[0]                     1'b0
    2       R/W PAD_P0_PU_EN[0]                 1'b1
    3       R/W AON_PAD_P0_PD[0]                1'b1
    4       R/W PAD_P0_PUPDC[0]                 1'b0
    5       R/W PAD_P0_WKEN[0]                  1'b0
    6       R/W PAD_P0_WKPOL[0]                 1'b0
    7       R/W PAD_P0_E2[0]                    1'b1
    8       R/W PAD_P0_SHDN[0]                  1'b1
    9       R/W PAD_P0_S[0]                     1'b0
    10      R/W PAD_P0_DEB[0]                   1'b0
    11      R/W PAD_P0_HS_MUX[0]                1'b0
    14:12   R   RSVD                            3'h0
    15      R/W PAD_P0_O_EN[0]                  1'h1
    16      R/W PAD_P0_O[1]                     1'b0
    17      R/W PAD_P0_E[1]                     1'b0
    18      R/W PAD_P0_PU_EN[1]                 1'b1
    19      R/W AON_PAD_P0_PD[1]                1'b1
    20      R/W PAD_P0_PUPDC[1]                 1'b0
    21      R/W PAD_P0_WKEN[1]                  1'b0
    22      R/W PAD_P0_WKPOL[1]                 1'b0
    23      R/W PAD_P0_E2[1]                    1'b1
    24      R/W PAD_P0_SHDN[1]                  1'b1
    25      R/W PAD_P0_S[1]                     1'b0
    26      R/W PAD_P0_DEB[1]                   1'b0
    27      R/W PAD_P0_HS_MUX[1]                1'b0
    28      R   RSVD                            1'b0
    29      R/W PAD_P0_1_CLK_OUT                1'b0
    30      R   RSVD                            1'h0
    31      R/W PAD_P0_O_EN[1]                  1'h1
 */
typedef volatile union _AON_NS_P0_0_P0_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_O_0: 1;
        uint32_t PAD_P0_E_0: 1;
        uint32_t PAD_P0_PU_EN_0: 1;
        uint32_t AON_PAD_P0_PD_0: 1;
        uint32_t PAD_P0_PUPDC_0: 1;
        uint32_t PAD_P0_WKEN_0: 1;
        uint32_t PAD_P0_WKPOL_0: 1;
        uint32_t PAD_P0_E2_0: 1;
        uint32_t PAD_P0_SHDN_0: 1;
        uint32_t PAD_P0_S_0: 1;
        uint32_t PAD_P0_DEB_0: 1;
        uint32_t PAD_P0_HS_MUX_0: 1;
        uint32_t RSVD_2: 3;
        uint32_t PAD_P0_O_EN_0: 1;
        uint32_t PAD_P0_O_1: 1;
        uint32_t PAD_P0_E_1: 1;
        uint32_t PAD_P0_PU_EN_1: 1;
        uint32_t AON_PAD_P0_PD_1: 1;
        uint32_t PAD_P0_PUPDC_1: 1;
        uint32_t PAD_P0_WKEN_1: 1;
        uint32_t PAD_P0_WKPOL_1: 1;
        uint32_t PAD_P0_E2_1: 1;
        uint32_t PAD_P0_SHDN_1: 1;
        uint32_t PAD_P0_S_1: 1;
        uint32_t PAD_P0_DEB_1: 1;
        uint32_t PAD_P0_HS_MUX_1: 1;
        uint32_t RSVD_1: 1;
        uint32_t PAD_P0_1_CLK_OUT: 1;
        uint32_t RSVD: 1;
        uint32_t PAD_P0_O_EN_1: 1;
    };
} AON_NS_P0_0_P0_1_PAD_CFG_TYPE;

/* 0x1904   0x4000_1904
    0       R/W PAD_P0_O[2]                     1'b0
    1       R/W PAD_P0_E[2]                     1'b0
    2       R/W PAD_P0_PU_EN[2]                 1'b1
    3       R/W AON_PAD_P0_PD[2]                1'b1
    4       R/W PAD_P0_PUPDC[2]                 1'b0
    5       R/W PAD_P0_WKEN[2]                  1'b0
    6       R/W PAD_P0_WKPOL[2]                 1'b0
    7       R/W PAD_P0_E2[2]                    1'b1
    8       R/W PAD_P0_SHDN[2]                  1'b1
    9       R/W PAD_P0_S[2]                     1'b0
    10      R/W PAD_P0_DEB[2]                   1'b0
    11      R/W PAD_P0_HS_MUX[2]                1'b0
    14:12   R   RSVD                            3'h0
    15      R/W PAD_P0_O_EN[2]                  1'h1
    16      R/W PAD_P0_O[3]                     1'b0
    17      R/W PAD_P0_E[3]                     1'b0
    18      R/W PAD_P0_PU_EN[3]                 1'b1
    19      R/W AON_PAD_P0_PD[3]                1'b0
    20      R/W PAD_P0_PUPDC[3]                 1'b0
    21      R/W PAD_P0_WKEN[3]                  1'b0
    22      R/W PAD_P0_WKPOL[3]                 1'b0
    23      R/W PAD_P0_E2[3]                    1'b1
    24      R/W PAD_P0_SHDN[3]                  1'b1
    25      R/W PAD_P0_S[3]                     1'b0
    26      R/W PAD_P0_DEB[3]                   1'b0
    27      R/W PAD_P0_HS_MUX[3]                1'b0
    28      R   PAD_P0_3_I                      1'b0
    29      R/W PAD_P0_3_CLK_OUT                1'b0
    30      R   RSVD                            1'h0
    31      R/W PAD_P0_O_EN[3]                  1'h1
 */
typedef volatile union _AON_NS_P0_2_P0_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_O_2: 1;
        uint32_t PAD_P0_E_2: 1;
        uint32_t PAD_P0_PU_EN_2: 1;
        uint32_t AON_PAD_P0_PD_2: 1;
        uint32_t PAD_P0_PUPDC_2: 1;
        uint32_t PAD_P0_WKEN_2: 1;
        uint32_t PAD_P0_WKPOL_2: 1;
        uint32_t PAD_P0_E2_2: 1;
        uint32_t PAD_P0_SHDN_2: 1;
        uint32_t PAD_P0_S_2: 1;
        uint32_t PAD_P0_DEB_2: 1;
        uint32_t PAD_P0_HS_MUX_2: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P0_O_EN_2: 1;
        uint32_t PAD_P0_O_3: 1;
        uint32_t PAD_P0_E_3: 1;
        uint32_t PAD_P0_PU_EN_3: 1;
        uint32_t AON_PAD_P0_PD_3: 1;
        uint32_t PAD_P0_PUPDC_3: 1;
        uint32_t PAD_P0_WKEN_3: 1;
        uint32_t PAD_P0_WKPOL_3: 1;
        uint32_t PAD_P0_E2_3: 1;
        uint32_t PAD_P0_SHDN_3: 1;
        uint32_t PAD_P0_S_3: 1;
        uint32_t PAD_P0_DEB_3: 1;
        uint32_t PAD_P0_HS_MUX_3: 1;
        uint32_t PAD_P0_3_I: 1;
        uint32_t PAD_P0_3_CLK_OUT: 1;
        uint32_t RSVD: 1;
        uint32_t PAD_P0_O_EN_3: 1;
    };
} AON_NS_P0_2_P0_3_PAD_CFG_TYPE;

/* 0x1908   0x4000_1908
    0       R/W PAD_P0_O[4]                     1'b0
    1       R/W PAD_P0_E[4]                     1'b0
    2       R/W PAD_P0_PU_EN[4]                 1'b1
    3       R/W AON_PAD_P0_PD[4]                1'b1
    4       R/W PAD_P0_PUPDC[4]                 1'b0
    5       R/W PAD_P0_WKEN[4]                  1'b0
    6       R/W PAD_P0_WKPOL[4]                 1'b0
    7       R/W PAD_P0_E2[4]                    1'b1
    8       R/W PAD_P0_SHDN[4]                  1'b1
    9       R/W PAD_P0_S[4]                     1'b0
    10      R/W PAD_P0_DEB[4]                   1'b0
    11      R/W PAD_P0_HS_MUX[4]                1'b0
    12      R   RSVD                            1'b0
    13      R/W PAD_P0_4_dbg_en                 1'b0
    14      R   RSVD                            1'h0
    15      R/W PAD_P0_O_EN[4]                  1'h1
    16      R/W PAD_P0_O[5]                     1'b0
    17      R/W PAD_P0_E[5]                     1'b0
    18      R/W PAD_P0_PU_EN[5]                 1'b1
    19      R/W AON_PAD_P0_PD[5]                1'b1
    20      R/W PAD_P0_PUPDC[5]                 1'b0
    21      R/W PAD_P0_WKEN[5]                  1'b0
    22      R/W PAD_P0_WKPOL[5]                 1'b0
    23      R/W PAD_P0_E2[5]                    1'b1
    24      R/W PAD_P0_SHDN[5]                  1'b1
    25      R/W PAD_P0_S[5]                     1'b0
    26      R/W PAD_P0_DEB[5]                   1'b0
    27      R/W PAD_P0_HS_MUX[5]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P0_O_EN[5]                  1'h1
 */
typedef volatile union _AON_NS_P0_4_P0_5_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_O_4: 1;
        uint32_t PAD_P0_E_4: 1;
        uint32_t PAD_P0_PU_EN_4: 1;
        uint32_t AON_PAD_P0_PD_4: 1;
        uint32_t PAD_P0_PUPDC_4: 1;
        uint32_t PAD_P0_WKEN_4: 1;
        uint32_t PAD_P0_WKPOL_4: 1;
        uint32_t PAD_P0_E2_4: 1;
        uint32_t PAD_P0_SHDN_4: 1;
        uint32_t PAD_P0_S_4: 1;
        uint32_t PAD_P0_DEB_4: 1;
        uint32_t PAD_P0_HS_MUX_4: 1;
        uint32_t RSVD_2: 1;
        uint32_t PAD_P0_4_dbg_en: 1;
        uint32_t RSVD_1: 1;
        uint32_t PAD_P0_O_EN_4: 1;
        uint32_t PAD_P0_O_5: 1;
        uint32_t PAD_P0_E_5: 1;
        uint32_t PAD_P0_PU_EN_5: 1;
        uint32_t AON_PAD_P0_PD_5: 1;
        uint32_t PAD_P0_PUPDC_5: 1;
        uint32_t PAD_P0_WKEN_5: 1;
        uint32_t PAD_P0_WKPOL_5: 1;
        uint32_t PAD_P0_E2_5: 1;
        uint32_t PAD_P0_SHDN_5: 1;
        uint32_t PAD_P0_S_5: 1;
        uint32_t PAD_P0_DEB_5: 1;
        uint32_t PAD_P0_HS_MUX_5: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P0_O_EN_5: 1;
    };
} AON_NS_P0_4_P0_5_PAD_CFG_TYPE;

/* 0x190C   0x4000_190c
    0       R/W PAD_P0_O[6]                     1'b0
    1       R/W PAD_P0_E[6]                     1'b0
    2       R/W PAD_P0_PU_EN[6]                 1'b1
    3       R/W AON_PAD_P0_PD[6]                1'b1
    4       R/W PAD_P0_PUPDC[6]                 1'b0
    5       R/W PAD_P0_WKEN[6]                  1'b0
    6       R/W PAD_P0_WKPOL[6]                 1'b0
    7       R/W PAD_P0_E2[6]                    1'b1
    8       R/W PAD_P0_SHDN[6]                  1'b1
    9       R/W PAD_P0_S[6]                     1'b0
    10      R/W PAD_P0_DEB[6]                   1'b0
    11      R/W PAD_P0_HS_MUX[6]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P0_O_EN[6]                  1'h1
    16      R/W PAD_P0_O[7]                     1'b0
    17      R/W PAD_P0_E[7]                     1'b0
    18      R/W PAD_P0_PU_EN[7]                 1'b1
    19      R/W AON_PAD_P0_PD[7]                1'b1
    20      R/W PAD_P0_PUPDC[7]                 1'b0
    21      R/W PAD_P0_WKEN[7]                  1'b0
    22      R/W PAD_P0_WKPOL[7]                 1'b0
    23      R/W PAD_P0_E2[7]                    1'b1
    24      R/W PAD_P0_SHDN[7]                  1'b1
    25      R/W PAD_P0_S[7]                     1'b0
    26      R/W PAD_P0_DEB[7]                   1'b0
    27      R/W PAD_P0_HS_MUX[7]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P0_O_EN[7]                  1'h1
 */
typedef volatile union _AON_NS_P0_6_P0_7_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_O_6: 1;
        uint32_t PAD_P0_E_6: 1;
        uint32_t PAD_P0_PU_EN_6: 1;
        uint32_t AON_PAD_P0_PD_6: 1;
        uint32_t PAD_P0_PUPDC_6: 1;
        uint32_t PAD_P0_WKEN_6: 1;
        uint32_t PAD_P0_WKPOL_6: 1;
        uint32_t PAD_P0_E2_6: 1;
        uint32_t PAD_P0_SHDN_6: 1;
        uint32_t PAD_P0_S_6: 1;
        uint32_t PAD_P0_DEB_6: 1;
        uint32_t PAD_P0_HS_MUX_6: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P0_O_EN_6: 1;
        uint32_t PAD_P0_O_7: 1;
        uint32_t PAD_P0_E_7: 1;
        uint32_t PAD_P0_PU_EN_7: 1;
        uint32_t AON_PAD_P0_PD_7: 1;
        uint32_t PAD_P0_PUPDC_7: 1;
        uint32_t PAD_P0_WKEN_7: 1;
        uint32_t PAD_P0_WKPOL_7: 1;
        uint32_t PAD_P0_E2_7: 1;
        uint32_t PAD_P0_SHDN_7: 1;
        uint32_t PAD_P0_S_7: 1;
        uint32_t PAD_P0_DEB_7: 1;
        uint32_t PAD_P0_HS_MUX_7: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P0_O_EN_7: 1;
    };
} AON_NS_P0_6_P0_7_PAD_CFG_TYPE;

