rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x1910   0x4000_1910
    0       R/W PAD_P1_O[0]                     1'b0
    1       R/W PAD_P1_E[0]                     1'b0
    2       R/W PAD_P1_PU_EN[0]                 1'b1
    3       R/W AON_PAD_P1_PD[0]                1'b0
    4       R/W PAD_P1_PUPDC[0]                 1'b0
    5       R/W PAD_P1_WKEN[0]                  1'b0
    6       R/W PAD_P1_WKPOL[0]                 1'b0
    7       R/W PAD_P1_E2[0]                    1'b1
    8       R/W PAD_P1_SHDN[0]                  1'b1
    9       R/W PAD_P1_S[0]                     1'b1
    10      R/W PAD_P1_DEB[0]                   1'b0
    14:11   R   RSVD                            4'h0
    15      R/W PAD_P1_O_EN[0]                  1'h1
    16      R/W PAD_P1_O[1]                     1'b0
    17      R/W PAD_P1_E[1]                     1'b0
    18      R/W PAD_P1_PU_EN[1]                 1'b1
    19      R/W AON_PAD_P1_PD[1]                1'b0
    20      R/W PAD_P1_PUPDC[1]                 1'b0
    21      R/W PAD_P1_WKEN[1]                  1'b0
    22      R/W PAD_P1_WKPOL[1]                 1'b0
    23      R/W PAD_P1_E2[1]                    1'b1
    24      R/W PAD_P1_SHDN[1]                  1'b1
    25      R/W PAD_P1_S[1]                     1'b1
    26      R/W PAD_P1_DEB[1]                   1'b0
    30:27   R   RSVD                            4'h0
    31      R/W PAD_P1_O_EN[1]                  1'h1
 */
typedef volatile union _AON_NS_P1_0_P1_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P1_O_0: 1;
        uint32_t PAD_P1_E_0: 1;
        uint32_t PAD_P1_PU_EN_0: 1;
        uint32_t AON_PAD_P1_PD_0: 1;
        uint32_t PAD_P1_PUPDC_0: 1;
        uint32_t PAD_P1_WKEN_0: 1;
        uint32_t PAD_P1_WKPOL_0: 1;
        uint32_t PAD_P1_E2_0: 1;
        uint32_t PAD_P1_SHDN_0: 1;
        uint32_t PAD_P1_S_0: 1;
        uint32_t PAD_P1_DEB_0: 1;
        uint32_t RSVD_1: 4;
        uint32_t PAD_P1_O_EN_0: 1;
        uint32_t PAD_P1_O_1: 1;
        uint32_t PAD_P1_E_1: 1;
        uint32_t PAD_P1_PU_EN_1: 1;
        uint32_t AON_PAD_P1_PD_1: 1;
        uint32_t PAD_P1_PUPDC_1: 1;
        uint32_t PAD_P1_WKEN_1: 1;
        uint32_t PAD_P1_WKPOL_1: 1;
        uint32_t PAD_P1_E2_1: 1;
        uint32_t PAD_P1_SHDN_1: 1;
        uint32_t PAD_P1_S_1: 1;
        uint32_t PAD_P1_DEB_1: 1;
        uint32_t RSVD: 4;
        uint32_t PAD_P1_O_EN_1: 1;
    };
} AON_NS_P1_0_P1_1_PAD_CFG_TYPE;

/* 0x1914   0x4000_1914
    0       R/W PAD_P1_O[2]                     1'b0
    1       R/W PAD_P1_E[2]                     1'b0
    2       R/W PAD_P1_PU_EN[2]                 1'b1
    3       R/W AON_PAD_P1_PD[2]                1'b1
    4       R/W PAD_P1_PUPDC[2]                 1'b0
    5       R/W PAD_P1_WKEN[2]                  1'b0
    6       R/W PAD_P1_WKPOL[2]                 1'b0
    7       R/W PAD_P1_E2[2]                    1'b1
    8       R/W PAD_P1_SHDN[2]                  1'b1
    9       R/W PAD_P1_S[2]                     1'b0
    10      R/W PAD_P1_DEB[2]                   1'b0
    11      R/W PAD_P1_HS_MUX[2]                1'b0
    14:12   R   RSVD                            3'h0
    15      R/W PAD_P1_O_EN[2]                  1'h1
    16      R/W PAD_P1_O[3]                     1'b0
    17      R/W PAD_P1_E[3]                     1'b0
    18      R/W PAD_P1_PU_EN[3]                 1'b1
    19      R/W AON_PAD_P1_PD[3]                1'b1
    20      R/W PAD_P1_PUPDC[3]                 1'b0
    21      R/W PAD_P1_WKEN[3]                  1'b0
    22      R/W PAD_P1_WKPOL[3]                 1'b0
    23      R/W PAD_P1_E2[3]                    1'b1
    24      R/W PAD_P1_SHDN[3]                  1'b1
    25      R/W PAD_P1_S[3]                     1'b0
    26      R/W PAD_P1_DEB[3]                   1'b0
    27      R/W PAD_P1_HS_MUX[3]                1'b0
    30:28   R   RSVD                            3'h0
    31      R/W PAD_P1_O_EN[3]                  1'h1
 */
typedef volatile union _AON_NS_P1_2_P1_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P1_O_2: 1;
        uint32_t PAD_P1_E_2: 1;
        uint32_t PAD_P1_PU_EN_2: 1;
        uint32_t AON_PAD_P1_PD_2: 1;
        uint32_t PAD_P1_PUPDC_2: 1;
        uint32_t PAD_P1_WKEN_2: 1;
        uint32_t PAD_P1_WKPOL_2: 1;
        uint32_t PAD_P1_E2_2: 1;
        uint32_t PAD_P1_SHDN_2: 1;
        uint32_t PAD_P1_S_2: 1;
        uint32_t PAD_P1_DEB_2: 1;
        uint32_t PAD_P1_HS_MUX_2: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P1_O_EN_2: 1;
        uint32_t PAD_P1_O_3: 1;
        uint32_t PAD_P1_E_3: 1;
        uint32_t PAD_P1_PU_EN_3: 1;
        uint32_t AON_PAD_P1_PD_3: 1;
        uint32_t PAD_P1_PUPDC_3: 1;
        uint32_t PAD_P1_WKEN_3: 1;
        uint32_t PAD_P1_WKPOL_3: 1;
        uint32_t PAD_P1_E2_3: 1;
        uint32_t PAD_P1_SHDN_3: 1;
        uint32_t PAD_P1_S_3: 1;
        uint32_t PAD_P1_DEB_3: 1;
        uint32_t PAD_P1_HS_MUX_3: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P1_O_EN_3: 1;
    };
} AON_NS_P1_2_P1_3_PAD_CFG_TYPE;

/* 0x1918   0x4000_1918
    0       R/W PAD_P1_O[4]                     1'b0
    1       R/W PAD_P1_E[4]                     1'b0
    2       R/W PAD_P1_PU_EN[4]                 1'b1
    3       R/W AON_PAD_P1_PD[4]                1'b1
    4       R/W PAD_P1_PUPDC[4]                 1'b0
    5       R/W PAD_P1_WKEN[4]                  1'b0
    6       R/W PAD_P1_WKPOL[4]                 1'b0
    7       R/W PAD_P1_E2[4]                    1'b1
    8       R/W PAD_P1_SHDN[4]                  1'b1
    9       R/W PAD_P1_S[4]                     1'b0
    10      R/W PAD_P1_DEB[4]                   1'b0
    11      R/W PAD_P1_HS_MUX[4]                1'b0
    14:12   R   RSVD                            3'h0
    15      R/W PAD_P1_O_EN[4]                  1'h1
    16      R/W PAD_P1_O[5]                     1'b0
    17      R/W PAD_P1_E[5]                     1'b0
    18      R/W PAD_P1_PU_EN[5]                 1'b1
    19      R/W AON_PAD_P1_PD[5]                1'b0
    20      R/W PAD_P1_PUPDC[5]                 1'b0
    21      R/W PAD_P1_WKEN[5]                  1'b0
    22      R/W PAD_P1_WKPOL[5]                 1'b0
    23      R/W PAD_P1_E2[5]                    1'b1
    24      R/W PAD_P1_SHDN[5]                  1'b1
    25      R/W PAD_P1_S[5]                     1'b0
    26      R/W PAD_P1_DEB[5]                   1'b0
    27      R/W PAD_P1_HS_MUX[5]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P1_O_EN[5]                  1'h1
 */
typedef volatile union _AON_NS_P1_4_P1_5_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P1_O_4: 1;
        uint32_t PAD_P1_E_4: 1;
        uint32_t PAD_P1_PU_EN_4: 1;
        uint32_t AON_PAD_P1_PD_4: 1;
        uint32_t PAD_P1_PUPDC_4: 1;
        uint32_t PAD_P1_WKEN_4: 1;
        uint32_t PAD_P1_WKPOL_4: 1;
        uint32_t PAD_P1_E2_4: 1;
        uint32_t PAD_P1_SHDN_4: 1;
        uint32_t PAD_P1_S_4: 1;
        uint32_t PAD_P1_DEB_4: 1;
        uint32_t PAD_P1_HS_MUX_4: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P1_O_EN_4: 1;
        uint32_t PAD_P1_O_5: 1;
        uint32_t PAD_P1_E_5: 1;
        uint32_t PAD_P1_PU_EN_5: 1;
        uint32_t AON_PAD_P1_PD_5: 1;
        uint32_t PAD_P1_PUPDC_5: 1;
        uint32_t PAD_P1_WKEN_5: 1;
        uint32_t PAD_P1_WKPOL_5: 1;
        uint32_t PAD_P1_E2_5: 1;
        uint32_t PAD_P1_SHDN_5: 1;
        uint32_t PAD_P1_S_5: 1;
        uint32_t PAD_P1_DEB_5: 1;
        uint32_t PAD_P1_HS_MUX_5: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P1_O_EN_5: 1;
    };
} AON_NS_P1_4_P1_5_PAD_CFG_TYPE;

/* 0x191C   0x4000_191c
    0       R/W PAD_P1_O[6]                     1'b0
    1       R/W PAD_P1_E[6]                     1'b0
    2       R/W PAD_P1_PU_EN[6]                 1'b1
    3       R/W AON_PAD_P1_PD[6]                1'b1
    4       R/W PAD_P1_PUPDC[6]                 1'b0
    5       R/W PAD_P1_WKEN[6]                  1'b0
    6       R/W PAD_P1_WKPOL[6]                 1'b0
    7       R/W PAD_P1_E2[6]                    1'b1
    8       R/W PAD_P1_SHDN[6]                  1'b1
    9       R/W PAD_P1_S[6]                     1'b0
    10      R/W PAD_P1_DEB[6]                   1'b0
    11      R/W PAD_P1_HS_MUX[6]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P1_O_EN[6]                  1'h1
    16      R/W PAD_P1_O[7]                     1'b0
    17      R/W PAD_P1_E[7]                     1'b0
    18      R/W PAD_P1_PU_EN[7]                 1'b1
    19      R/W AON_PAD_P1_PD[7]                1'b1
    20      R/W PAD_P1_PUPDC[7]                 1'b0
    21      R/W PAD_P1_WKEN[7]                  1'b0
    22      R/W PAD_P1_WKPOL[7]                 1'b0
    23      R/W PAD_P1_E2[7]                    1'b1
    24      R/W PAD_P1_SHDN[7]                  1'b1
    25      R/W PAD_P1_S[7]                     1'b0
    26      R/W PAD_P1_DEB[7]                   1'b0
    27      R/W PAD_P1_HS_MUX[7]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P1_O_EN[7]                  1'h1
 */
typedef volatile union _AON_NS_P1_6_P1_7_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P1_O_6: 1;
        uint32_t PAD_P1_E_6: 1;
        uint32_t PAD_P1_PU_EN_6: 1;
        uint32_t AON_PAD_P1_PD_6: 1;
        uint32_t PAD_P1_PUPDC_6: 1;
        uint32_t PAD_P1_WKEN_6: 1;
        uint32_t PAD_P1_WKPOL_6: 1;
        uint32_t PAD_P1_E2_6: 1;
        uint32_t PAD_P1_SHDN_6: 1;
        uint32_t PAD_P1_S_6: 1;
        uint32_t PAD_P1_DEB_6: 1;
        uint32_t PAD_P1_HS_MUX_6: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P1_O_EN_6: 1;
        uint32_t PAD_P1_O_7: 1;
        uint32_t PAD_P1_E_7: 1;
        uint32_t PAD_P1_PU_EN_7: 1;
        uint32_t AON_PAD_P1_PD_7: 1;
        uint32_t PAD_P1_PUPDC_7: 1;
        uint32_t PAD_P1_WKEN_7: 1;
        uint32_t PAD_P1_WKPOL_7: 1;
        uint32_t PAD_P1_E2_7: 1;
        uint32_t PAD_P1_SHDN_7: 1;
        uint32_t PAD_P1_S_7: 1;
        uint32_t PAD_P1_DEB_7: 1;
        uint32_t PAD_P1_HS_MUX_7: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P1_O_EN_7: 1;
    };
} AON_NS_P1_6_P1_7_PAD_CFG_TYPE;

/* 0x1920   0x4000_1920
    0       R/W PAD_P2_O[0]                     1'b0
    1       R/W PAD_P2_E[0]                     1'b0
    2       R/W PAD_P2_PU_EN[0]                 1'b1
    3       R/W AON_PAD_P2_PD[0]                1'b1
    4       R/W PAD_P2_PUPDC[0]                 1'b0
    5       R/W PAD_P2_WKEN[0]                  1'b0
    6       R/W PAD_P2_WKPOL[0]                 1'b0
    7       R/W PAD_P2_E2[0]                    1'b1
    8       R/W PAD_P2_SHDN[0]                  1'b1
    9       R/W PAD_P2_S[0]                     1'b0
    10      R/W PAD_P2_DEB[0]                   1'b0
    11      R/W PAD_P2_HS_MUX[0]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P2_O_EN[0]                  1'h1
    16      R/W PAD_P2_O[1]                     1'b0
    17      R/W PAD_P2_E[1]                     1'b0
    18      R/W PAD_P2_PU_EN[1]                 1'b1
    19      R/W AON_PAD_P2_PD[1]                1'b1
    20      R/W PAD_P2_PUPDC[1]                 1'b0
    21      R/W PAD_P2_WKEN[1]                  1'b0
    22      R/W PAD_P2_WKPOL[1]                 1'b0
    23      R/W PAD_P2_E2[1]                    1'b1
    24      R/W PAD_P2_SHDN[1]                  1'b1
    25      R/W PAD_P2_S[1]                     1'b0
    26      R/W PAD_P2_DEB[1]                   1'b0
    27      R/W PAD_P2_HS_MUX[1]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P2_O_EN[1]                  1'h1
 */
typedef volatile union _AON_NS_P2_0_P2_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P2_O_0: 1;
        uint32_t PAD_P2_E_0: 1;
        uint32_t PAD_P2_PU_EN_0: 1;
        uint32_t AON_PAD_P2_PD_0: 1;
        uint32_t PAD_P2_PUPDC_0: 1;
        uint32_t PAD_P2_WKEN_0: 1;
        uint32_t PAD_P2_WKPOL_0: 1;
        uint32_t PAD_P2_E2_0: 1;
        uint32_t PAD_P2_SHDN_0: 1;
        uint32_t PAD_P2_S_0: 1;
        uint32_t PAD_P2_DEB_0: 1;
        uint32_t PAD_P2_HS_MUX_0: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P2_O_EN_0: 1;
        uint32_t PAD_P2_O_1: 1;
        uint32_t PAD_P2_E_1: 1;
        uint32_t PAD_P2_PU_EN_1: 1;
        uint32_t AON_PAD_P2_PD_1: 1;
        uint32_t PAD_P2_PUPDC_1: 1;
        uint32_t PAD_P2_WKEN_1: 1;
        uint32_t PAD_P2_WKPOL_1: 1;
        uint32_t PAD_P2_E2_1: 1;
        uint32_t PAD_P2_SHDN_1: 1;
        uint32_t PAD_P2_S_1: 1;
        uint32_t PAD_P2_DEB_1: 1;
        uint32_t PAD_P2_HS_MUX_1: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P2_O_EN_1: 1;
    };
} AON_NS_P2_0_P2_1_PAD_CFG_TYPE;

/* 0x1924   0x4000_1924
    0       R/W PAD_P2_O[2]                     1'b0
    1       R/W PAD_P2_E[2]                     1'b0
    2       R/W PAD_P2_PU_EN[2]                 1'b1
    3       R/W AON_PAD_P2_PD[2]                1'b1
    4       R/W PAD_P2_PUPDC[2]                 1'b0
    5       R/W PAD_P2_WKEN[2]                  1'b0
    6       R/W PAD_P2_WKPOL[2]                 1'b0
    7       R/W PAD_P2_E2[2]                    1'b1
    8       R/W PAD_P2_SHDN[2]                  1'b1
    9       R/W PAD_P2_S[2]                     1'b0
    10      R/W PAD_P2_DEB[2]                   1'b0
    14:11   R   RSVD                            4'b0
    15      R/W PAD_P2_O_EN[2]                  1'h1
    16      R/W PAD_P2_O[3]                     1'b0
    17      R/W PAD_P2_E[3]                     1'b0
    18      R/W PAD_P2_PU_EN[3]                 1'b1
    19      R/W AON_PAD_P2_PD[3]                1'b1
    20      R/W PAD_P2_PUPDC[3]                 1'b0
    21      R/W PAD_P2_WKEN[3]                  1'b0
    22      R/W PAD_P2_WKPOL[3]                 1'b0
    23      R/W PAD_P2_E2[3]                    1'b1
    24      R/W PAD_P2_SHDN[3]                  1'b1
    25      R/W PAD_P2_S[3]                     1'b0
    26      R/W PAD_P2_DEB[3]                   1'b0
    30:27   R   RSVD                            4'b0
    31      R/W PAD_P2_O_EN[3]                  1'h1
 */
typedef volatile union _AON_NS_P2_2_P2_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P2_O_2: 1;
        uint32_t PAD_P2_E_2: 1;
        uint32_t PAD_P2_PU_EN_2: 1;
        uint32_t AON_PAD_P2_PD_2: 1;
        uint32_t PAD_P2_PUPDC_2: 1;
        uint32_t PAD_P2_WKEN_2: 1;
        uint32_t PAD_P2_WKPOL_2: 1;
        uint32_t PAD_P2_E2_2: 1;
        uint32_t PAD_P2_SHDN_2: 1;
        uint32_t PAD_P2_S_2: 1;
        uint32_t PAD_P2_DEB_2: 1;
        uint32_t RSVD_1: 4;
        uint32_t PAD_P2_O_EN_2: 1;
        uint32_t PAD_P2_O_3: 1;
        uint32_t PAD_P2_E_3: 1;
        uint32_t PAD_P2_PU_EN_3: 1;
        uint32_t AON_PAD_P2_PD_3: 1;
        uint32_t PAD_P2_PUPDC_3: 1;
        uint32_t PAD_P2_WKEN_3: 1;
        uint32_t PAD_P2_WKPOL_3: 1;
        uint32_t PAD_P2_E2_3: 1;
        uint32_t PAD_P2_SHDN_3: 1;
        uint32_t PAD_P2_S_3: 1;
        uint32_t PAD_P2_DEB_3: 1;
        uint32_t RSVD: 4;
        uint32_t PAD_P2_O_EN_3: 1;
    };
} AON_NS_P2_2_P2_3_PAD_CFG_TYPE;

