rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x1938   0x4000_1938
    0       R/W PAD_P3_O[4]                     1'b0
    1       R/W PAD_P3_E[4]                     1'b0
    2       R/W PAD_P3_PU_EN[4]                 1'b1
    3       R/W AON_PAD_P3_PD[4]                1'b1
    4       R/W PAD_P3_PUPDC[4]                 1'b0
    5       R/W PAD_P3_WKEN[4]                  1'b0
    6       R/W PAD_P3_WKPOL[4]                 1'b0
    7       R/W PAD_P3_E2[4]                    1'b1
    8       R/W PAD_P3_SHDN[4]                  1'b1
    9       R/W PAD_P3_S[4]                     1'b0
    10      R/W PAD_P3_DEB[4]                   1'b0
    11      R/W PAD_P3_HS_MUX[4]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P3_O_EN[4]                  1'h1
    16      R/W PAD_P3_O[5]                     1'b0
    17      R/W PAD_P3_E[5]                     1'b0
    18      R/W PAD_P3_PU_EN[5]                 1'b1
    19      R/W AON_PAD_P3_PD[5]                1'b1
    20      R/W PAD_P3_PUPDC[5]                 1'b0
    21      R/W PAD_P3_WKEN[5]                  1'b0
    22      R/W PAD_P3_WKPOL[5]                 1'b0
    23      R/W PAD_P3_E2[5]                    1'b1
    24      R/W PAD_P3_SHDN[5]                  1'b1
    25      R/W PAD_P3_S[5]                     1'b0
    26      R/W PAD_P3_DEB[5]                   1'b0
    27      R/W PAD_P3_HS_MUX[5]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P3_O_EN[5]                  1'h1
 */
typedef volatile union _AON_NS_P3_4_P3_5_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P3_O_4: 1;
        uint32_t PAD_P3_E_4: 1;
        uint32_t PAD_P3_PU_EN_4: 1;
        uint32_t AON_PAD_P3_PD_4: 1;
        uint32_t PAD_P3_PUPDC_4: 1;
        uint32_t PAD_P3_WKEN_4: 1;
        uint32_t PAD_P3_WKPOL_4: 1;
        uint32_t PAD_P3_E2_4: 1;
        uint32_t PAD_P3_SHDN_4: 1;
        uint32_t PAD_P3_S_4: 1;
        uint32_t PAD_P3_DEB_4: 1;
        uint32_t PAD_P3_HS_MUX_4: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P3_O_EN_4: 1;
        uint32_t PAD_P3_O_5: 1;
        uint32_t PAD_P3_E_5: 1;
        uint32_t PAD_P3_PU_EN_5: 1;
        uint32_t AON_PAD_P3_PD_5: 1;
        uint32_t PAD_P3_PUPDC_5: 1;
        uint32_t PAD_P3_WKEN_5: 1;
        uint32_t PAD_P3_WKPOL_5: 1;
        uint32_t PAD_P3_E2_5: 1;
        uint32_t PAD_P3_SHDN_5: 1;
        uint32_t PAD_P3_S_5: 1;
        uint32_t PAD_P3_DEB_5: 1;
        uint32_t PAD_P3_HS_MUX_5: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P3_O_EN_5: 1;
    };
} AON_NS_P3_4_P3_5_PAD_CFG_TYPE;

/* 0x193C   0x4000_193c
    0       R/W PAD_P3_O[6]                     1'b0
    1       R/W PAD_P3_E[6]                     1'b0
    2       R/W PAD_P3_PU_EN[6]                 1'b1
    3       R/W AON_PAD_P3_PD[6]                1'b1
    4       R/W PAD_P3_PUPDC[6]                 1'b0
    5       R/W PAD_P3_WKEN[6]                  1'b0
    6       R/W PAD_P3_WKPOL[6]                 1'b0
    7       R/W PAD_P3_E2[6]                    1'b1
    8       R/W PAD_P3_SHDN[6]                  1'b1
    9       R/W PAD_P3_S[6]                     1'b0
    10      R/W PAD_P3_DEB[6]                   1'b0
    11      R/W PAD_P3_HS_MUX[6]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P3_O_EN[6]                  1'h1
    16      R/W PAD_P3_O[7]                     1'b0
    17      R/W PAD_P3_E[7]                     1'b0
    18      R/W PAD_P3_PU_EN[7]                 1'b1
    19      R/W AON_PAD_P3_PD[7]                1'b1
    20      R/W PAD_P3_PUPDC[7]                 1'b0
    21      R/W PAD_P3_WKEN[7]                  1'b0
    22      R/W PAD_P3_WKPOL[7]                 1'b0
    23      R/W PAD_P3_E2[7]                    1'b1
    24      R/W PAD_P3_SHDN[7]                  1'b1
    25      R/W PAD_P3_S[7]                     1'b0
    26      R/W PAD_P3_DEB[7]                   1'b0
    27      R/W PAD_P3_HS_MUX[7]                1'b0
    29:28   R   RSVD                            2'b0
    30      R/W PAD_P3_7_CFG                    1'h0
    31      R/W PAD_P3_O_EN[7]                  1'h1
 */
typedef volatile union _AON_NS_P3_6_P3_7_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P3_O_6: 1;
        uint32_t PAD_P3_E_6: 1;
        uint32_t PAD_P3_PU_EN_6: 1;
        uint32_t AON_PAD_P3_PD_6: 1;
        uint32_t PAD_P3_PUPDC_6: 1;
        uint32_t PAD_P3_WKEN_6: 1;
        uint32_t PAD_P3_WKPOL_6: 1;
        uint32_t PAD_P3_E2_6: 1;
        uint32_t PAD_P3_SHDN_6: 1;
        uint32_t PAD_P3_S_6: 1;
        uint32_t PAD_P3_DEB_6: 1;
        uint32_t PAD_P3_HS_MUX_6: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P3_O_EN_6: 1;
        uint32_t PAD_P3_O_7: 1;
        uint32_t PAD_P3_E_7: 1;
        uint32_t PAD_P3_PU_EN_7: 1;
        uint32_t AON_PAD_P3_PD_7: 1;
        uint32_t PAD_P3_PUPDC_7: 1;
        uint32_t PAD_P3_WKEN_7: 1;
        uint32_t PAD_P3_WKPOL_7: 1;
        uint32_t PAD_P3_E2_7: 1;
        uint32_t PAD_P3_SHDN_7: 1;
        uint32_t PAD_P3_S_7: 1;
        uint32_t PAD_P3_DEB_7: 1;
        uint32_t PAD_P3_HS_MUX_7: 1;
        uint32_t RSVD: 2;
        uint32_t PAD_P3_7_CFG: 1;
        uint32_t PAD_P3_O_EN_7: 1;
    };
} AON_NS_P3_6_P3_7_PAD_CFG_TYPE;

/* 0x1940   0x4000_1940
    0       R/W PAD_P4_O[0]                     1'b0
    1       R/W PAD_P4_E[0]                     1'b0
    2       R/W PAD_P4_PU_EN[0]                 1'b1
    3       R/W AON_PAD_P4_PD[0]                1'b1
    4       R/W PAD_P4_PUPDC[0]                 1'b0
    5       R/W PAD_P4_WKEN[0]                  1'b0
    6       R/W PAD_P4_WKPOL[0]                 1'b0
    7       R/W PAD_P4_E2[0]                    1'b1
    8       R/W PAD_P4_SHDN[0]                  1'b1
    9       R/W PAD_P4_S[0]                     1'b0
    10      R/W PAD_P4_DEB[0]                   1'b0
    11      R/W PAD_P4_HS_MUX[0]                1'b0
    13:12   R/W PAD_P4_0_CFG                    2'h0
    14      R/W PAD_P4_O_EN[0]                  1'h1
    15      R   RSVD                            1'b0
    16      R/W PAD_P4_O[1]                     1'b0
    17      R/W PAD_P4_E[1]                     1'b0
    18      R/W PAD_P4_PU_EN[1]                 1'b1
    19      R/W AON_PAD_P4_PD[1]                1'b1
    20      R/W PAD_P4_PUPDC[1]                 1'b0
    21      R/W PAD_P4_WKEN[1]                  1'b0
    22      R/W PAD_P4_WKPOL[1]                 1'b0
    23      R/W PAD_P4_E2[1]                    1'b1
    24      R/W PAD_P4_SHDN[1]                  1'b1
    25      R/W PAD_P4_S[1]                     1'b0
    26      R/W PAD_P4_DEB[1]                   1'b0
    27      R/W PAD_P4_HS_MUX[1]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P4_O_EN[1]                  1'h1
 */
typedef volatile union _AON_NS_P4_0_P4_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P4_O_0: 1;
        uint32_t PAD_P4_E_0: 1;
        uint32_t PAD_P4_PU_EN_0: 1;
        uint32_t AON_PAD_P4_PD_0: 1;
        uint32_t PAD_P4_PUPDC_0: 1;
        uint32_t PAD_P4_WKEN_0: 1;
        uint32_t PAD_P4_WKPOL_0: 1;
        uint32_t PAD_P4_E2_0: 1;
        uint32_t PAD_P4_SHDN_0: 1;
        uint32_t PAD_P4_S_0: 1;
        uint32_t PAD_P4_DEB_0: 1;
        uint32_t PAD_P4_HS_MUX_0: 1;
        uint32_t PAD_P4_0_CFG: 2;
        uint32_t PAD_P4_O_EN_0: 1;
        uint32_t RSVD_1: 1;
        uint32_t PAD_P4_O_1: 1;
        uint32_t PAD_P4_E_1: 1;
        uint32_t PAD_P4_PU_EN_1: 1;
        uint32_t AON_PAD_P4_PD_1: 1;
        uint32_t PAD_P4_PUPDC_1: 1;
        uint32_t PAD_P4_WKEN_1: 1;
        uint32_t PAD_P4_WKPOL_1: 1;
        uint32_t PAD_P4_E2_1: 1;
        uint32_t PAD_P4_SHDN_1: 1;
        uint32_t PAD_P4_S_1: 1;
        uint32_t PAD_P4_DEB_1: 1;
        uint32_t PAD_P4_HS_MUX_1: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P4_O_EN_1: 1;
    };
} AON_NS_P4_0_P4_1_PAD_CFG_TYPE;

/* 0x1944   0x4000_1944
    0       R/W PAD_P4_O[2]                     1'b0
    1       R/W PAD_P4_E[2]                     1'b0
    2       R/W PAD_P4_PU_EN[2]                 1'b1
    3       R/W AON_PAD_P4_PD[2]                1'b1
    4       R/W PAD_P4_PUPDC[2]                 1'b0
    5       R/W PAD_P4_WKEN[2]                  1'b0
    6       R/W PAD_P4_WKPOL[2]                 1'b0
    7       R/W PAD_P4_E2[2]                    1'b1
    8       R/W PAD_P4_SHDN[2]                  1'b1
    9       R/W PAD_P4_S[2]                     1'b0
    10      R/W PAD_P4_DEB[2]                   1'b0
    11      R/W PAD_P4_HS_MUX[2]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P4_O_EN[2]                  1'h1
    16      R/W PAD_P4_O[3]                     1'b0
    17      R/W PAD_P4_E[3]                     1'b0
    18      R/W PAD_P4_PU_EN[3]                 1'b1
    19      R/W AON_PAD_P4_PD[3]                1'b0
    20      R/W PAD_P4_PUPDC[3]                 1'b0
    21      R/W PAD_P4_WKEN[3]                  1'b0
    22      R/W PAD_P4_WKPOL[3]                 1'b0
    23      R/W PAD_P4_E2[3]                    1'b1
    24      R/W PAD_P4_SHDN[3]                  1'b1
    25      R/W PAD_P4_S[3]                     1'b0
    26      R/W PAD_P4_DEB[3]                   1'b0
    27      R/W PAD_P4_HS_MUX[3]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P4_O_EN[3]                  1'h1
 */
typedef volatile union _AON_NS_P4_2_P4_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P4_O_2: 1;
        uint32_t PAD_P4_E_2: 1;
        uint32_t PAD_P4_PU_EN_2: 1;
        uint32_t AON_PAD_P4_PD_2: 1;
        uint32_t PAD_P4_PUPDC_2: 1;
        uint32_t PAD_P4_WKEN_2: 1;
        uint32_t PAD_P4_WKPOL_2: 1;
        uint32_t PAD_P4_E2_2: 1;
        uint32_t PAD_P4_SHDN_2: 1;
        uint32_t PAD_P4_S_2: 1;
        uint32_t PAD_P4_DEB_2: 1;
        uint32_t PAD_P4_HS_MUX_2: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P4_O_EN_2: 1;
        uint32_t PAD_P4_O_3: 1;
        uint32_t PAD_P4_E_3: 1;
        uint32_t PAD_P4_PU_EN_3: 1;
        uint32_t AON_PAD_P4_PD_3: 1;
        uint32_t PAD_P4_PUPDC_3: 1;
        uint32_t PAD_P4_WKEN_3: 1;
        uint32_t PAD_P4_WKPOL_3: 1;
        uint32_t PAD_P4_E2_3: 1;
        uint32_t PAD_P4_SHDN_3: 1;
        uint32_t PAD_P4_S_3: 1;
        uint32_t PAD_P4_DEB_3: 1;
        uint32_t PAD_P4_HS_MUX_3: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P4_O_EN_3: 1;
    };
} AON_NS_P4_2_P4_3_PAD_CFG_TYPE;

/* 0x1948   0x4000_1948
    0       R/W PAD_32K_XI_O                    1'b0
    1       R/W PAD_32K_XI_E                    1'b0
    2       R/W PAD_32K_XI_PU_EN                1'b1
    3       R/W AON_PAD_32K_XI_PD               1'b1
    4       R/W PAD_32K_XI_PUPDC                1'b0
    5       R/W PAD_32K_XI_WKEN                 1'b0
    6       R/W PAD_32K_XI_WKPOL                1'b0
    7       R/W PAD_32K_XI_E2                   1'b1
    8       R/W PAD_32K_XI_SHDN                 1'b1
    9       R/W PAD_32K_XI_S                    1'b0
    10      R/W PAD_32K_XI_DEB                  1'b0
    12:11   R   RSVD                            2'b0
    13      R/W PAD_32K_XI_dbg_en               1'b0
    14      R   RSVD                            1'h0
    15      R/W PAD_32K_XI_O_EN                 1'h1
    16      R/W PAD_32K_XO_O                    1'b0
    17      R/W PAD_32K_XO_E                    1'b0
    18      R/W PAD_32K_XO_PU_EN                1'b1
    19      R/W AON_PAD_32K_XO_PD               1'b1
    20      R/W PAD_32K_XO_PUPDC                1'b0
    21      R/W PAD_32K_XO_WKEN                 1'b0
    22      R/W PAD_32K_XO_WKPOL                1'b0
    23      R/W PAD_32K_XO_E2                   1'b1
    24      R/W PAD_32K_XO_SHDN                 1'b1
    25      R/W PAD_32K_XO_S                    1'b0
    26      R/W PAD_32K_XO_DEB                  1'b0
    28:27   R   RSVD                            2'b0
    29      R/W PAD_32K_XO_dbg_en               1'b0
    30      R   RSVD                            1'h0
    31      R/W PAD_32K_XO_O_EN                 1'h1
 */
typedef volatile union _AON_NS_P32K_XI_P32K_XO_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_32K_XI_O: 1;
        uint32_t PAD_32K_XI_E: 1;
        uint32_t PAD_32K_XI_PU_EN: 1;
        uint32_t AON_PAD_32K_XI_PD: 1;
        uint32_t PAD_32K_XI_PUPDC: 1;
        uint32_t PAD_32K_XI_WKEN: 1;
        uint32_t PAD_32K_XI_WKPOL: 1;
        uint32_t PAD_32K_XI_E2: 1;
        uint32_t PAD_32K_XI_SHDN: 1;
        uint32_t PAD_32K_XI_S: 1;
        uint32_t PAD_32K_XI_DEB: 1;
        uint32_t RSVD_3: 2;
        uint32_t PAD_32K_XI_dbg_en: 1;
        uint32_t RSVD_2: 1;
        uint32_t PAD_32K_XI_O_EN: 1;
        uint32_t PAD_32K_XO_O: 1;
        uint32_t PAD_32K_XO_E: 1;
        uint32_t PAD_32K_XO_PU_EN: 1;
        uint32_t AON_PAD_32K_XO_PD: 1;
        uint32_t PAD_32K_XO_PUPDC: 1;
        uint32_t PAD_32K_XO_WKEN: 1;
        uint32_t PAD_32K_XO_WKPOL: 1;
        uint32_t PAD_32K_XO_E2: 1;
        uint32_t PAD_32K_XO_SHDN: 1;
        uint32_t PAD_32K_XO_S: 1;
        uint32_t PAD_32K_XO_DEB: 1;
        uint32_t RSVD_1: 2;
        uint32_t PAD_32K_XO_dbg_en: 1;
        uint32_t RSVD: 1;
        uint32_t PAD_32K_XO_O_EN: 1;
    };
} AON_NS_P32K_XI_P32K_XO_PAD_CFG_TYPE;

