rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x198C   0x4000_198c
    0       R/W PAD_P7_O[4]                     1'b0
    1       R/W PAD_P7_E[4]                     1'b0
    2       R/W PAD_P7_PU_EN[4]                 1'b1
    3       R/W AON_PAD_P7_PD[4]                1'b1
    4       R/W PAD_P7_PUPDC[4]                 1'b0
    5       R/W PAD_P7_WKEN[4]                  1'b0
    6       R/W PAD_P7_WKPOL[4]                 1'b0
    7       R/W PAD_P7_E2[4]                    1'b1
    8       R/W PAD_P7_SHDN[4]                  1'b1
    9       R/W PAD_P7_S[4]                     1'b0
    10      R/W PAD_P7_DEB[4]                   1'b0
    11      R/W PAD_P7_HS_MUX[4]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P7_O_EN[4]                  1'h1
    16      R   RSVD                            1'b0
    17      R   RSVD                            1'b0
    18      R   RSVD                            1'b1
    19      R   RSVD                            1'b0
    20      R   RSVD                            1'b0
    21      R   RSVD                            1'b0
    22      R   RSVD                            1'b0
    23      R   RSVD                            1'b0
    24      R   RSVD                            1'b1
    25      R   RSVD                            1'b0
    26      R   RSVD                            1'b0
    31:27   R   RSVD                            5'b0
 */
typedef volatile union _AON_NS_P7_4_P7_5_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P7_O_4: 1;
        uint32_t PAD_P7_E_4: 1;
        uint32_t PAD_P7_PU_EN_4: 1;
        uint32_t AON_PAD_P7_PD_4: 1;
        uint32_t PAD_P7_PUPDC_4: 1;
        uint32_t PAD_P7_WKEN_4: 1;
        uint32_t PAD_P7_WKPOL_4: 1;
        uint32_t PAD_P7_E2_4: 1;
        uint32_t PAD_P7_SHDN_4: 1;
        uint32_t PAD_P7_S_4: 1;
        uint32_t PAD_P7_DEB_4: 1;
        uint32_t PAD_P7_HS_MUX_4: 1;
        uint32_t RSVD_12: 3;
        uint32_t PAD_P7_O_EN_4: 1;
        uint32_t RSVD_11: 1;
        uint32_t RSVD_10: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t RSVD_5: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 5;
    };
} AON_NS_P7_4_P7_5_PAD_CFG_TYPE;

/* 0x1990   0x4000_1990
    31:0    R   RSVD                            32'b0
 */
typedef volatile union _AON_NS_P7_6_P7_7_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_NS_P7_6_P7_7_PAD_CFG_TYPE;

/* 0x1994   0x4000_1994
    0       R/W PAD_SPI_SCK_O                   1'b0
    1       R/W PAD_SPI_SCK_E                   1'b0
    2       R/W PAD_SPI_SCK_PU_EN               1'b1
    3       R/W AON_PAD_SPI_SCK_PD              1'b0
    4       R/W PAD_SPI_SCK_PUPDC               1'b0
    5       R   RSVD                            1'b0
    6       R   RSVD                            1'b0
    7       R/W PAD_SPI_SCK_E2                  1'b1
    8       R/W PAD_SPI_SCK_SHDN                1'b1
    9       R   RSVD                            1'b0
    10      R   RSVD                            1'b0
    11      R/W PAD_SPI_SCK_HS_MUX              1'b0
    15:12   R   RSVD                            4'b0
    16      R/W PAD_SPI_CSN_O                   1'b0
    17      R/W PAD_SPI_CSN_E                   1'b0
    18      R/W PAD_SPI_CSN_PU_EN               1'b1
    19      R/W AON_PAD_SPI_CSN_PD              1'b0
    20      R/W PAD_SPI_CSN_PUPDC               1'b0
    21      R   RSVD                            1'b0
    22      R   RSVD                            1'b0
    23      R/W PAD_SPI_CSN_E2                  1'b1
    24      R/W PAD_SPI_CSN_SHDN                1'b1
    25      R   RSVD                            1'b0
    26      R   RSVD                            1'b0
    27      R/W PAD_SPI_CSN_HS_MUX              1'b0
    31:28   R   RSVD                            4'b0
 */
typedef volatile union _AON_NS_SPIC0_PAD_CFG0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_SPI_SCK_O: 1;
        uint32_t PAD_SPI_SCK_E: 1;
        uint32_t PAD_SPI_SCK_PU_EN: 1;
        uint32_t AON_PAD_SPI_SCK_PD: 1;
        uint32_t PAD_SPI_SCK_PUPDC: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t PAD_SPI_SCK_E2: 1;
        uint32_t PAD_SPI_SCK_SHDN: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t PAD_SPI_SCK_HS_MUX: 1;
        uint32_t RSVD_5: 4;
        uint32_t PAD_SPI_CSN_O: 1;
        uint32_t PAD_SPI_CSN_E: 1;
        uint32_t PAD_SPI_CSN_PU_EN: 1;
        uint32_t AON_PAD_SPI_CSN_PD: 1;
        uint32_t PAD_SPI_CSN_PUPDC: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t PAD_SPI_CSN_E2: 1;
        uint32_t PAD_SPI_CSN_SHDN: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t PAD_SPI_CSN_HS_MUX: 1;
        uint32_t RSVD: 4;
    };
} AON_NS_SPIC0_PAD_CFG0_TYPE;

/* 0x1998   0x4000_1998
    0       R/W PAD_SPI_SIO0_O                  1'b0
    1       R/W PAD_SPI_SIO0_E                  1'b0
    2       R/W PAD_SPI_SIO0_PU_EN              1'b1
    3       R/W AON_PAD_SPI_SIO0_PD             1'b1
    4       R/W PAD_SPI_SIO0_PUPDC              1'b0
    5       R   RSVD                            1'b0
    6       R   RSVD                            1'b0
    7       R/W PAD_SPI_SIO0_E2                 1'b1
    8       R/W PAD_SPI_SIO0_SHDN               1'b1
    9       R   RSVD                            1'b0
    10      R   RSVD                            1'b0
    11      R/W PAD_SPI_SIO0_HS_MUX             1'b0
    15:12   R   RSVD                            4'b0
    16      R/W PAD_SPI_SIO1_O                  1'b0
    17      R/W PAD_SPI_SIO1_E                  1'b0
    18      R/W PAD_SPI_SIO1_PU_EN              1'b1
    19      R/W AON_PAD_SPI_SIO1_PD             1'b1
    20      R/W PAD_SPI_SIO1_PUPDC              1'b0
    21      R   RSVD                            1'b0
    22      R   RSVD                            1'b0
    23      R/W PAD_SPI_SIO1_E2                 1'b1
    24      R/W PAD_SPI_SIO1_SHDN               1'b1
    25      R   RSVD                            1'b0
    26      R   RSVD                            1'b0
    27      R/W PAD_SPI_SIO1_HS_MUX             1'b0
    31:28   R   RSVD                            4'b0
 */
typedef volatile union _AON_NS_SPIC0_PAD_CFG1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_SPI_SIO0_O: 1;
        uint32_t PAD_SPI_SIO0_E: 1;
        uint32_t PAD_SPI_SIO0_PU_EN: 1;
        uint32_t AON_PAD_SPI_SIO0_PD: 1;
        uint32_t PAD_SPI_SIO0_PUPDC: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t PAD_SPI_SIO0_E2: 1;
        uint32_t PAD_SPI_SIO0_SHDN: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t PAD_SPI_SIO0_HS_MUX: 1;
        uint32_t RSVD_5: 4;
        uint32_t PAD_SPI_SIO1_O: 1;
        uint32_t PAD_SPI_SIO1_E: 1;
        uint32_t PAD_SPI_SIO1_PU_EN: 1;
        uint32_t AON_PAD_SPI_SIO1_PD: 1;
        uint32_t PAD_SPI_SIO1_PUPDC: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t PAD_SPI_SIO1_E2: 1;
        uint32_t PAD_SPI_SIO1_SHDN: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t PAD_SPI_SIO1_HS_MUX: 1;
        uint32_t RSVD: 4;
    };
} AON_NS_SPIC0_PAD_CFG1_TYPE;

