rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x1AEC   0x4000_1aec
    31:0    R/W FW_APP_3X                       32'h0
 */
typedef volatile union _AON_NS_REG3X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_3X;
    };
} AON_NS_REG3X_APP_TYPE;

/* 0x1AF0   0x4000_1af0
    31:0    R/W FW_APP_4X                       32'h0
 */
typedef volatile union _AON_NS_REG4X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_4X;
    };
} AON_NS_REG4X_APP_TYPE;

/* 0x1AF4   0x4000_1af4
    31:0    R/W FW_APP_5X                       32'h0
 */
typedef volatile union _AON_NS_REG5X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_5X;
    };
} AON_NS_REG5X_APP_TYPE;

/* 0x1AF8   0x4000_1af8
    31:0    R/W FW_APP_6X                       32'h0
 */
typedef volatile union _AON_NS_REG6X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_6X;
    };
} AON_NS_REG6X_APP_TYPE;

/* 0x1AFC   0x4000_1afc
    31:0    R/W FW_APP_7X                       32'h0
 */
typedef volatile union _AON_NS_REG7X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_7X;
    };
} AON_NS_REG7X_APP_TYPE;

/* 0x1B00   0x4000_1b00
    31:0    R/W FW_APP_8X                       32'h0
 */
typedef volatile union _AON_NS_REG8X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_8X;
    };
} AON_NS_REG8X_APP_TYPE;

/* 0x1B04   0x4000_1b04
    31:0    R/W FW_APP_9X                       32'h0
 */
typedef volatile union _AON_NS_REG9X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_9X;
    };
} AON_NS_REG9X_APP_TYPE;

/* 0x1B08   0x4000_1b08
    31:0    R/W FW_APP_10X                      32'h0
 */
typedef volatile union _AON_NS_REG10X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_10X;
    };
} AON_NS_REG10X_APP_TYPE;

/* 0x1B0C   0x4000_1b0c
    31:0    R/W FW_APP_11X                      32'h0
 */
typedef volatile union _AON_NS_REG11X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_11X;
    };
} AON_NS_REG11X_APP_TYPE;

/* 0x1B10   0x4000_1b10
    31:0    R/W FW_APP_12X                      32'h0
 */
typedef volatile union _AON_NS_REG12X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_12X;
    };
} AON_NS_REG12X_APP_TYPE;

/* 0x1B14   0x4000_1b14
    31:0    R/W FW_APP_13X                      32'h0
 */
typedef volatile union _AON_NS_REG13X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_13X;
    };
} AON_NS_REG13X_APP_TYPE;

/* 0x1B18   0x4000_1b18
    31:0    R/W FW_APP_14X                      32'h0
 */
typedef volatile union _AON_NS_REG14X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_14X;
    };
} AON_NS_REG14X_APP_TYPE;

/* 0x1B1C   0x4000_1b1c
    31:0    R/W FW_APP_15X                      32'h0
 */
typedef volatile union _AON_NS_REG15X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_15X;
    };
} AON_NS_REG15X_APP_TYPE;

/* 0x1B60   0x4000_1b60
    15:0    R/W AON_WDG_WP                      16'h0
    31:16   R/W RSVD                            16'h0
 */
typedef volatile union _AON_NS_AON_WDG_WP0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON_WDG_WP: 16;
        uint32_t RSVD: 16;
    };
} AON_NS_AON_WDG_WP0_TYPE;

/* 0x1B64   0x4000_1b64
    15:0    R/W AON_WDG_CLK_DIV_FACTOR          16'hC80
    27:16   R/W AON_WDG_CNT_LIMIT               12'h6E
    28      R/W AON_WDG_MODE                    1'b0
    29      R/W AON_WDG_CNT_CTL                 1'b0
    30      R/W AON_WDG_CNT_RELOAD              1'b0
    31      R/W AON_WDG_ENABLE                  1'b0
 */
typedef volatile union _AON_NS_AON_WDG_CONFIG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON_WDG_CLK_DIV_FACTOR: 16;
        uint32_t AON_WDG_CNT_LIMIT: 12;
        uint32_t AON_WDG_MODE: 1;
        uint32_t AON_WDG_CNT_CTL: 1;
        uint32_t AON_WDG_CNT_RELOAD: 1;
        uint32_t AON_WDG_ENABLE: 1;
    };
} AON_NS_AON_WDG_CONFIG_TYPE;

/* 0x1B68   0x4000_1b68
    15:0    R/WACAON_WDG_CNT_RESET               16'h0
    31:16   R/WACRSVD                            16'h0
 */
typedef volatile union _AON_NS_AON_WDG_CNT_RESET0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON_WDG_CNT_RESET: 16;
        uint32_t RSVD: 16;
    };
} AON_NS_AON_WDG_CNT_RESET0_TYPE;

/* 0x1B6C   0x4000_1b6c
    0       R/W AON_WDG_WP_SEC                  1'b0
    1       R/W AON_WDG_CONFIG_SEC              1'b0
    2       R/W AON_WDG_RESET_SEC               1'b0
    31:3    R/W RSVD                            29'b0
 */
typedef volatile union _AON_NS_AON_WDG_SEC_CTL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON_WDG_WP_SEC: 1;
        uint32_t AON_WDG_CONFIG_SEC: 1;
        uint32_t AON_WDG_RESET_SEC: 1;
        uint32_t RSVD: 29;
    };
} AON_NS_AON_WDG_SEC_CTL_TYPE;

/* 0x1B90   0x4000_1b90
    0       R/W anapar_pow_ad<0>                1'b0
    1       R/W anapar_pow_ad<1>                1'b0
    2       R/W anapar_pow_ad<2>                1'b0
    3       R/W EN_ILIMIT                       1'b0
    4       R/W EN_VREF_SW                      1'b0
    5       R/W EN_VREF_RC_BYPASS               1'b0
    6       R/W REG0X_LDO_DUMMY                 1'b0
    7       R/W hw_pd                           1'b1
    15:8    R/W REG0X_LDO_DUMMY2                8'b0
    22:16   R/W REG_LDO_TUNE<6:0>               7'b1011111
    25:23   R/W LDO_SW[2:0]                     3'b100
    26      R/W AUX_LDO_VPULSE                  1'b0
    27      R/W SELLDO                          1'b1
    28      R/W AUX_DOUBLE_OP_I                 1'b0
    30:29   R/W LDOBW                           2'b11
    31      R/W Power                           1'b1
 */
typedef volatile union _AON_NS_REG0X_LDO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t anapar_pow_ad_0: 1;
        uint32_t anapar_pow_ad_1: 1;
        uint32_t anapar_pow_ad_2: 1;
        uint32_t EN_ILIMIT: 1;
        uint32_t EN_VREF_SW: 1;
        uint32_t EN_VREF_RC_BYPASS: 1;
        uint32_t REG0X_LDO_DUMMY: 1;
        uint32_t hw_pd: 1;
        uint32_t REG0X_LDO_DUMMY2: 8;
        uint32_t REG_LDO_TUNE_6_0: 7;
        uint32_t LDO_SW_2_0: 3;
        uint32_t AUX_LDO_VPULSE: 1;
        uint32_t SELLDO: 1;
        uint32_t AUX_DOUBLE_OP_I: 1;
        uint32_t LDOBW: 2;
        uint32_t Power: 1;
    };
} AON_NS_REG0X_LDO_TYPE;

/* 0x1B94   0x4000_1b94
    0       R/W pow                             1'b0
    1       R/W pow_ref                         1'b0
    2       R/W reg_ck                          1'b0
    3       R/W reg_delay                       1'b0
    5:4     R/W reg_vref_sel[1:0]               2'b10
    6       R/W reg_revck                       1'b0
    8:7     R/W reg_cmpdec[1:0]                 2'b00
    9       R/W reg_meta                        1'b0
    10      R/W sel_ln                          1'b0
    11      R/W sel_lna                         1'b1
    13:12   R/W reg_vcm_sel<1:0>                2'b01
    15:14   R/W REG0X_AUX_V09_DUMMY             2'b00
    23:16   R/W bypassen[7:0]                   8'b00000000
    31:24   R/W REG1X_AUX_dummy                 8'b0
 */
typedef volatile union _AON_NS_REG0X_AUX_V09_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t pow: 1;
        uint32_t pow_ref: 1;
        uint32_t reg_ck: 1;
        uint32_t reg_delay: 1;
        uint32_t reg_vref_sel_1_0: 2;
        uint32_t reg_revck: 1;
        uint32_t reg_cmpdec_1_0: 2;
        uint32_t reg_meta: 1;
        uint32_t sel_ln: 1;
        uint32_t sel_lna: 1;
        uint32_t reg_vcm_sel_1_0: 2;
        uint32_t REG0X_AUX_V09_DUMMY: 2;
        uint32_t bypassen_7_0: 8;
        uint32_t REG1X_AUX_dummy: 8;
    };
} AON_NS_REG0X_AUX_V09_TYPE;

/* 0x1B98   0x4000_1b98
    0       R/W POW_SD_H                        1'b0
    4:1     R/W CH_NUM_H[3:0]                   4'b0000
    5       R/W SD_POSEDGE_H                    1'b1
    7:6     R/W REG0X_SD_DUMMY                  2'b00
    15:8    R/W REG0X_SD_DUMMY2                 8'b0
    31:16   R   RSVD                            16'b0
 */
typedef volatile union _AON_NS_REG0X_SD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t POW_SD_H: 1;
        uint32_t CH_NUM_H_3_0: 4;
        uint32_t SD_POSEDGE_H: 1;
        uint32_t REG0X_SD_DUMMY: 2;
        uint32_t REG0X_SD_DUMMY2: 8;
        uint32_t RSVD: 16;
    };
} AON_NS_REG0X_SD_TYPE;

/* 0x1BD0   0x4000_1bd0
    1:0     R/W X_INITIAL_PHASE                 2'b0
    2       R/W X_SET_INITAL_PHASE              1'b0
    3       R/W X_CNT_PAUSE                     1'b0
    4       R/W X_CNT_SCALE                     1'b0
    5       R/W X_ILLEGAL_INT_EN                1'b0
    6       R/W X_CNT_INT_EN                    1'b0
    7       R/W ILLEGAL_INT_MASK                1'b1
    8       R/W CNT_INT_MASK                    1'b1
    21:9    R/W X_DEBOUNCE_CNT                  13'b0
    22      R/W X_DEBOUNCE_EN                   1'b0
    23      R/W X_WAKE_AON_MASK                 1'b1
    24      R/W X_INT_MASK                      1'b1
    28:25   R/W REG_CONFIG_DUMMY1               4'b0
    29      R/W X_RST                           1'b0
    30      R/WACX_FSM_EN                        1'b0
    31      R/W X_AXIS_EN                       1'b0
 */
typedef volatile union _AON_NS_REG_CONFIG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t X_INITIAL_PHASE: 2;
        uint32_t X_SET_INITAL_PHASE: 1;
        uint32_t X_CNT_PAUSE: 1;
        uint32_t X_CNT_SCALE: 1;
        uint32_t X_ILLEGAL_INT_EN: 1;
        uint32_t X_CNT_INT_EN: 1;
        uint32_t ILLEGAL_INT_MASK: 1;
        uint32_t CNT_INT_MASK: 1;
        uint32_t X_DEBOUNCE_CNT: 13;
        uint32_t X_DEBOUNCE_EN: 1;
        uint32_t X_WAKE_AON_MASK: 1;
        uint32_t X_INT_MASK: 1;
        uint32_t REG_CONFIG_DUMMY1: 4;
        uint32_t X_RST: 1;
        uint32_t X_FSM_EN: 1;
        uint32_t X_AXIS_EN: 1;
    };
} AON_NS_REG_CONFIG_TYPE;

