rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x1BD4   0x4000_1bd4
    15:0    R   ACC_CNT                         1'b0
    16      R/W1CCNT_OF_FLG                      1'b0
    17      R/W1CCNT_UF_FLG                      1'b0
    18      R/W1CCNT_INT_STA                     1'b0
    19      R/W1CILLEGAL_INT_STA                 1'b0
    20      R   CNT_DIR                         1'b0
    21      R/W REG_SR_X_DUMMY                  1'b0
    23:22   R   debug_state_x                   1'b0
    31:24   R   debug_illegal_counter_x         1'b0
 */
typedef volatile union _AON_NS_REG_SR_X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ACC_CNT: 16;
        uint32_t CNT_OF_FLG: 1;
        uint32_t CNT_UF_FLG: 1;
        uint32_t CNT_INT_STA: 1;
        uint32_t ILLEGAL_INT_STA: 1;
        uint32_t CNT_DIR: 1;
        uint32_t REG_SR_X_DUMMY: 1;
        uint32_t debug_state_x: 2;
        uint32_t debug_illegal_counter_x: 8;
    };
} AON_NS_REG_SR_X_TYPE;

/* 0x1BD8   0x4000_1bd8
    0       R/WACACC_CNT_CLR                     1'b0
    1       R/WACCNT_INT_CLR                     1'b0
    2       R/WACOF_FLG_CLR                      1'b0
    3       R/WACUF_FLG_CLR                      1'b0
    4       R/WACILLEGAL_INT_CLR                 1'b0
    5       R/WACILLEGAL_CNT_CLR                 1'b0
    31:6    R/W INT_CLR_DUMMY                   26'b0
 */
typedef volatile union _AON_NS_INT_CLR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ACC_CNT_CLR: 1;
        uint32_t CNT_INT_CLR: 1;
        uint32_t OF_FLG_CLR: 1;
        uint32_t UF_FLG_CLR: 1;
        uint32_t ILLEGAL_INT_CLR: 1;
        uint32_t ILLEGAL_CNT_CLR: 1;
        uint32_t INT_CLR_DUMMY: 26;
    };
} AON_NS_INT_CLR_TYPE;

/* 0x1C00   0x4000_1c00
    31:0    R   r_km4_core_wdt_lat_km4_pc_value 32'b0
 */
typedef volatile union _AON_NS_REG30_CORE_KM4_PC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_core_wdt_lat_km4_pc_value;
    };
} AON_NS_REG30_CORE_KM4_PC_TYPE;

/* 0x1C04   0x4000_1c04
    31:0    R   r_km4_core_wdt_lat_km4_lr       32'b0
 */
typedef volatile union _AON_NS_REG34_CORE_KM4_LR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_core_wdt_lat_km4_lr;
    };
} AON_NS_REG34_CORE_KM4_LR_TYPE;

/* 0x1C08   0x4000_1c08
    31:0    R   r_km4_core_wdt_lat_km4_pc_ex    32'b0
 */
typedef volatile union _AON_NS_REG38_CORE_KM4_PC_EX_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_core_wdt_lat_km4_pc_ex;
    };
} AON_NS_REG38_CORE_KM4_PC_EX_TYPE;

/* 0x1C0C   0x4000_1c0c
    31:0    R   r_km4_core_wdt_lat_km4_xpsr_r   32'b0
 */
typedef volatile union _AON_NS_REG3C_CORE_KM4_XPSR_R_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_core_wdt_lat_km4_xpsr_r;
    };
} AON_NS_REG3C_CORE_KM4_XPSR_R_TYPE;

/* 0x1C10   0x4000_1c10
    31:0    R   r_km4_core_wdt_lat_km4_msp_s    32'b0
 */
typedef volatile union _AON_NS_REG40_CORE_KM4_MSP_S_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_core_wdt_lat_km4_msp_s;
    };
} AON_NS_REG40_CORE_KM4_MSP_S_TYPE;

/* 0x1C14   0x4000_1c14
    31:0    R   r_km4_core_wdt_lat_km4_psp_s    32'b0
 */
typedef volatile union _AON_NS_REG44_CORE_KM4_PSP_S_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_core_wdt_lat_km4_psp_s;
    };
} AON_NS_REG44_CORE_KM4_PSP_S_TYPE;

/* 0x1C18   0x4000_1c18
    31:0    R   r_km4_core_wdt_lat_km4_msp_ns   32'b0
 */
typedef volatile union _AON_NS_REG48_CORE_KM4_MSP_NS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_core_wdt_lat_km4_msp_ns;
    };
} AON_NS_REG48_CORE_KM4_MSP_NS_TYPE;

/* 0x1C1C   0x4000_1c1c
    31:0    R   r_km4_core_wdt_lat_km4_psp_ns   32'b0
 */
typedef volatile union _AON_NS_REG4C_CORE_KM4_PSP_NS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_core_wdt_lat_km4_psp_ns;
    };
} AON_NS_REG4C_CORE_KM4_PSP_NS_TYPE;

/* 0x1C20   0x4000_1c20
    31:0    R   r_km4_aon_wdt_lat_km4_pc_value  32'b0
 */
typedef volatile union _AON_NS_REG50_AON_KM4_PC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_aon_wdt_lat_km4_pc_value;
    };
} AON_NS_REG50_AON_KM4_PC_TYPE;

/* 0x1C24   0x4000_1c24
    31:0    R   r_km4_aon_wdt_lat_km4_lr        32'b0
 */
typedef volatile union _AON_NS_REG54_AON_KM4_LR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_aon_wdt_lat_km4_lr;
    };
} AON_NS_REG54_AON_KM4_LR_TYPE;

/* 0x1C28   0x4000_1c28
    31:0    R   r_km4_aon_wdt_lat_km4_pc_ex     32'b0
 */
typedef volatile union _AON_NS_REG58_AON_KM4_PC_EX_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_aon_wdt_lat_km4_pc_ex;
    };
} AON_NS_REG58_AON_KM4_PC_EX_TYPE;

/* 0x1C2C   0x4000_1c2c
    31:0    R   r_km4_aon_wdt_lat_km4_xpsr_r    32'b0
 */
typedef volatile union _AON_NS_REG5C_AON_KM4_XPSR_R_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_aon_wdt_lat_km4_xpsr_r;
    };
} AON_NS_REG5C_AON_KM4_XPSR_R_TYPE;

/* 0x1C30   0x4000_1c30
    31:0    R   r_km4_aon_wdt_lat_km4_msp_s     32'b0
 */
typedef volatile union _AON_NS_REG60_AON_KM4_MSP_S_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_aon_wdt_lat_km4_msp_s;
    };
} AON_NS_REG60_AON_KM4_MSP_S_TYPE;

/* 0x1C34   0x4000_1c34
    31:0    R   r_km4_aon_wdt_lat_km4_psp_s     32'b0
 */
typedef volatile union _AON_NS_REG64_AON_KM4_PSP_S_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_aon_wdt_lat_km4_psp_s;
    };
} AON_NS_REG64_AON_KM4_PSP_S_TYPE;

/* 0x1C38   0x4000_1c38
    31:0    R   r_km4_aon_wdt_lat_km4_msp_ns    32'b0
 */
typedef volatile union _AON_NS_REG68_AON_KM4_MSP_NS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_aon_wdt_lat_km4_msp_ns;
    };
} AON_NS_REG68_AON_KM4_MSP_NS_TYPE;

/* 0x1C3C   0x4000_1c3c
    31:0    R   r_km4_aon_wdt_lat_km4_psp_ns    32'b0
 */
typedef volatile union _AON_NS_REG6C_AON_KM4_PSP_NS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_aon_wdt_lat_km4_psp_ns;
    };
} AON_NS_REG6C_AON_KM4_PSP_NS_TYPE;

/* 0x1C40   0x4000_1c40
    1:0     R   r_aon_wdt_mode                  2'b0
    2       R   r_aon_wdt_timeout_flag          1'b0
    31:3    R   RSVD                            29'b0
 */
typedef volatile union _AON_NS_REG_AON_WDT_MODE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_aon_wdt_mode: 2;
        uint32_t r_aon_wdt_timeout_flag: 1;
        uint32_t RSVD: 29;
    };
} AON_NS_REG_AON_WDT_MODE_TYPE;

/* 0x1C44   0x4000_1c44
    1:0     R   r_km4_wdt_mode                  2'b0
    2       R   r_km4_wdt_timeout_flag          1'b0
    31:3    R   RSVD                            29'b0
 */
typedef volatile union _AON_NS_REG_KM4_WDT_MODE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_km4_wdt_mode: 2;
        uint32_t r_km4_wdt_timeout_flag: 1;
        uint32_t RSVD: 29;
    };
} AON_NS_REG_KM4_WDT_MODE_TYPE;

/* 0x1D00   0x4000_1d00
    0       R/W km4_aon_boot_done               1'b0
    1       R/W km4_pon_boot_done               1'b0
    2       R/W km4_dvfs_normal_vdd_mode        1'b0
    3       R/W km4_boot_rsvd0                  1'b0
    4       R/W is_pf_rtc_clk_32000Hz           1'b0
    5       R/W is_user_rtc_clk_32000Hz         1'b0
    6       R/W is_btmac_clk_32000Hz            1'b0
    7       R/W is_aon_clk_32000Hz              1'b0
    8       R/W is_systick_clk_32000Hz          1'b0
    9       R/W is_hci_mode                     1'b0
    10      R/W is_single_tone_mode             1'b0
    31:11   R/W km4_boot_rsvd1                  21'b0
 */
typedef volatile union _AON_NS_REG0X_FW_GENERAL_NS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t km4_aon_boot_done: 1;
        uint32_t km4_pon_boot_done: 1;
        uint32_t km4_dvfs_normal_vdd_mode: 1;
        uint32_t km4_boot_rsvd0: 1;
        uint32_t is_pf_rtc_clk_32000Hz: 1;
        uint32_t is_user_rtc_clk_32000Hz: 1;
        uint32_t is_btmac_clk_32000Hz: 1;
        uint32_t is_aon_clk_32000Hz: 1;
        uint32_t is_systick_clk_32000Hz: 1;
        uint32_t is_hci_mode: 1;
        uint32_t is_single_tone_mode: 1;
        uint32_t km4_boot_rsvd1: 21;
    };
} AON_NS_REG0X_FW_GENERAL_NS_TYPE;

