rtkconnectivity/hal_realtek/bee/rtl87x2g/boot/inc/rtl876x_aon_reg.h
/* 0x1D04   0x4000_1d04
    15:0    R/W FW_GENERAL_NS_REG2X             16'h0
    31:16   R/W FW_GENERAL_NS_REG3X             16'h0
 */
typedef volatile union _AON_NS_REG2X_FW_GENERAL_NS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_NS_REG2X: 16;
        uint32_t FW_GENERAL_NS_REG3X: 16;
    };
} AON_NS_REG2X_FW_GENERAL_NS_TYPE;

/* 0x1D08   0x4000_1d08
    15:0    R/W FW_GENERAL_NS_REG4X             16'h0
    31:16   R/W FW_GENERAL_NS_REG5X             16'h0
 */
typedef volatile union _AON_NS_REG4X_FW_GENERAL_NS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_NS_REG4X: 16;
        uint32_t FW_GENERAL_NS_REG5X: 16;
    };
} AON_NS_REG4X_FW_GENERAL_NS_TYPE;

/* 0x1D0C   0x4000_1d0c
    15:0    R/W FW_GENERAL_NS_REG6X             16'h0
    31:16   R/W FW_GENERAL_NS_REG7X             16'h0
 */
typedef volatile union _AON_NS_REG6X_FW_GENERAL_NS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_NS_REG6X: 16;
        uint32_t FW_GENERAL_NS_REG7X: 16;
    };
} AON_NS_REG6X_FW_GENERAL_NS_TYPE;

/* 0x1D10   0x4000_1d10
    0       R/W ota_mode                        1'b0
    1       R/W is_ft_mode                      1'b0
    15:2    R/W rsvd                            14'h0
    31:16   R/W FW_GENERAL_NS_REG9X             16'h0
 */
typedef volatile union _AON_NS_REG8X_FW_GENERAL_NS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ota_mode: 1;
        uint32_t is_ft_mode: 1;
        uint32_t rsvd: 14;
        uint32_t FW_GENERAL_NS_REG9X: 16;
    };
} AON_NS_REG8X_FW_GENERAL_NS_TYPE;

/* 0x1D14   0x4000_1d14
    15:0    R/W FW_GENERAL_NS_REG10X            16'h0
    31:16   R/W FW_GENERAL_NS_REG11X            16'h0
 */
typedef volatile union _AON_NS_REG10X_FW_GENERAL_NS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_NS_REG10X: 16;
        uint32_t FW_GENERAL_NS_REG11X: 16;
    };
} AON_NS_REG10X_FW_GENERAL_NS_TYPE;

/* 0x1D80   0x4000_1d80
    7:0     R/W PAD_P0_E_LCD[7:0]               8'b0
    9:8     R   RSVD                            2'b0
    15:10   R/W PAD_P1_E_LCD[7:2]               6'b0
    23:16   R   RSVD                            8'b0
    25:24   R   RSVD                            2'b0
    31:26   R/W PAD_P3_E_LCD[7:2]               6'b0
 */
typedef volatile union _AON_NS_P3_P1_PAD_E_LCD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_E_LCD_7_0: 8;
        uint32_t RSVD_2: 2;
        uint32_t PAD_P1_E_LCD_7_2: 6;
        uint32_t RSVD_1: 8;
        uint32_t RSVD: 2;
        uint32_t PAD_P3_E_LCD_7_2: 6;
    };
} AON_NS_P3_P1_PAD_E_LCD_CFG_TYPE;

/* 0x1D84   0x4000_1d84
    7:0     R/W PAD_P4_E_LCD[7:0]               8'b0
    13:8    R/W PAD_P5_E_LCD[5:0]               6'b0
    15:14   R   RSVD                            2'b0
    23:16   R   RSVD                            8'b0
    31:24   R   RSVD                            8'b0
 */
typedef volatile union _AON_NS_P7_P4_PAD_E_LCD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P4_E_LCD_7_0: 8;
        uint32_t PAD_P5_E_LCD_5_0: 6;
        uint32_t RSVD_2: 2;
        uint32_t RSVD_1: 8;
        uint32_t RSVD: 8;
    };
} AON_NS_P7_P4_PAD_E_LCD_CFG_TYPE;

/* 0x1D88   0x4000_1d88
    7:0     R   RSVD                            8'b0
    10:8    R/W PAD_P9_E_LCD[2:0]               3'b0
    15:11   R   RSVD                            5'b0
    23:16   R   RSVD                            8'b0
    31:24   R   RSVD                            8'b0
 */
typedef volatile union _AON_NS_P11_P8_PAD_E_LCD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD_3: 8;
        uint32_t PAD_P9_E_LCD_2_0: 3;
        uint32_t RSVD_2: 5;
        uint32_t RSVD_1: 8;
        uint32_t RSVD: 8;
    };
} AON_NS_P11_P8_PAD_E_LCD_CFG_TYPE;

/* 0x1D8C   0x4000_1d8c
    7:0     R/W PAD_P0_SHDN_LCD[7:0]            8'b0
    9:8     R   RSVD                            2'b0
    15:10   R/W PAD_P1_SHDN_LCD[7:2]            6'b0
    23:16   R   RSVD                            8'b0
    25:24   R   RSVD                            2'b0
    31:26   R/W PAD_P3_SHDN_LCD[7:2]            6'b0
 */
typedef volatile union _AON_NS_P3_P1_PAD_SHDN_LCD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_SHDN_LCD_7_0: 8;
        uint32_t RSVD_2: 2;
        uint32_t PAD_P1_SHDN_LCD_7_2: 6;
        uint32_t RSVD_1: 8;
        uint32_t RSVD: 2;
        uint32_t PAD_P3_SHDN_LCD_7_2: 6;
    };
} AON_NS_P3_P1_PAD_SHDN_LCD_CFG_TYPE;

/* 0x1D90   0x4000_1d90
    7:0     R/W PAD_P4_SHDN_LCD[7:0]            8'b0
    13:8    R/W PAD_P5_SHDN_LCD[5:0]            6'b0
    15:14   R   RSVD                            2'b0
    23:16   R   RSVD                            8'b0
    31:24   R   RSVD                            8'b0
 */
typedef volatile union _AON_NS_P7_P4_PAD_SHDN_LCD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P4_SHDN_LCD_7_0: 8;
        uint32_t PAD_P5_SHDN_LCD_5_0: 6;
        uint32_t RSVD_2: 2;
        uint32_t RSVD_1: 8;
        uint32_t RSVD: 8;
    };
} AON_NS_P7_P4_PAD_SHDN_LCD_CFG_TYPE;

/* 0x1D94   0x4000_1d94
    7:0     R   RSVD                            8'b0
    10:8    R/W PAD_P9_SHDN_LCD[2:0]            3'b0
    15:11   R   RSVD                            5'b0
    23:16   R   RSVD                            8'b0
    31:24   R   RSVD                            8'b0
 */
typedef volatile union _AON_NS_P11_P8_PAD_SHDN_LCD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD_3: 8;
        uint32_t PAD_P9_SHDN_LCD_2_0: 3;
        uint32_t RSVD_2: 5;
        uint32_t RSVD_1: 8;
        uint32_t RSVD: 8;
    };
} AON_NS_P11_P8_PAD_SHDN_LCD_CFG_TYPE;

/* 0x1DC0   0x4000_1dc0
    4:0     R/W REG0X_SDADC_LDO_DUMMY           5'b01010
    5       R/W REG_POCDB_SDADC                 1'b0
    6       R/W REG_ANAPAR_POW_LDO<0>           1'b0
    7       R/W REG_ANAPAR_POW_LDO<1>           1'b0
    12:8    R/W REG_ANAPAR_LDO<4:0>             5'b10000
    13      R/W REG_ANAPAR_LDO<5>               1'b0
    14      R/W REG_ANAPAR_LDO<6>               1'b0
    15      R/W REG_ANAPAR_LDO<7>               1'b0
    17:16   R/W REG_ANAPAR_LDO<9:8>             2'b00
    18      R/W REG_ANAPAR_LDO<10>              1'b0
    21:19   R/W REG_ANAPAR_LDO<13:11>           3'b100
    24:22   R/W REG_ANAPAR_LDO<16:14>           3'b100
    25      R/W REG_ANAPAR_LDO<17>              1'b0
    26      R/W REG_ANAPAR_LDO<18>              1'b0
    31:27   R/W REG_ANAPAR_LDO<23:17>           5'b10101
 */
typedef volatile union _AON_NS_REG0X_SDADC_LDO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG0X_SDADC_LDO_DUMMY: 5;
        uint32_t REG_POCDB_SDADC: 1;
        uint32_t REG_ANAPAR_POW_LDO_0: 1;
        uint32_t REG_ANAPAR_POW_LDO_1: 1;
        uint32_t REG_ANAPAR_LDO_4_0: 5;
        uint32_t REG_ANAPAR_LDO_5: 1;
        uint32_t REG_ANAPAR_LDO_6: 1;
        uint32_t REG_ANAPAR_LDO_7: 1;
        uint32_t REG_ANAPAR_LDO_9_8: 2;
        uint32_t REG_ANAPAR_LDO_10: 1;
        uint32_t REG_ANAPAR_LDO_13_11: 3;
        uint32_t REG_ANAPAR_LDO_16_14: 3;
        uint32_t REG_ANAPAR_LDO_17: 1;
        uint32_t REG_ANAPAR_LDO_18: 1;
        uint32_t REG_ANAPAR_LDO_23_17: 5;
    } b;
} AON_NS_REG0X_SDADC_LDO_TYPE;

#define AON_REG_BASE 0x40000000

#define AON_REG_READ(Offset)                                            \
    ((uint32_t)*((volatile uint32_t*)(AON_REG_BASE+(Offset))))

#define AON_REG_WRITE(Offset, Value)                                    \
    ((*((volatile uint32_t*)(AON_REG_BASE + (Offset)))) = (Value))

#define AON_REG_UPDATE(Offset, Mask, Value)                             \
    do {                                                                \
        uint32_t temp;                                                  \
        temp = AON_REG_READ(Offset) & ~(Mask);                          \
        AON_REG_WRITE(Offset, (temp | ((Value) & (Mask))));             \
    } while(0)

#define AON_REG_READ_BITFIELD(Offset, Bitfield)                         \
    (((Offset##_TYPE)AON_REG_READ(Offset)).Bitfield)

#define AON_REG_WRITE_BITFIELD(Offset, Bitfield, Value)                 \
    do {                                                                \
        Offset##_TYPE temp = {.d32 = AON_REG_READ(Offset)};             \
        temp.Bitfield = Value;                                          \
        AON_REG_WRITE(Offset, temp.d32);                                \
    } while(0)
#endif
